{
  "nomeCorso": "Automi e linguaggi formali",
  "docente": [
    {
      "first_name": "Stefano",
      "second_name": "Varricchio"
    }
  ],
  "annoAccademico": "2005-2006",
  "crediti": "9",
  "settore": "",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Di seguito vengo riportati gli argomenti trattati nelle singole lezioni.\r\nL'aggiornamento sara' effettuato al termine di ogni lezione.\r\n\r\nLezione del 3 Marzo 2006.  Automi a stati finiti deterministici e non deterministici.  Diagrammi di transizione   di automi finiti. Linguaggi accettati. Esempi.\r\nLezione del 8 Marzo  2006. Equivalenza fra automi deterministici e non deterministici.  Proprieta' di chiusura dei linguaggi regolari.\r\n\r\nLezione del  10 Marzo 2006.   Famiglia dei linguaggi razionali. Teorema di Kleene.  Alcune proprieta dei linguaggi regolari.\r\n                          Pumping lemma. \r\nLezione del 15 Marzo 2006.   Semigruppi, monoidi, morfismi, conguenze.  Sottoinsiemi riconoscibili di un monoide.\r\n\r\nLezione del 17 Marzo 2006.  Equivalenza di Nerode di un linguaggio. Proprieta' dell'equivalenza di Nerode. Teorema di Nerode. Automa di Nerode e sua minimalita'.\r\n\r\nLezione del 22 Marzo 2006. Congruenza sintattica di un linguaggio e sue proprieta'.  Monoide sintattico. Teorema di Myhill. Equivalenza tra regolarita' di un linguaggio e riconoscibilita' astratta (mediante morfismi). \r\n\r\nLezione del 24 Marzo 2006.  Nozione di congruenza di un automa deterministico. Automa quoziente. Congruenza standard di un automa e sue proprieta'. Automi connessi. Automi ridotti. Caratterizzazione di automi minimali.  Morfismi tra automi. \r\n\r\nLezione del 29 Marzo 2006. Teorema di unicita' dell'automa minimale. Algoritmo di minimizzazione. \r\n\r\nLezione del 31 Marzo 2006. Problemi decisionali su automi e\r\n linguaggi regolari. Automi di Mealy. Automi di Moore. Equivalenza tra automi di Mealy e di Moore.\r\n\r\nLezione del 5 Aprile 2006. Chiusura dei linguaggi regolari rispettp a morfismi e morfismi inversi. Linguaggi locali. Teorema di Medvedev. Automi di Moore, di Mealy e loro equivalenza\r\n\r\nLezione del 7 Aprile 2006. Automi two-way deterministici e non deterministici.  Crossing sequences. Equivalenza tra automi two-way e automi one-way. \r\n\r\nLezione del 19 Aprile 2006. Logica e linguaggi formali.  Formule logiche del primo ordine. Forma normale prenessa. Stringhe come modelli della logica del primo ordine. \r\n\r\nLezione del 21 Aprile 2006.  Formule monadiche del secondo ordine. Teorema di Buchi.  Linguaggi star-free. Caratterizzazione dei linguaggi definibili da formule del primo ordine.\r\n\r\n\r\nLezione del 26 Aprile 2006. Insiemi riconoscibili di un monoide. Propieta' di chiusura degli insiemi riconoscibili. Teorema di Mezei sulla caratterizzazione degli insiemi riconoscibili di un prodotto diretto di monoidi. \r\n\r\nLezione del 28 Aprile 2006. Insiemi razionali di un monoide. Teoremi di McKnight. Proprieta' di chiusura degli insiemi razionali. Relazioni riconoscibili. Relazioni razionali.\r\n\r\nLezione del 3 Maggio 2006. Caratterizzazioni delle relazioni razionali: Teorema di Nivat.  Trasduzioni razionali. Caratterizzazioni delle trasduzioni razionali.\r\n\r\nLezione del 10 Maggio 2006. Preblemi decidibili e indecidibili per le relazioni razionali.\r\n\r\n\r\nLezione del  17 Maggio 2006. Applicazioni degli automi a problemi di ricerca di strinche in un testo. Rappresentazione di automi mediante liste di adiacenza. Automi con failure function e loro rappresentazione compatta.\r\n\r\n  \r\nLezione del 19 Maggio 2006. Dictionary matching problem.  Dictionary matching automaton e complessita' della sua costruzione.\r\n\r\n\r\nLezione del 24 Maggio 2006. String matching problem. String matching automaton e complessita della sua costruzione.\r\n\r\nLezione del 26 Maggio 2006. Suffix automaton di una stringa e sue proprieta'. Size del suffix automaton.\r\n\r\nLezione del 31 Maggio 2006.  Algoritmo per la costruzione del suffix-automaton di una stringa. Uso del suffix automaton in problemi di string matching.\r\n\r\n\r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>null</td></tr></table>",
  "ricevimento": "<table><tr><td>null</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}