{
  "nomeCorso": "Programmazione dei calcolatori con laboratorio",
  "docente": [
    {
      "first_name": "Gianluca",
      "second_name": "Rossi"
    }
  ],
  "annoAccademico": "2021-2022",
  "crediti": "12",
  "settore": "INF/01",
  "anno": "1",
  "semestre": "1-2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "",
      "data": "04-10-2021 10:53",
      "contenuto": "<p>Le lezioni di <strong>Programazione dei Calcolatori con Laboratorio</strong> inizieranno martedì <strong>12</strong> <strong>ottobre.</strong></p>\n<p> </p>\n<p>Le lezioni inizieranno alle ore 14:15 e termineranno alle ore 15:45 senza interruzioni.</p>\n<p> </p>\n<p>Nel frattempo richiedete l'iscrizione al canale Teams del corso attraverso il seguente <a href=\"https://teams.microsoft.com/l/team/19%3aa6a29db18c834a8fb822d968ea008f10%40thread.tacv2/conversations?groupId=07158cb1-0fc1-4930-befd-80987312c5f0&amp;tenantId=24c5be2a-d764-40c5-9975-82d08ae47d0e\">link</a>.</p>"
    }
  ],
  "lezioni": [
    {
      "id": "0",
      "data": "null",
      "contenuto": "<p>Sul canale Teams. <a href=\"https://teams.microsoft.com/dl/launcher/launcher.html?url=%2F_%23%2Fl%2Fteam%2F19%3Aa6a29db18c834a8fb822d968ea008f10%40thread.tacv2%2Fconversations%3FgroupId%3D07158cb1-0fc1-4930-befd-80987312c5f0%26tenantId%3D24c5be2a-d764-40c5-9975-82d08ae47d0e&amp;type=team&amp;deeplinkId=1dca7869-bdda-4783-9e11-492ef0878055&amp;directDl=true&amp;msLaunch=true&amp;enableMobilePage=true&amp;suppressPrompt=true\">Collegati</a>.</p>"
    }
  ],
  "materiale": [],
  "programma": "<table><tr><td><p> </p>\n<p>Lo scopo del corso è introdurre agli studenti il concetto di problema computazionale e di risoluzione automatica mettendoli in grado di comprendere ed analizzare la struttura di un problema, individuare metodi di risoluzione alternativi, raffrontarli dal punto di vista dell’efficienza, implementarli mediante un opportuno linguaggio di programmazione e valutarne la correttezza.</p>\n<p> </p>\n<p>In particolare verranno trattati i seguenti temi: risoluzione automatica dei problemi; algoritmi e programmi; modelli di calcolo; linguaggi di programmazione; tipi di linguaggi di programmazione; compilazione ed interpretazione; linguaggi imperativi; struttura di un programma; tipi di dati semplici e strutturati; variabili; strutture di controllo; puntatori; funzioni; ricorsione; operazioni di input/output; strutture di dati elementari (array, liste e dizionari).</p>\n<p> </p>\n<p>Durante il corso verranno presentati una quantità di problemi che saranno risolti facendo riferimento ai linguaggi di programmazione <strong>Python</strong> e <strong>C</strong>.</p>\n<p> </p>\n<p>Il corso è composto da due parti che si sovrappongono sia come contenuti che temporalmente. Una  parte fornisce una introduzione generale ai temi sopra elencati. L'altra parte è orientata alla soluzione dei problemi proposti utilizzando linguaggi di programmazione ad alto livello: a tale scopo verrà presentati il linguaggi Python e e C.</p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p>John V. Guttag. Introduzione alla programmazione con Python. EGEA 2021 (in uscita)<br><br/></br></p>\n<p>Un qualsiasi manuale del linguaggio C ad esempio:</p>\n<ul>\n<li>Linguaggio C (seconda edizione) di <em>B.Kernighan e D.Ritchie</em> edito da Pearson Education Italia</li>\n<li>C. Corso completo di programmazione di <em>P.J. Deitel e H.M. Deitel</em> edito da Apogeo</li>\n<li>…</li>\n</ul>\n<h2>Altre risorse</h2>\n<ul>\n<li>Canale <a href=\"https://teams.microsoft.com/l/team/19%3aa6a29db18c834a8fb822d968ea008f10%40thread.tacv2/conversations?groupId=07158cb1-0fc1-4930-befd-80987312c5f0&amp;tenantId=24c5be2a-d764-40c5-9975-82d08ae47d0e\" target=\"_blank\">MS-Teams</a></li>\n<li>Raccolta codice sorgente su <a href=\"https://github.com/glucatv/Programmazione-dei-Calcolatori-aa21-22\" target=\"_blank\">GitHub</a></li>\n</ul></td></tr></table>",
  "ricevimento": "<table><tr><td><p>Per appuntamento sulla piattaforma <a href=\"https://teams.microsoft.com/dl/launcher/launcher.html?url=%2F_%23%2Fl%2Fteam%2F19%3Aa6a29db18c834a8fb822d968ea008f10%40thread.tacv2%2Fconversations%3FgroupId%3D07158cb1-0fc1-4930-befd-80987312c5f0%26tenantId%3D24c5be2a-d764-40c5-9975-82d08ae47d0e&amp;type=team&amp;deeplinkId=1dca7869-bdda-4783-9e11-492ef0878055&amp;directDl=true&amp;msLaunch=true&amp;enableMobilePage=true&amp;suppressPrompt=true\">Teams</a>.</p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>Sono previste 3 sessioni d’esame: Sessione estiva (giugno-luglio); Sessione autunnale (fine agosto-settembre); Sessione invernale (fine gennaio-febbraio). Ogni sessione si compone di 2 appelli che <strong>NON sono mutamente esclusivi</strong> ovvero chi non supera l’esame del primo appello di una sessione può partecipare al secondo appello.</p>\n<p> </p>\n<p> </p>\n<p>L’esame finale si compone di tre parti che si svolgeranno in due giorni distinti. La mattina del primo giorno lo studente dovrà rispondere ad un test contenente 10 domande a risposta multipla. Chi risponderà correttamente ad almeno 6 dei 10 quesiti sarà ammesso alla prova di laboratorio che si terrà lo stesso giorno. In questa seconda prova, da svolgere al calcolatore, allo studente sarà richiesta la soluzione di 2 problemi (uno in Python, l'altro in C). Gli studenti che supereranno questa seconda prova saranno ammessi al colloquio finale che si svolgerà nei giorni successivi.</p>\n<p> </p>\n<p> </p>\n<p>Il test a risposta multipla assegna un punto per ogni risposta esatta, quindi assegna da 6 a 10 punti. Le altre due prove assegnano un punteggio che va da 12 a 22. Il voto finale sarà ottenuto sommando il due punteggi ottenuti nelle tre prove.</p>\n<p> </p>\n<p> </p>\n<p>N.B. <strong>L’esame non può essere suddiviso in più appelli</strong> ovvero non è possibile sostenere la prova di laboratorio o il colloquio orale in un appello d’esame successivo a quello in cui si sono svolte le prove precedenti.</p>\n<p> </p>\n<h3>Trasferimenti da altri Corsi di Studi</h3>\n<p> </p>\n<p>Gli studenti trasferiti da un altro corso di studi ai quali, in fase di trasferimento, sono stati riconosciuti <strong>almeno 6 CFU</strong> del Corso di Programmazione dei Calcolatori con Laboratorio sono esonerati dalla prova di laboratorio. Pertanto devono sostenere soltanto il test a risposta multipla ed il colloquio finale.</p></td></tr></table>"
}