{
  "nomeCorso": "Sistemi operativi e reti",
  "docente": [
    {
      "first_name": "Pietro",
      "second_name": "Frasca"
    }
  ],
  "annoAccademico": "2010-2011",
  "crediti": "12",
  "settore": "",
  "anno": "2",
  "semestre": "1-2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Il corso <i>\"Sistemi operativi e reti\"</i> è l'unione di <i>\"Sistemi operativi con laboratorio\"</i> e di <i>\"Reti di calcolatori\" </i>dei precedenti anni accademici. Le lezioni, relative a <i>\"Sistemi operativi\"</i>, si svolgeranno nel I semestre, mentre le lezioni relative a <i>\"Reti di calcolatori\"</i> si svolgeranno nel II semestre. \r\n\r\n<b>Propedeuticità</b> \r\nNon si può sostenere l'esame di Sistemi operativi e reti senza aver prima sostenuto gli esami di Programmazione dei calcolatori con laboratorio (PR) e Reti logiche ed architettura dei calcolatori (RLAC).\r\n\r\n<b>Programma</b>\n<b><i>      Parte I: Sistemi operativi </i> (I semestre) </b>\n<ul><li>Introduzione ai sistemi operativi. </li><li>Storia e classificazione dei sistemi operativi. </li><li>Richiami di architetture dei sistemi di elaborazione </li><li>Principali modelli strutturali. </li><li>Gestione dei processi.</li> <li>Threads. </li><li>Sincronizzazione dei processi.</li><li>Gestione della memoria. </li><li>Gestione dell' I/O.</li><li>Gestione del file system. </li><li>I sistemi operativi Unix e Linux. </li><li>Casi di studio: Unix e Linux </li></ul>\n<b><i>      Parte II: Reti di calcolatori </i> (II semestre) </b>\n<ul><li>Reti di calcolatori e Internet. </li><li>Strato di applicazione.</li><li>Strato di trasporto. </li><li>Strato di rete e instradamento. </li><li>Strato di collegamento e reti di area locale. </li><li>Reti wireless</li></ul>\n<b>Programma dettagliato relativo a Sistemi Operativi (Diario delle lezioni, I semestre)</b><table border=\"1\" cellpadding=\"4\" class=\"normal\"><tr><th>Lezione</th><th>Data</th><th>Argomento</th></tr><tr><td>1</td><td>19/10/2010</td><td>Introduzione al corso. Principali funzioni di un Sistema operativo. Storia dei sistemi operativi. Sistemi batch. Sistemi batch multiprogrammati</td></tr><tr><td>2</td><td>21/10/2010</td><td>Sistemi a partizione di tempo (time-sharing). Sistemi in tempo reale. Sistemi paralleli e distribuiti. Sistemi operativi per PC. Richiami di architetture dei calcolatori. Il Processore. La memoria. Dispositivi d'ingresso/uscita. Interruzione. Accessi diretti alla memoria (DMA). </td></tr><tr><td>3</td><td>26/10/2010</td><td> Struttura dei sistemi operativi. Principali componenti del sistema operativo. Principali modelli strutturali. Sistemi stratificati. Struttura a microkernel. Struttura client-server. Gestione dei processi. Definizione di processo. Stati di un processo. Transizioni di stato. Descrittore del processo. Code di processi.</td></tr><tr><td>4</td><td>28/10/2010</td><td>Code di processi. Cambio di contesto. Creazione e terminazione dei processi. Esempio di creazione di processo in unix. Interazione tra i processi. Esempio di processi cooperanti: modello produttore-consumatore. Esempio di processi in competizione. Trasferimento tra l'ambiente del kernel e l'ambiente dei processi. Scheduling. Scheduling a breve termine. Scheduling a lungo termine. Scheduling a medio termine. Comportamento dei processi: cpu burst e i/o burst. </td></tr><tr><td>5</td><td>4/11/2010</td><td>Parametri di scheduling. Principali algoritmi di scheduling. FCFS. SJF. Round robin. Algoritmi di scheduling basati sulle priorità. Algoritmi di scheduling a code multiple.</td></tr><tr><td>6</td><td>9/11/2010</td><td>Algoritmi di scheduling real-time. Thread. Thread a livello utente e a livello kernel. Sincronizzazione tra processi. Cooperazione e competizione. Modello ad ambiente globale. Modello ad ambiente locale. Problema della mutua esclusione. Soluzioni al problema della mutua esclusione.</td></tr><td>7</td><td>11/11/2010</td><td>Problema della comunicazione. Semafori. Soluzione al problema della mutua esclusione con semafori. Soluzione al problema della comunicazione con semafori: produttore-consumatore con buffer di capacità 1 e buffer di capacità N. Send e receive. Soluzione al problema della comunicazione tra processi. Comunicazione diretta e indiretta. Sincronizzazione tra processi comunicanti.</td></table></td></tr><tr><td>8</td><td>16/11/2010</td><td>Blocco critico (stallo). Condizioni per il blocco critico. Prevenzione statica e dinamica. L'algoritmo del banchiere. Individuazione e ripristino del blocco critico.</td></tr><tr><td>9</td><td>18/11/2010</td><td>Gestione della memoria. La memoria virtuale. Rilocazione statica e dinamica. MMU. Organizzazione della memoria virtuale. Allocazione della memoria fisica. Tecniche di gestione della memoria. Memoria partizionata. Partizioni fisse e variabili. Partizioni multiple.</td></tr> <tr><td>10</td><td>23/11/2010</td><td>Memoria segmentata. Segmentazione a domanda. Memoria paginata.</td></tr><td>11</td><td>25/11/2010</td><td>Memoria paginata. Paginazione a domanda. Gestione del page-fault. Rimpiazzamento delle pagine.</td></table>",
  "testiRiferimento": "<table><tr><td><b>Testi di riferimento</b> \r\nSistemi operativi, II ed. - P. Ancilotti, M. Boari, A. Ciampolini, G. Lipari - McGraw-Hill \r\nReti di Calcolatori e Internet, IV ed. - Un approccio top-down - J.F. Kurose, K.W. Ross - Pearson - Addison Wesley. \r\n\r\n<b>Libri consigliati per approfondimenti</b>\r\nSistemi Operativi, VII ed., A. Silberschatz, P. Galvin, G. Gagne. Pearson. \r\nI moderni Sistemi Operativi, III ed., A. S. Tanenbaum. Pearson - Prentice Hall.\r\nSistemi operativi, D. M. Dhamdhere, McGraw-Hill.\r\nReti di Calcolatori e Internet, B. A. Forouzan, McGraw-Hill.</td></tr></table>",
  "ricevimento": "<table><tr><td>Stanza docente (0103) - Martedì ore 13.30 - 14.30.\r\nPer appuntamento via email. \r\n</td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>Gli studenti iscritti al nuovo ordinamento devono sostenere l'esame \"Sistemi operativi e reti\" di 12 crediti. Gli studenti iscritti al vecchio ordinamento devono sostenere separatamente gli esami \"Sistemi operativi\" di 6 crediti e \"Reti di calcolatori\" di 6 crediti. Gli studenti del nuovo ordinamento possono sostenere, nell'appello invernale, l'esame parziale (esonero) di \"Sistemi operativi e reti\" che consiste in una prova scritta e una prova orale basata sugli argomenti della prima parte del corso (Sistemi operativi). Lo studente che intende sostenere l'esame parziale deve prenotarsi inviando una e-mail all'indirizzo del docente: frasca@mat.uniroma2.it, indicando come oggetto la frase \"esame parziale SOR\" e indicando nel messaggio il proprio cognome, nome e numero di matricola. Lo studente che supera l'esame parziale deve sostenere la restante parte di SOR entro l'anno accademico 2010-2011. L'esame consiste in una prova scritta e in una prova orale. Il testo della prova scritta è suddiviso in due parti. La prima parte è composta da un gruppo di 4-5 domande che riguardano argomenti di \"Sistemi operativi\". La seconda parte, è composta da un gruppo di 4-5 domande, relative ad argomenti di \"Reti di calcolatori\". Le domande sono del tipo a risposta aperta o sottoforma di problemi. Per la parte Sistemi operativi una delle domande consiste nello sviluppo di un breve programma in linguaggio C basato sulle system call POSIX studiate durante il corso. La durata dell'esame di 12 crediti è di 3 ore, mentre la durata dell'esame di 6 crediti è di 1 ora e 30 minuti. Durante lo svolgimento della prova scritta è vietato l'uso di libri e/o appunti di qualsiasi genere. Per sostenere la prova orale è necessario aver superato la prova scritta con una votazione di almeno 18/30. Inoltre, lo studente può svolgere una tesina facoltativa consistente nella realizzazione di un'applicazione in java basata sulla programmazione dei socket o di un'applicazione multi-thread scritta in c . La tesina deve essere consegnata (personalmente o via e-mail) almeno una settimana prima della data della prova orale. La realizzazione della tesina consente di migliorare la votazione di 1,2 o 3 punti. Per sostenere l'esame è obbligatorio prenotarsi mediante il servizio \"Servizi on Line\" all'indirizzo http://delphi.uniroma2.it Una raccolta di testi di esame relativi agli a.a. passati e vari esempi di programmi sulle system call POSIX e sulla programmazione dei socket sono disponibili nell'area \"materiale didattico\".</p></td></tr></table>"
}