{
  "nomeCorso": "Machine learning",
  "docente": [
    {
      "first_name": "Giorgio",
      "second_name": "Gambosi"
    }
  ],
  "annoAccademico": "2014-2015",
  "crediti": "9",
  "settore": "INF/01",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "Pagina corso",
      "data": "04-03-2015 17:08",
      "contenuto": "<p>Per materiali e informazioni sul corso, si faccia riferimento a <a href=\"https://sites.google.com/site/corsoml2014/\" target=\"_blank\" title=\"questo indirizzo\">questo indirizzo</a></p>"
    }
  ],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><p> </p>\n<p class=\"p1\">Pattern recognition e machine learning. Schema generale di un sistema di ML. Inferenza. Apprendimento supervisionato e non supervisionato. Regressione lineare. Funzioni base e regressione. Overfitting e funzioni di penalizzazione. Model selection. Introduzione alla teoria delle decisioni. Classificazione: approcci (funzioni di discriminazione, modelli probabilistici discriminativi, modelli probabilistici generativi). Riduzione di dimensionalità e feature selection. Il modello connessionistico. Reti neurali a più strati. Apprendimento di reti neurali. Optimal margin classifiers e support vector machines. Funzioni kernel. Metodi non parametrici per la stima di probabilità: applicazione alla classificazione. Apprendimento non supervisionato. Clustering. Algoritmo k-means. Modelli di mistura di distribuzioni. Modelli a variabili latenti e algoritmo EM. Applicazione a modellazione di testo. Modelli di Markov nascosti (HMM). Ensemble learning. Utilizzo di strumenti e linguaggi (R, Python) per l'analisi e l'apprendimento da dataset reali.</p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p> </p>\n<p class=\"p1\">C. M. Bishop \"Pattern recognition and machine learning\", Springer</p>\n<p class=\"p1\">Ulteriore materiale sarà messo a disposizione durante il corso</p></td></tr></table>",
  "ricevimento": "<table><tr><td><p><span style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: justify;\">Al termine delle lezioni. E' possibile inoltre richiedere un appuntamento via mail.</span></p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p><span style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: justify;\">Colloquio orale. E' previsto un progetto di applicazione di metodi di ML ad uno specifico problema e la redazione della relativa relazione. Per l'iscrizione all'esame è richiesta la prenotazione sul sito delphi.uniroma2.it</span></p></td></tr></table>"
}