{
  "nomeCorso": "Intelligenza artificiale",
  "docente": [
    {
      "first_name": "Stefano",
      "second_name": "De Luca"
    }
  ],
  "annoAccademico": "2007-2008",
  "crediti": "6",
  "settore": "",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><ul>\n<li> Introduzione all'I.A.: definizione di intelligenza, adattività, agente.\r\n    <li> Tecniche di ricerca: ricerca su grafi, A*. Giochi: minimax, alfa-beta pruning.\r\n    <li> Rappresentazione della conoscenza: introduzione alla logica matematica, sistemi a frame, reti di conoscenza, RDF e OWL.\r\n    <li> Dimostrazione automatica di teoremi: completezza e decidibilità programmazione logica, risoluzione SLD, inferenze non monotoniche e logiche modali, introduzione al linguaggio Prolog. Situation calculus.\r\n    <li> Introduzione ai sistemi esperti: forward e backward reasoning, l'algoritmo Rete, i motori a regole.\r\n    <li> Problematiche di pianificazione.\r\n    <li> Introduzione ai sistemi subsimbolici: algoritmi genetici, reti neuronali artificiali, a-life.\r\n    <li> Usi industriali dell'I.A.\r\n</li></li></li></li></li></li></li></li></ul>\r\n\r\n\r\nIl corso utilizzerà il più possibile esempi presi dall'area del <b>semantic web</b> e, per la parte simbolica, con esempi pratici in linguaggio <b>Prolog</b> (che verrà spiegato al corso).\r\n\r\n\r\n\r\n<b>Obiettivi:</b> Avere una visione di insieme dell'intelligenza artificiale, conoscerne le problematiche e le aree principali, saper usare gli strumenti della logica matematica per rappresentare la conoscenza e derivarne inferenze, avere una competenza pratica basilare del linguaggio di programmazione Prolog e di un sistema a regole, nonché una introduzione alle reti neuronali e agli algoritmi genetici.\r\n\r\nComplessivamente lo studente sarà in grado di progettare e implementare semplici componenti intelligenti di un agente.\r\n\r\n<b>Esame:</b> L'esame avrà una parte scritta ed una orale facoltativa, con cui lo studente potrà migliorare la prestazione scritta.\r\n\r\nVi sarà un esonero intermedio che consentirà di qualificarsi per la prima parte dello scritto. Lo scritto finale sarà comunque completo, per gli studenti che non avranno fatto (o desiderano ripetere) l'esonero - chi avrà fatto l'esonero non risponderà alla prima parte delle domande.\r\n\r\nI temi dell'esame sono quelli indicati nel programma e riportati in modo più analitico nella storia del corso (sotto indicata).\r\n\r\nIn modo facoltativo, sarà possibile produrre una tesina scritta su un argomento concordato con il professore, che consentirà di aumentare il voto fino a 2 punti. Ad es. sulle logiche temporali, sulla tipologia delle reti neurali, sull'uso del modello biologico in AI etc.\r\n\r\nIn modo facoltativo, sarà possibile produrre un'esercitazione su un tema concordato con il professore, che consentirà di aumentare il voto fino a 3 punti. Ad es. apprendimento di un set di dati usando una rete neurale, applicazione di algoritmi genetici per risolvere un problema, creazione di un agente nel mondo del wumpus tramite il situation calculus.\r\n\r\nLo studio degli articoli discussi in aula sarà considerato positivamente nella valutazione. \r\n\r\n<table border=\"1\" class=\"tabel1\"><tr><th>N.</th><th>Lezione</th><th>Argomento</th><th>Materiale</th></tr><tr><td>1</td><td>8/10</td><td>Presentazione del corso; introduzione all'AI, sue applicazioni </td><td>R&amp;N, cap. 1, §1.1, §1.3, §1.4; slides 01</td></tr>\n<tr><td>2</td><td>12/10</td><td>Agenti intelligenti: interrelazione con l'ambiente, anatomia apprendimento</td><td>R&amp;N, cap. 2 da §2.1 a §2.4; slides 02</td></tr><tr><td>3</td><td>16/10</td><td>Problem solving: formulazione dei problemi e degli obiettivi, soluzione di problemi tramite ricerca. Ricerche Depth First e Breadth First.</td><td>R&amp;N, cap. 3, da §3.1 a §3.5; slides 03.</td></tr><tr><td>4</td><td>19/10</td><td>Introduzione al Prolog: fatti, regole, unificazione. Discussione in aula dell'articolo di Berners-Lee sul Semantic web. </td><td>Slides 04 sul Prolog.  Esempi di Prolog. Letture 01 </td></tr><tr><td>5</td><td>19/10</td><td>Introduzione al Prolog: liste ed alberi, ricerche su alberi. </td><td>Slides 05 sul Prolog.  Esempi di Prolog. </td></tr><tr><td>6</td><td>23/10</td><td>Ricerca con informazioni: gready search, A*, sistemi di ricerca locale</td><td>R&amp;N, cap. 4, da §4.1 a §4.3; slides 04.</td></tr><tr><td>7</td><td>30/10</td><td>Ricerca con informazioni: gready search, A*, sistemi di ricerca locale</td><td>R&amp;N, cap. 4, da §4.1 a §4.3; slides 04.</td></tr><tr><td>8</td><td>6/11</td><td>\tGiocare i giochi: minimax, alpha-beta pruning, giochi con informazioni imperfette, cut-off. </td><td>R&amp;N, cap. 6, da §6.1. a §6.6; slides 06..</td></tr><tr><td>9</td><td>9/11</td><td>Gli agenti basati su logica. Le basi di conoscenza. Il mondo del Wumpus. I modelli.</td><td>R&amp;N, cap. 7, da §7.1 a §7.4; slides 07</td></tr><tr><td>10</td><td>13/11</td><td>Il calcolo proposizionale, fondamenti</td><td>slides 08</td></tr><tr><td>11</td><td>16/11</td><td>Il calcolo proposizionale, derivazioni. I tableaux</td><td>slides 09, slides 10, cfr. URL <a href=\"http://www.umsu.de/logik/trees/\">http://www.umsu.de/logik/trees/</a>, dove è possibile calcolare automaticamente i tableaux a partire da una formula</td></tr><tr><td>12</td><td>20/11</td><td>Il calcolo dei predicati, logica del primordine (FOL - First Order Logic)</td><td>slides 11</td></tr><tr><td>13</td><td>23/11</td><td>Logica, inferenze sul calcolo dei predicati: instanzazione dei          quantificatori universale ed esistenziale, riduzione al calcolo proposizionale, unificazione, modus ponens generalizzato, forward e backward chaining</td><td>R&amp;N, cap. 9, da §9.1 a §9.4 (meno il logic programming, che     sarà trattato in altra lezione); slides 12.</td></tr><tr><td>14</td><td>27/11</td><td>modus ponens generalizzato, forward e backward chaining</td><td>come la precedente lezione</td></tr><tr><td>15</td><td>30/11</td><td>Rappresentazione della conoscenza: tassonomie, ontologie, situation calculus</td><td>R&amp;N, cap. 10, da §10.1 a §10.2, §10.3 solo il situation calculus, §10.6, §10.8; slides 13</td></tr><tr><td>16</td><td>4/12</td><td>\tSituation calculus</td> <td>R&amp;N, cap. 10, da §10.1 a §10.2, §10.3 solo il situation calculus, §10.6, §10.8; slides 13</td></tr> <tr><td>17</td><td>7/12</td><td>Esercitazione e approfondimenti sugli algoritmi di ricerca</td><td> </td></tr><tr><td>18</td><td>11/12</td><td>Esercitazione e approfondimenti sulla logica</td><td> </td></tr> <tr><td>19</td><td>14/12</td> <td>Esonero</td><td> </td></tr><tr><td>20</td><td>18/12</td><td>Machine learning: introduzione alle diverse tipologie di apprendimento automatico. Reti neuronali: introduzione, reti feed forward, apprendimento backpropagation. Presentazione dello strumento Joone</td><td>R&amp;N cap 20 (seconda parte). Slides 15 e 15a. Per Joone, URL: <a href=\"http://www.jooneworld.com/\">http://www.jooneworld.com/</a></td></tr>\n<tr><td>21</td><td>8/1</td><td>\tL'approccio probabilistico. Le\r\nreti di Bayes e gli automi probabilistici</td><td>Slides 16 e 16a; R&amp;N cap. 14</td></tr><tr><td>21</td><td>8/1</td><td>\tL'approccio probabilistico. Le\r\nreti di Bayes e gli automi probabilistici</td><td>Slides 16 e 16a; R&amp;N cap. 14</td></tr><tr><td>22</td><td>11/1</td><td>Le catene di Markov. I modelli di Markov nascosti</td><td>Slides 17. R&amp;N da cap. 15.1 a 15.3</td></tr><tr><td>24</td><td>15/1</td><td>Introduzione agli algoritmi genetici. Ottimizzazione di modelli.</td><td>slides 18a e 18b</td></tr><tr><td>25</td><td>18/1</td><td>Argomenti di ricerca nell'intelligenza artificiale. Tesi disponibili.</td><td>Slides 19</td></tr><tr><td>26</td><td>25/1</td><td>Esercitazione</td><td> </td></tr></table>\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>Russell, Norvig: <b>Artificial Intelligence: A Modern Approach</b> (2nd edition), Prentice Hall\r\n\r\nNe esiste una traduzione italiana in due volumi edita da Pearson Education Italia. La materia del corso è coperta quasi integralmente dal primo volume.\r\n\r\nIl testo di R&amp;N è molto ampio, non tutti i capitoli saranno coperti; Nella storia del corso (vedi sopra) saranno di volta in volta indicati i capitoli e i §paragrafi da studiare. \r\n\r\nPer il Prolog, si potrà fare riferimento al testo classico di Ivan Bratko, <b>Prolog programming for artificial intelligence</b>. Esiste in rete anche un buon testo in italiano: <b><a href=\"http://www.dimi.uniud.it/dovier/DID/lnc.pdf\">Programmazione Dichiarativa con Prolog, CLP, CCP, e ASP</a></b>, di Dovier e Formisano.\r\n\r\nPer le esercitazioni Prolog si userà lo SWI Prolog, URL: <a href=\"http://www.swi-prolog.org\">www.swi-prolog.org</a>; suggerisco di scaricare ed installare anche un editor, lo SWI Prolog Editor (dallo stesso sito). \r\n\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Dopo le lezioni o su appuntamento. In ogni caso, inviare una mail a <a href=\"mailto:deluca@mat.uniroma2.it\">deluca@mat.uniroma2.it</a> e/o <a href=\"mailto:s.deluca@ieee.org\">s.deluca@ieee.org</a>.</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}