{
  "nomeCorso": "Reti di calcolatori",
  "docente": [
    {
      "first_name": "Pietro",
      "second_name": "Frasca"
    }
  ],
  "annoAccademico": "2006-2007",
  "crediti": "6",
  "settore": "",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><b>Programma</b>\r\n1. Reti di calcolatori e Internet.\r\n2. Strato di applicazione\r\n3. Strato di trasporto\r\n4. Strato di rete e instradamento\r\n5. Strato di collegamento e reti di area locale\r\n\r\n<b>Programma dettagliato </b>\n<i>(Riferito al libro di testo adottato)</i>\n<b>1. RETI DI CALCOLATORI E INTERNET </b>\n<b>1. Introduzione alle reti</b>. Descrizione di Internet.\r\n<b>2. La sezione di accesso alla rete.</b> Terminali, client e server. Servizio senza connessione e servizio orientato alla connessione\r\n<b>3. La sezione interna della rete</b>. Commutazione di circuito e commutazione di pacchetto. <i>Commutazione di circuito. Multiplazione (multiplexing) nelle reti a commutazione di circuito. Commutazione di pacchetto. Confronto tra commutazione di pacchetto e commutazione di circuito. Frammentazione del messaggio.</i> Inoltro dei pacchetti nelle reti di calcolatori. <i>Reti a circuito virtuale. Reti datagram.</i>\n<b>4. Accesso alla rete e mezzi trasmissivi.</b> Accesso alla rete.<i> Accesso domestico (DSL, HFC). Accesso aziendale. Accesso mobile.</i> Mezzi fisici.<i> Doppino in rame. Cavi coassiali. Fibre ottiche. Canali radio terrestri. Canali radio satellitari.</i>\n<b>5. Gli ISP e la rete dorsale di Internet.</b>\n<b>6. Ritardi e perdite nelle reti a commutazione di pacchetto.</b> Tipi di ritardo. <i>Ritardo di elaborazione. Ritardo di coda. Ritardo di trasmissione. Ritardo di propagazione. Confronto tra ritardo di trasmissione e ritardo di propagazione.</i>  Ritardo di coda e perdita dei pacchetti. <i> Perdita di un pacchetto. Ritardo da terminale a terminale. </i> Ritardo e router in Internet.\r\n<b>7. Strati protocollari (pile) e loro modelli di servizio.</b> Architettura stratificata. <i>Stratificazione dei protocolli. Funzione degli strati.</i> La pila protocollare di Internet. <i>Strato di applicazione. Strato di trasporto. Strato di rete. Strato di collegamento. Strato fisico. </i>\n<b>2. STRATO DI APPLICAZIONE </b>\n<b>1. Principi dei protocolli dello strato di applicazione.</b> Protocolli dello strato di applicazione. <i> Lati client e server di un'applicazione. Processi di comunicazione attraverso la rete. Indirizzamento dei processi. Agenti dell'utente.</i>  Servizi necessari a un'applicazione. <i> Trasferimento affidabile dei dati. Larghezza di banda. Timing.</i>  Servizi forniti dai protocolli di trasporto Internet. <i> Servizi TCP. Servizi UDP.</i>  Applicazioni di rete.\r\n<b>2. Web e http.</b> HTTP. Connessione non persistente e persistente. Formato del messaggio HTTP. <i>Messaggio di richiesta HTTP.</i> <i>Messaggio di risposta HTTP.</i> Interazione user-server: autorizzazione e cookie. GET condizionato. Contenuti di HTTP.\r\n<b>3. Trasferimento di file: FTP.</b> Comandi e riposte in FTP. \r\n<b>4. Posta elettronica in Internet.</b> SMTP.  Formati dei messaggi di posta e MIME. <i> L'estensione MIME per dati non-ASCII. Il messaggio ricevuto. </i> Protocolli di accesso alla posta. <i> POP3. IMAP. Posta elettronica basata sul Web. </i>\n<b>5.  DNS.</b>  Servizi forniti dal DNS.  Funzionamento del DNS. Record DNS. Messaggi DNS. \r\n<b>6. Programmazione dei socket con TCP</b>. Esempi di applicazioni client/server TCP in Java.\r\n<b>7. Programmazione dei socket con UDP</b>. Esempi di applicazioni client/server UDP in Java.\r\n<b>8. Esempio di programmazione con i socket di un semplice server web</b>\n<b>9. Distribuzione di contenuti </b>. Server Proxy. Reti per la distribuzione di contenuti (CDN). Condivisione di file da pari a pari.\r\n\r\n<b>3. STRATO DI TRASPORTO </b>\n<b>1. Servizi dello strato di trasporto</b>.\r\n<b>2. Multiplexing e demultiplexing</b>.\r\n<b>3. Trasporto senza connessione: UDP</b>. Struttura del segmento UDP. Checksum di UDP. \r\n<b>5. Trasporto orientato alla connessione: TCP</b>. La connessione TCP. Struttura el segmento TCP. Stima del tempo di round trip e timeout. Trasferimento affidabile dei dati. Controllo di flusso. Gestione della connessione TCP.\r\n<b>7. Controllo della congestione del TCP.</b> Fairness.\r\n\r\n<b>STRATO DI RETE E INSTRADAMENTO.</b>\n<b>1. Introduzione e modelli di servizio della rete</b>. \r\n<b>2. Principi di instradamento. </b> Algoritmo di instradamento basato sullo stato del link. Algoritmo di instradamento Distance Vector. \r\n<b>3. Instradamento gerarchico.</b>\n<b>4. Protocollo IP.</b> Indirizzamento IPv4. Trasporto di datagram dalla sorgente alla destinazione: indirizzamento, instradamento e rilancio. Formato del datagram. Frammentazione del datagram IP. Traduzione degli indirizzi di rete (NAT). ICMP. Protocollo di configurazione dinamica degli host (DHCP). \r\n<b>5. Instradamento in Internet. </b>Instradamento intra-sistema autonomo. RIP. OSPF. Instradamento inter-sistemi autonomi:BGP.\r\n<b>7. IPv6. </b>Formato del datagram IPv6. ICMP per IPv6. Transizione da IPv4 a IPv6.\r\n<b>8. Instradamento multicast. </b> multicast e gruppi multicast. Il protocollo IGMP. Protocolli PIM, MOSPF e DVMRP (solo generalità).\r\n\r\n<b>STRATO DI COLLEGAMENTO E RETI LAN</b>\n<b>1. Lo strato di collegamento: introduzione</b> I servizi forniti dallo strato di collegamento. Adattatori per la comunicazione.\r\n<b>2. Tecniche di rilevazione e correzione degli errori</b>. Controllo di parità. Metodi di checksum. Controllo a ridondanza ciclica (CRC).\r\n <b>3. Protocolli di accesso multiplo. </b> Protocolli di suddivisione di canali (escluso accesso multiplo a divisione di codice). Protocolli di accesso casuale (escluso ALOHA). Protocolli a turno. LAN.\r\n<b>4. Indirizzi LAN e ARP</b>. Indirizzi LAN. Protocollo per la risoluzione dell'indirizzo (ARP).\r\n<b>5. Ethernet </b>. Le basi di Ethernet. CSMA/CD. Tecnologie Ethernet.\r\n<b>6. Hub, bridge e commutatori</b>. Gli hub. I Bridge. Commutatori.    \r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td><b>Testo di riferimento</b>\r\nReti di Calcolatori e Internet - Un approccio top-down (3a edizione) - J.F. Kurose, K.W. Ross - Pearson - Addison Wesley. \r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Stanza docente (0103) - Venerdì 15.00 - 16.00</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}