{
  "nomeCorso": "Algoritmi e strutture dati",
  "docente": [
    {
      "first_name": "Andrea",
      "second_name": "Clementi"
    },
    {
      "first_name": "Luciano",
      "second_name": "Guala"
    }
  ],
  "annoAccademico": "2021-2022",
  "crediti": "12",
  "settore": "INF/01",
  "anno": "2",
  "semestre": "1-2",
  "propedeuticità": "Analisi Matematica. Matematica discreta. Programmazione dei calcolatori con laboratorio.",
  "comunicazioni": [
    {
      "titolo": "Settimana 11-15 ottobre: ancora aula magna!",
      "data": "10-10-2021 21:24",
      "contenuto": "<p>Cari, le lezioni di lunedì 11 e giovedì 14 ottobre si svolgeranno in aula magna (Gismondi). Faranno fede anche le prenotazioni relative all'aula 3PP2. Ci vediamo in classe. </p><hr/>"
    },
    {
      "titolo": "Si parte!",
      "data": "01-10-2021 13:23",
      "contenuto": "<p>Cari studenti, benvenuti al corso di Algoritmi e Strutture Dati! Sarà un corso impegnativo. Abbiamo molte cose da fare insieme e spero che troverete alcune di queste divertenti, oltre che utili. </p>\n<p>Sarà per me particolarmente piacevole vedervi di persona, quest'anno, e spero che parteciperete per quanto più possibile alle lezioni in presenza. Ad ogni modo, le lezioni saranno erogate in modalità mista, per consentire anche a chi non riesce a venire in aula di seguire in remoto. Non sempre le aule sono attrezzate adeguatamente e la modalità mista è da un punto di vista tecnico più complicata. Faremo del nostro meglio.</p>\n<p> </p>\n<p>La prima lezione si svolgerà lunedì 4 ottobre alle ore 11, in aula magna (aula Gismondi). Ricordatevi di prenotare un posto tramite il sistema delphi. </p>\n<p>La modalità remota sarà erogata attraverso una classe virtuale su Teams. Peraltro vi invito a richiedere la partecipazione alla seguente classe:</p>\n<p>GUALA'-8067331-ALGORITMI_E_STRUTTURE_DATI</p>\n<p>Chi riscontrasse problemi tecnici può scrivermi all'indirizzo </p>\n<p>guala@mat.uniroma2.it</p>\n<p> </p>\n<p>Mi sembra sia tutto. Ci vediamo lunedì!</p>\n<p>LG </p>"
    }
  ],
  "lezioni": [
    {
      "id": "2",
      "data": "07-10-2021",
      "contenuto": "<p>Il problema del calcolo dell’n-esimo numero di Fibonacci. Un algoritmo numerico e un algoritmo ricorsivo. Analisi della complessità temporale dell’algoritmo ricorsivo. Un algoritmo iterativo di complessità temporale O(n) e di complessità spaziale O(n) (Fibonacci3). Portare la memoria a O(1): Fibonacci4. Introduzione informale alla notazione asintotica. Algoritmo con complessità O(log n) per il calcolo dell’n-simo numero di Fibonacci. Discussione della complessità spaziale degli algoritmi ricorsivi Fibonacci2 e Fibonacci6.</p>"
    },
    {
      "id": "1",
      "data": "04-10-2021",
      "contenuto": "<p>Introduzione al corso. Motivazioni e concetti fondamentali. Un primo esempio: il problema di trovare una moneta falsa (più pesante) fra n monete usando una bilancia a due piatti.</p>"
    }
  ],
  "materiale": [],
  "programma": "<table><tr><td><p>http://www.mat.uniroma2.it/~guala/ASDL_2021.htm</p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p>http://www.mat.uniroma2.it/~guala/ASDL_2021.htm</p></td></tr></table>",
  "ricevimento": "<table><tr><td><p>http://www.mat.uniroma2.it/~guala/ASDL_2021.htm</p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>http://www.mat.uniroma2.it/~guala/ASDL_2021.htm</p></td></tr></table>"
}