{
  "nomeCorso": "Sistemi di agenti",
  "docente": [
    {
      "first_name": "Stefano",
      "second_name": "De Luca"
    }
  ],
  "annoAccademico": "2007-2008",
  "crediti": "6",
  "settore": "",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>L'approccio del corso sarà quello di mostrare casi reali di agenti per studiarne le basi teoriche e pratiche.\r\n\r\nIn particolare, si prenderà come esempio su cui si baserà il corso un sistema di simulazione di attività sociali, come i comportamenti di un gruppo di persone (simulate da agenti) in un contesto pubblico (ad es. un parco).\r\n\r\nI temi trattati saranno i seguenti.\r\n\r\n<ul>\n<li>Definizione di un agente</li>\n<li>Classificazione degli agenti</li>\n<li>Interazioni tra agenti (MAS: Multi-Agent Systems)</li>\n<li>Meccanismi di comunicazione tra agenti (KQML, KIF, FIPA ACL)</li>\n<li>Piattaforme per lo sviluppo di agenti: Repast, JADE</li>\n<li>Sviluppare un sistema di agenti con Repast</li>\n<li>Ingegneria del software: metodologie per gli agenti, GAIA, estensioni di UML (AUML)</li>\n<li>Uso di tecniche di intelligenza artificiale negli agenti</li>\n<li>Case histories di applicazioni reali</li>\n</ul>\r\n\r\n\r\nAlcune lezioni avranno lo scopo di mostrare la teoria illustrata direttamente dalla pratica (tramite esercitaizione).\r\n\r\n\r\n<b>Obiettivi:</b> Avere una visione di insieme dell'intelligenza artificiale distribuita ed in particolare dei Sistemi di Agenti, conoscerne le problematiche e le aree principali.\r\n\r\nConoscere le metodologie di comunicazione tra agenti e i modi di raggiungere un accordo. Avere una introduzione ai sistemi di a-life, basati su approccio darwinistico.\r\n\r\nAvere una competenza pratica basilare del sistema di agenti Repast e/o Jade.\r\n\r\nComplessivamente lo studente sarà in grado di progettare e implementare semplici sistemi di agenti. </td></tr></table>",
  "testiRiferimento": "<table><tr><td>Si possono usare le slides del corso più gli articoli.\r\n\r\nSono comunque consigliati:\r\n<ul>\n<li>G.Weiss (ed.), Multiagent Systems: A modern Approach to Distributed Artificial Intelligence, MIT Press </li>\n<li>M.Wooldridge, An introduction to multiagent systems, John Wiley ed. </li></ul>\r\n \r\nPer chi non frequenta, lo studio del testo di Wooldridge è mandatorio.\r\n \r\n<b>Materiale del corso. </b>\r\n\r\nDurante il corso verranno suggeriti degli articoli, che verranno inseriti quando possibile su questa pagina web; per gli altri articoli chiedere durante le lezioni, al ricevimento o via email. \r\n \r\n<b>Siti utili</b>\n<ul>\n<li><a href=\"http://www.fipa.org/\">http://www.fipa.org/</a>,    standard di programmazione e comunicazione per agenti \r\n<li><a href=\"http://www.agentlink.org/\">http://www.agentlink.org/</a>, consorzio europeo sui sistemi di agenti </li><li><a href=\"http://jade.tilab.com/\">http://jade.tilab.com/</a>, piattaforma di sviluppo in Java per agenti compliant FIPA</li><li>Sistema di agenti per simulazioni, REPAST: <a href=\"http://repast.sourceforge.net/\">http://repast.sourceforge.net/</a>\n<li><a href=\"http://www.swi-prolog.org/\">http://www.swi-prolog.org/</a>, \r\n interprete open source del linguaggio Prolog\r\n<li><a href=\"http://citeseer.ist.psu.edu/\">http://citeseer.ist.psu.edu/</a>, sito per ricercare articoli scientifici e citazioni \r\n<li><a href=\"http://www.ida.liu.se/~ulfni/lpp/\">http://www.ida.liu.se/~ulfni/lpp/</a>, un testo free sul Prolog: \"Logic, Programming and Prolog\"\r\n<li><a href=\"http://www.acm.org/\">ACM, Association for Computer Machinery</a>, vi  è  la possibilità per gli iscritti di accedere a libri, articoli (comprese tutte le conferenze) e corsi on-line\r\n<li><a href=\"http://www.computer.org/\">IEEE Computer Society</a>, con gli stessi vantaggi della ACM.\r\n<li><a href=\"http://cs.gmu.edu/~eclab/projects/ecj/\">ECJ</a>, una libreria Java amplissima per Evolutionary Computing (EC): GA, GP, ES etc. Sviluppata  all'interno dell'<a href=\"http://cs.gmu.edu/~eclab/index.html\">ECLab</a>. </li><li><a href=\"ftp://ftp.corel.com/pub/WordPerfect/wpwin/9/wpfonts.exe\">Fonti matematiche WP</a></li><li><a href=\"http://sra.itc.it/people/serafini/teaching/dottorato-dit/2005-base.html\">Presentazioni sulla logica per la rappresentazione della conoscenza</a>, tra cui le slide sul  <a href=\"http://sra.itc.it/people/serafini/teaching/dottorato-dit/2005/situation-calculus.pdf\">situation calculus</a></li>\n</li></li></li></li></li></li></li></ul>\n<hr/>\n<b>Articoli</b>\n<ol>\n<li><a href=\"http://citeseer.csail.mit.edu/nwana96software.html\">Nwana, \"Software Agents: an Overview\"</a> (pt. 4)</li>\n<li><a href=\"http://www.agentlink.org/roadmap/index.html\">Agent Technology: Computing as Interaction. A Roadmap for Agent-Based Computing</a></li>\n<li>Pekalski, <a href=\"http://doi.ieeecomputersociety.org/10.1109/MCISE.2004.1255822\">A Short Guide to Predator-Prey Lattice Models</a> (pt. 3)</li>\n<li>Zambonelli, Jennings, Wooldridge, <a href=\"http://portal.acm.org/citation.cfm?id=958963&amp;coll=Portal&amp;dl=ACM&amp;CFID=71448407&amp;CFTOKEN=56413876\">Developing Multiagent Systems: The Gaia Methodology</a> (pt. 6)</li>\n<li>Binmore, <a href=\"http://jasss.soc.surrey.ac.uk/1/1/review1.html\">The Complexity of Cooperation: Agent-Based Models of Competition and Collaboration</a>, recensione di un testo di Axelroad (pt. 3)</li>\n<li>You Seok Son and Ross Baldick, <a href=\"http://ieeexplore.ieee.org/xpls/abs_all.jsp?isnumber=29322&amp;arnumber=1324693&amp;count=8&amp;index=0\">Hybrid Coevolutionary Programming for Nash Equilibrium Search in Games With Local Optima</a> (pt. 6)</li>\n<li>Li Calzi, <a href=\"http://venus.unive.it/licalzi/NashEponimo.pdf\"> Un eponimo ricorrente: Nash e la teoria dei giochi</a> (pt. 4)</li>\n<li>Fatima, S., Wooldridge, M. and Jennings, N. R., <a href=\"http://eprints.ecs.soton.ac.uk/11146/\">A comparative study of game theoretic and evolutionary models for software agents</a> (pt. 5)</li>\n<li>Hans Czap, Marc Beckerl, <a href=\"http://doi.ieeecomputersociety.org/10.1109/HICSS.2003.1174204\">Multi-Agent Systems and Microeconomic Theory: A Negotiation Approach to solve Scheduling Problems in High Dynamic Environments</a> Uso della Nash bargaining solution e microeconomia  per lo scheduling (con un esempio per un ospedale) (pt. 5)</li>\n<li>Danny Weyns et al., <a href=\"http://www.cs.kuleuven.ac.be/~danny/e4mas_survey_2004.pdf\">Environments for Multiagent Systems, State-of-the-art and Research Challenges</a> (pt. 8)</li>\n<li>Hendler, <a href=\"http://doi.ieeecomputersociety.org/10.1109/5254.920597\">Agents and the Semantic Web</a> (pt. 2)</li>\n<li>Klein, <a href=\"http://doi.ieeecomputersociety.org/10.1109/5254.920596\">XML, RDF, and Relatives</a> (pt. 2)</li>\n<li>Rao, Georgeff, <a href=\"http://citeseer.ist.psu.edu/rao95bdi.html\">BDI Agents: From Theory to Practice</a> Una delle migliori  descrizioni brevi degli agenti deliberativi (pt. 5)</li>\n<li>Rao, Georgeff, <a href=\"http://citeseer.ist.psu.edu/rao91modeling.html\">Modeling Rational Agents within a BDI-Architecture</a> Un articolo più teorico sugli agenti deliberative, con una  buona descrizione della logica modale sottostante (pt. 8)</li>\n<li>Dickinson, Wooldridge, <a href=\"http://portal.acm.org/citation.cfm?id=860708&amp;coll=Portal&amp;dl=GUIDE&amp;CFID=74904379&amp;CFTOKEN=39123825\">Towards Practical Reasoning Agents for the Semantic Web</a> Descrizione delle logiche usate per gli agenti razionali (pt. 4)</li>\n<li>Brooks, <a href=\"http://citeseer.ifi.unizh.ch/163604.html\">Intelligence without representation</a> Uno degli articoli più  importanti sugli agenti reattivi e della reazione agli agenti deliberativi, non molto tecnico ma chiaro.(pt. 4)<li>\n<li>Ferguson, <a href=\"http://citeseer.ist.psu.edu/302165.html\">TouringMachines: Autonomous Agents with Attitudes</a> (pt. 5)</li>\n<li>Brooks, <a href=\"http://people.csail.mit.edu/brooks/papers/nature.pdf\">The relationship between. matter and life</a> (pt. 2)</li>\n<li>Rosenschein, Kaelbling <a href=\"http://citeseer.ist.psu.edu/rosenschein95situated.html\">A Situated View of Representation and Control</a> (pt. 5)</li>\n<li>Van der Hoek, Wooldridge, <a href=\"http://citeseer.ist.psu.edu/vanderhoek03towards.html\">Towards a Logic of Rational Agency</a> (pt. 8)</li>\n<li>Pirri, Reiter, <a href=\"http://citeseer.ist.psu.edu/pirri99some.html\">Some Contributions to the Metatheory of the Situation Calculus</a> Descrizione formale del situation calculus e delle sue potenzialità, compresi i risvolti sul linguaggio di programmazione logica Golog (pt. 10)</li>\n<li>Agarwal et. alii, <a href=\"http://portal.acm.org/citation.cfm?id=979755&amp;coll=Portal&amp;dl=GUIDE&amp;CFID=74904379&amp;CFTOKEN=39123825\">Intelligent Agents in E-Learning</a> (pt. 2)</li>\n<li>Nealon, Moreno, <a href=\"http://www.eu-lat.org/eHealth/Nealon-Moreno.pdf\">Agent-Based Applications in Health Care</a>, Una buona descrizione delle possibilità egli agenti in medicina; dà effettivamente una buona overview del perché usare questa tecnologia (pt. 6)</li>\n<li>Isern, Moreno, <a href=\"http://www.etse.urv.es/recerca/rgai/toni/MAS/Publicacions/ccia04dia.pdf\">Agent-based careflow using CPGs</a>, Agenti per le linee guida in medicina (pt. 3)</li>\n<li>Fatima et al., <a href=\"http://portal.acm.org/citation.cfm?id=1018876&amp;coll=Portal&amp;dl=ACM&amp;CFID=44074959&amp;CFTOKEN=9779548\">Optimal Negotiation of Multiple Issues in Incomplete Information Settings</a>, Un articolo teorico sulla negoziazione tra agenti; alquanto complesso (pt. 8)</li>\n<li>Yuan, Detlor, <a href=\"http://portal.acm.org/citation.cfm?id=1042091.1042097&amp;coll=GUIDE&amp;dl=GUIDE&amp;idx=J79&amp;part=periodical&amp;WantType=periodical&amp;title=Communications%20of%20the%20ACM\">Intelligent Mobile Crisis Response Systems</a>, Un interessantissimo articolo sugli agenti intelligenti per la gestione di situazioni di crisi (terremoti, incendi etc.) (pt. 3)</li>\n<li>Ross, <a href=\"http://ieeexplore.ieee.org/iel5/6/29873/01363637.pdf?tp=&amp;arnumber=1363637&amp;isnumber=29873\">Managing Care through the Air</a>, (pt. 3)</li>\n<li>Shearin, Lieberman, <a href=\"http://portal.acm.org/citation.cfm?id=360325&amp;coll=Portal&amp;dl=ACM&amp;CFID=44074959&amp;CFTOKEN=9779548\">Intelligent Profiling by Example</a>, Un esempio di uso pratico degli agenti nelle ricerche complesse, in base ad un profilo utente (pt. 4)</li>\n<li>Bloechl et al., <a href=\"http://doi.ieeecomputersociety.org/10.1109/DEXA.2003.1232094\">Individualized E-Learning Systems Enabled by a Semantically Determined Adaptation of Learning Fragments</a>, Sistemi adattivi per e-learning; possono essere usati dagli agenti, (pt. 4)</li>\n<li>Jennings, Bussmann, <a href=\"http://eprints.ecs.soton.ac.uk/8563/\">Agent-based control systems</a>. Un survey sull'uso di agenti in situazioni industriali mission critical, (pt. 4)</li>\n<li>De Jong, <a href=\"http://portal.acm.org/citation.cfm?id=319382.319392&amp;coll=GUIDE&amp;dl=GUIDE&amp;idx=J79&amp;part=periodical&amp;WantType=periodical&amp;title=Communications%20of%20the%20ACM\">Evolutionary Computation for Discovery</a>. Un articolo introduttivo agli usi dell'Evolutionary Computing, (pt. 2)</li>\n<li>Vidal, <a href=\"http://portal.acm.org/citation.cfm?id=613581&amp;dl=GUIDE&amp;coll=GUIDE&amp;CFID=15151515&amp;CFTOKEN=6184618\">Inside an Agent</a>. Agenti  su web; una descrizione UML delle tipologie di agenti, (pt. 3)</li>\n<li>Liao, Dong, Lan, <a href=\"http://ieeexplore.ieee.org/iel5/9313/29620/01349184.pdf?tp=&amp;arnumber=1349184&amp;isnumber=29620\">An Emerging Field: Intersection of A-Life and AI</a>. Vantaggi dell'unire le tecniche dell'AI a quelle dell'a-life negli agenti, (pt. 3)</li>\n<li>Butz, Wilson, <a href=\"http://citeseer.ist.psu.edu/butz01algorithmic.html\">An Algorithmic Description of XCS</a>. Il learning classifier XCS con tutti i dettagli algoritmici (pt. 6)</li>\n<li>De Jong, Steels, <a href=\"http://www.isrl.uiuc.edu/~amag/langev/paper/dejong04complexSystems.html\"> A Distributed Learning Algorithm for Communication Development</a>. Apprendimento in sistemi multi-agenti (pt. 6)</li>\n<li>Ekdahl, <a href=\"http://www.cs.lth.se/home/Bertil_Ekdahl/publications/HAisanAA.pdf\">How Autonomous is an Autonomous Agent?</a>. Un'interessante analisi a cavallo tra computer science e filosofia sul concetto di autonomia (pt. 4)</li>\n<li>Guessoum, Rejeb, <a href=\"http://citeseer.ist.psu.edu/638889.html\">Using XCS to Build Adaptive Agents</a>. Sistemi Evolutionary Computing, in questo caso un learning classifier, per agenti intelligenti (pt. 3)</li>\n<li>Odell et al., <a href=\"http://www.jamesodell.com/ExtendingUML.pdf\">Extending UML for Agents</a>. Un'estensione di UML per agenti (pt. 4)</li>\n<li>Garcia et al., <a href=\"http://twiki.im.ufba.br/pub/Aside/RefazendaReferencias/spe-afg.pdf\">Agents in object-oriented software engineering</a>. Diverse tecniche di ingegneria del software per sistemi di agenti; tratta anche il tema dell'aspect oriented programming (pt. 6)</li>\n<li>Autori vari, <a href=\"http://csdl2.computer.org/persagen/DLAbsToc.jsp?resourcePath=/dl/mags/ex/&amp;toc=comp/mags/ex/2006/02/x2toc.xml&amp;DOI=10.1109/MIS.2006.19\">Agents in Industry: The Best from the AAMAS 2005 Industry Track</a>. Alcuni esempi recenti di uso degli agenti nell'industria (pt. 3)</li>\n<li>Sipper, The Emergence of Cellular Computing (pt. 3)</li>\n<li>Sarkar, A Brief History of Cellular Automata, (pt. 5)</li>\n<li>De Luca et al., An Integrated Environmental Decisional Support System Framework using Earth Observation, Cellular Automata and Multi-Agent System (pt. 3)</li>\n<li>De Luca et al., Data harmonization per i sistemi di supporto decisionale ambientale (pt. 3)</li>\n<li>De Luca, Situated and Adaptive e-Learning for Cultural Heritage</li>\n\n</li></li></ol></td></tr></table>",
  "ricevimento": "<table><tr><td>Dopo le lezioni o su appuntamento. In alternativa, inviare una mail a <a href=\"mailto:deluca@mat.uniroma2.it\">deluca@mat.uniroma2.it</a> e/o <a href=\"mailto:s.deluca@ieee.org\">s.deluca@ieee.org</a></td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}