{
  "nomeCorso": "Linguaggi e metodologie di programmazione",
  "docente": [
    {
      "first_name": "Miriam",
      "second_name": "Di Ianni"
    }
  ],
  "annoAccademico": "2009-2010",
  "crediti": "12",
  "settore": "",
  "anno": "2",
  "semestre": "1-2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Il corso è logicamente suddiviso in due parti. \r\n\r\nNella prima parte vengono presentati i principi che guidano la progettazione, realizzazione e implementazione dei moderni linguaggi di programmazione. Anzichè concentrarsi su uno specifico linguaggio, nel corso si identificano le caratteristiche più importanti, comuni ad amplie classi di linguaggi.\r\n\r\nNella seconda parte vengono introdotti i principi del paradigma di programmazione object oriented prendendo come riferimento il linguaggio Java.\r\n\r\n<b>Programma svolto nel primo semestre</b>: \r\n\r\n<b>Linguaggi di programmazione</b> (dal cap. 1 al cap. 5  - fino a 5.4 - di [1])\r\nMacchina astratta, interprete, linguaggio macchina.\r\nRealizzazione di una macchina astratta, implementazione di un linguaggio, implementazione interpretativa pura (definizione di interprete).\r\nImplementazione compilativa pura di un linguaggio (definizione di compilatore). Confronto tra implementazione compilativa pura e implementazione implementativa pura.\r\nImplementazione reale (con macchina intermedia) di un linguaggio, gerarchie di macchine astratte.\r\nLinguaggio visto come estensione della macchina astratta. Livelli di descrizione di un linguaggio. Grammatica e sintassi: grammatiche libere da contesto.\r\nNotazione BNF. Derivazione e linguaggi. Alberi di derivazione, grammatiche ambigue. Vincoli sintattici contestuali. Introduzione alle semantiche denotazionali e operazionali. Sintassi di un semplice linguaggio imperativo.\r\nSemantica Operazionale Strutturata: stato, transizione di stato. Semantica delle espressioni aritmetiche di un semplice linguaggio imperativo.\r\nSemantica Operazionale Strutturata: semantica delle espressioni logiche e dei comandi di un semplice linguaggio imperativo.\r\nSemantica Operazionale Strutturata: esempio di computazione. Nomi e oggetti denotabili. Ambiente e blocchi.\r\nBlocchi, regola di visibilità canonica, tipi di ambiente, modifiche dell'ambiente.\r\nRegole di scope statico.\r\nRegole di scope dinamico.\r\nAlcuni problemi di scope.\r\nTecniche di gestione della memoria. Gestione statica della memoria. Gestione dinamica della memoria con stack: record di attivazione, blocchi in-line, procedure.\r\n\r\n<b>Paradigma OO e linguaggio Java</b> (dal cap. 1 al cap. 6 - fino a 6.5 - di [2])\r\nOggetti e classi, metodi e parametri. Introduzione a BlueJ. Progetti discussi: shapes.\r\nDefinizione di classi Java e di attributi. Progetti discussi: shapes, Picture, lab-classes, naive-ticket-machine.\r\nLa struttura delle classi Java, attributi, costruttori. Progetti discussi: naive-ticket-machine.\r\nMetodi, istruzione if, variabili locali. Progetti discussi: Better-ticket-machine.\r\nCooperazione tra oggetti. Creazione di oggetti e notazione punto. Progetti discussi: digital clock, sistema di mailing.\r\nCollezioni di oggetti, ArrayList, generics, costrutto for each, principio della delega. Progetti discussi: Notebook1.\r\nIteratori. Array. Progetti discussi:AuctionSystem.\r\nUtilizzo di librerie, Documentazione Java. La classe String. Progetti discussi: Support System.\r\nRaggruppare classi in package. Regole di visibilità delle classi. Mappe e Insiemi.\r\nIntroduzione al test e debugging. Test di unità con BlueJ. Test automation.\r\n\r\n<b>Programma svolto nel secondo semestre:</b>\n<b>Linguaggi di programmazione</b> (dal cap. 5 - da 5.4 - al cap. 9 escluso di [1])\r\nGestione dinamica della memoria con heap: blocchi di dimensione fissa e variabile.\r\nImplementazione delle regole di scope: scope statico e scope dinamico.\r\nStrutturare il controllo: espressioni (6.1.3 escluso), nozione di comando, comandi per il controllo di sequenza, programmazione strutturata, ricorsione, ricorsione in coda.\r\nAstrarre sul controllo: sottoprogrammi, passaggio di parametri per valore, riferimento, costante, risultato, valore-risultato, nome. Funzioni di ordine superiore (solo funzioni come parametro senza aspetti implementativi). Eccezioni.\r\nStrutturare i dati: tipi di dato, sistema di tipi, tipi scalari, tipi composti, equivalenza e compatibilità tra tipi.\r\n\r\n<b>Paradigma OO e linguaggio Java</b> (dal cap. 6 (par. 6.5) al cap. 12 di [2])\r\nModularizzazione e interfacce. Tecniche per la ricerca dei bugs. Progetti discussi: CalcEngine.\r\nPrincipi di progettazione delle classi: coesione e accoppiamento, progettazione responsability-driven. Eliminazione del codice duplicato mediante tecniche di astrazione e refactoring. Progetti discussi: world-of-zuul.\r\nPrincipi dell'ereditarietà e del polimorfismo. Gerarchia delle classi Java. Progetti discussi: DoME\r\nOverriding, dispatch dinamico dei metodi, tipi stati e dinamici. Progetti discussi:DoME.\r\nClassi astratte e interfacce.  Progetti discussi: Foxes-and-rabbits.\r\nGestione degli eventi. Costruzioni di GUI: introduzione ai concetti fondamentali per la gestione delle GUI in linguaggio Java. Progetti discussi: ImageViewer.\r\nGestione degli errori. Strategia defensive programming. Tecniche di error reporting. Gestione delle eccezioni (checked exception e unchecked exception). Progetti discussi: address-book.\r\nI/O in Java: operazione di lettura e scrittura su filesystem. Serializzazione di oggetti.  Progetti discussi: dome-simple-output, address-book-io. </td></tr></table>",
  "testiRiferimento": "<table><tr><td><i>Libri di testo:</i>\r\n[1] <b>Linguaggi di programmazione. Principi e paradigmi</b> - Gabbrielli Maurizio e Martini Simone - Editore McGraw-Hill Companies.\r\n[2] <b>Objects First with Java - A Practical Introduction using BlueJ </b> - David J. Barnes &amp; Michael Kölling - Fourth Edition, Prentice Hall / Pearson Education, 2008.\r\nSito del libro: <a href=\"http://www.bluej.org/objects-first/\">http://www.bluej.org/objects-first/</a>\r\n--------------------------------------\r\n<i>Libri di testo alternativi:</i>\r\n[3] Programming Language Concepts. - Carlo Ghezzi, Mehadi Jazayeri - Editore Wiley.\r\n[4] Program Development in Java: Abstraction, Specification, and Object-Oriented Design - Barbara Liskov, John Guttag - Addison Wesley.\r\n--------------------------------------\r\n<i>Testi di consultazione: </i>\n<a href=\"http://java.sun.com/docs/books/jls/\">The Java Language Specification</a> disponibile/scaricabile sul Web.\r\n\r\n----------------------------------------------------------------------------------------------\r\nLink a risorse utili:\r\n<a href=\"http://hopl.murdoch.edu.au/\">HOPL: History of Programming Languages</a>.\r\n<a href=\"http://www.dmoz.org/Computers/Programming/Languages/\">Open directory of Programming Languages</a>.\r\n<a href=\"http://www.google.com/Top/Computers/Programming/Languages/\">Google's directory of programming languages</a>.\r\n<a href=\"http://dir.yahoo.com/Computers_and_Internet/Programming_and_Development/Languages/\">Yahoo's directory of programming languages</a>.\r\n<a href=\"http://www.hypernews.org/HyperNews/get/computing/lang-list.html\">HyperNews computer language list</a>.\r\n<a href=\"http://cgibin.erols.com/ziring/dopl.html\">Dictionary of Programming Languages, Neal &amp; Julie Ziring</a>.\r\n<a href=\"http://people.ku.edu/~nkinners/LangList/Extras/langlist.htm\">The Language List, maintained by Bill Kinnersley</a>.\r\n<b><a href=\"http://hanuska.blogspot.com/2006/08/swich-statement-code-smell-and.html\">Swich Statement code smell and Polymorphism</a></b>.\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Lunedì e mercoledì al termine delle lezioni, o su appuntamento.</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}