{
  "nomeCorso": "Sistemi operativi e reti",
  "docente": [
    {
      "first_name": "Pietro",
      "second_name": "Frasca"
    }
  ],
  "annoAccademico": "2015-2016",
  "crediti": "12",
  "settore": "INF/01",
  "anno": "2",
  "semestre": "1-2",
  "propedeuticità": "Architettura dei sistemi di elaborazione. Programmazione dei calcolatori con laboratorio.",
  "comunicazioni": [
    {
      "titolo": "Risultati esame prova scritta appello 3 - A.A. 2015/2016",
      "data": "22-09-2016 17:39",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_A3_20-09-2016.pdf\" target=\"_blank\">Risultati</a> esame prova scritta appello 2 - A.A. 2015/2016</p>\n<p><a href=\"upload/2015/SOR/Esame_SOR_A3-20-09-2016.pdf\" target=\"_blank\">Testo</a> della prova scritta</p>\n<p><a href=\"upload/2015/SOR/Esame_SOR_A3-20-09-2016%20-%20Soluzione.pdf\" target=\"_blank\">Testo con suluzione</a> della prova scritta</p>\n<p> </p>\n<p>La prova orale dell'esame di Sistemi operativi e reti si svolgerà Venerdì 23 Settembre 2016 alle ore 10:00 in aula 3A.</p>\n<p> </p>\n<p>Sosterranno la prova orale gli studenti che hanno conseguito una votazione di almeno 18/30. </p>\n<p>Gli studenti che non hanno superato la prova scritta, possono visionare il compito e chiedere spiegazioni durante lo svogimento della prova orale.</p><hr/>"
    },
    {
      "titolo": "Risultati esame prova scritta appello 2 - A.A. 2015/2016",
      "data": "20-07-2016 20:03",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_A2_19-07-2016.pdf\" target=\"_blank\">Risultati</a> esame prova scritta appello 2 - A.A. 2015/2016</p>\n<p><a href=\"upload/2015/SOR/Esame_SOR_A2-19-07-2016.pdf\" target=\"_blank\">Testo</a> della prova scritta</p>\n<p> </p>\n<p>La prova orale dell'esame di Sistemi operativi e reti si svolgerà Giovedì 21 Luglio 2016 alle ore 10:00 in aula 3A.</p>\n<p> </p>\n<p>Sosterranno la prova orale gli studenti che hanno conseguito una votazione di almeno 18/30. </p>\n<p>Gli studenti che non hanno superato la prova scritta, possono visionare il compito e chiedere spiegazioni durante lo svogimento della prova orale.</p><hr/>"
    },
    {
      "titolo": "Risultati esame prova scritta appello 1 - A.A. 2015/2016",
      "data": "16-06-2016 20:43",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_A1_14-06-2016.pdf\" target=\"_blank\">Risultati</a> esame prova scritta appello 1 - A.A. 2015-2016</p>\n<p><a href=\"upload/2015/SOR/Esame_SOR_A1-14-06-2016.pdf\" target=\"_blank\">Testo</a> della prova scritta</p>\n<p> </p>\n<p>La prova orale dell'esame di Sistemi operativi e reti si svolgerà nei seguenti giorni:</p>\n<p>- Venerdì 17 Giugno 2016 alle ore 10:00 aula 3A;</p>\n<p>- Lunedì 20 Giugno 2016  alle ore 10:00 aula 3A;</p>\n<p>- Martedì 21 Giugno 2016 alle ore 10:00 aula 3A.</p>\n<p> </p>\n<p>Gli  studenti che hanno conseguito una votazione di almeno 18/30 sosterranno la prova orale secondo la <a href=\"upload/2015/SOR/Date_SOR_A1_14-06-2016.pdf\" target=\"_blank\">seguente tabella</a>. </p>\n<p>Gli studenti che non hanno superato l'esame, possono visionare il compito e chiedere spiegazioni durante lo svogimento della prova orale.</p><hr/>"
    },
    {
      "titolo": "Lezione di Sistemi operativi e reti del 31-03-2016",
      "data": "30-03-2016 15:28",
      "contenuto": "<p>Si comunica che la lezione di Sitemi operativi e reti (Frasca) di Giovedì 31-03-2016 non si svolgerà.</p><hr/>"
    },
    {
      "titolo": "Risultati esonero prova scritta - A.A. 2015/2016",
      "data": "22-02-2016 19:26",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_EP_16-02-2016.pdf\">Risultati</a> esonero prova scritta - A.A. 2014-2015</p>\n<p> </p>\n<p> La prova orale dell'esonero di Sistemi operativi e reti si svolgerà nei seguenti giorni:</p>\n<p>- Martedì 23  Febbraio 2016 alle ore 10:00 in aula 10;</p>\n<p>- Mercoledì 24 Febbraio alle ore 10:00 in aula 28;</p>\n<p>- Giovedì 25 Febbraio alle ore 10:00 in aula 28.</p>\n<p> </p>\n<p>Gli  studenti che hanno conseguito una votazione di almeno 18/30 sosterranno la prova orale secondo la <a href=\"upload/2015/SOR/Date_SOR_EP_16-02-2016.pdf\">seguente tabella</a>. </p>\n<p> </p><hr/>"
    },
    {
      "titolo": "Risultati esame integrativo prova scritta del 19-02-2016",
      "data": "22-02-2016 19:00",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_EI_19-02-2016.pdf\">Risultati</a> esame integrativo prova scritta - A.A. 2014-2015</p>\n<p> </p><hr/>"
    },
    {
      "titolo": "Risultati esame prova scritta appello 4 - A.A. 2014/2015",
      "data": "18-02-2016 19:33",
      "contenuto": "<p><a href=\"upload/2015/SOR/Risultati_SOR_A4_16-02-2016.pdf\">Risultati</a> esame prova scritta appello 4 - A.A. 2014-2015</p>\n<p><a href=\"upload/2015/SOR/Esame_SOR_A4-16-02-2016.pdf\">Testo</a> della prova scritta</p>\n<p> </p>\n<p>La prova orale dell'esame dell'appello 4 si svolgerà Venerdì 19 Febbraio 2016 alle ore 10:00 in aula 3A. Sosterranno l'esame gli studenti che hanno conseguito una votazione di almeno 18/30. </p><hr/>"
    },
    {
      "titolo": "Informazioni esonero SOR A.A. 2015-2016",
      "data": "18-02-2016 18:54",
      "contenuto": "<p>I risultati della prova scritta e le date della prova orale dell'esonero di SOR dell'A.A. 2015-2016  saranno pubblicate lunedì 22 febbraio.</p>\n<p> </p><hr/>"
    },
    {
      "titolo": "Esempi di system call",
      "data": "28-01-2016 12:35",
      "contenuto": "<p>Nell'area \"Materiale didattico\" è stata pubblicata una nuova versione della raccolta di esempi sulle system call. <span style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: justify;\">La raccolta contiene esempi di base sull'uso delle chiamate di sistema descritte durante il corso e una raccolta di soluzioni di molti problemi d'esame (programmi multiprocesso e multithread).</span></p><hr/>"
    },
    {
      "titolo": "Esonero SOR A.A. 2015/2016",
      "data": "20-01-2016 11:22",
      "contenuto": "<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\">La prova scritta dell'esonero di Sistemi operativi e reti si svolgerà il 16-02-2016 alle ore 10:00 in aula T5. La prova orale si svolgerà a partire dal 19-02-2016.</p>\n<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\">Lo studente che intende sostenere l'esonero deve prenotarsi inviando, entro l'12-02-2016, una e-mail all'indirizzo del docente: <a href=\"mailto:frasca@mat.uniroma2.it\" target=\"_blank\" title=\"Esonero SOR\">frasca@mat.uniroma2.it</a>, indicando come oggetto la frase \"esame parziale SOR A.A. 2015/2016\" e indicando nel messaggio soltanto il proprio cognome, nome e numero di matricola nel seguente formato:</p>\n<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\"> </p>\n<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\">COGNOME NOME MATRICOLA</p>\n<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\"> </p>\n<p style=\"font-family: verdana, arial, helvetica, sans-serif; text-align: left;\">Nel riguadro \"modalità d'esame\" sono scritte informazione dettagliate sullo svolgimento dell'esonero. </p><hr/>"
    },
    {
      "titolo": "Data inizio lezioni",
      "data": "01-10-2015 13:41",
      "contenuto": "<p>Le lezioni di Sistemi operativi e reti inizieranno Martedì 6 Ottobre 2015 ore 11:00, in aula 3A.</p>"
    }
  ],
  "lezioni": [
    {
      "id": "48",
      "data": "24-05-2016",
      "contenuto": "<p>Confronto tra switch e router. Reti wireless. Collegamenti wireless e caratteristiche di rete. Wi-Fi 802.11. Canali e associazioni. Utilizzo di IEEE 802.11 per collegamenti punto-punto. Esempio di progettazione LAN.</p>"
    },
    {
      "id": "47",
      "data": "19-05-2016",
      "contenuto": "<p>Ethernet. Struttura del frame Ethernet. CSMA/CD di Ethernet. Efficienza di Ethernet. Tecnologie Ethernet. Hub. Switch dello strato di collegamento. </p>"
    },
    {
      "id": "46",
      "data": "17-05-2016",
      "contenuto": "<p>Protocolli di accesso multiplo. Protocolli a suddivisione di canale. Protocolli di accesso casuale. CSMA e CSMA/CD. Protocolli a turno. Reti LAN. Indirizzi LAN. ARP. Invio di datagram a nodi interni ed esterni alla LAN.</p>"
    },
    {
      "id": "45",
      "data": "12-05-2016",
      "contenuto": "<p>Lo strato di collegamento. Servizi offerti dallo strato di collegamento. Adattatori (schede di rete). Tecniche di rilevazione e correzione degli errori. Controllo di parità. Controllo di parità a due dimensioni. Somma di controllo. Controllo a ridondanza ciclica. Esempio di calcolo CRC.</p>"
    },
    {
      "id": "44",
      "data": "10-05-2016",
      "contenuto": "<p>Instradamento inter-sistema. BGP. Reti stub e reti stub multi homed. Instradamento multicast. IGMP. Algoritmi di instradamento multicast (solo conclusioni). Esempio di applicazione multicast in Java (facoltativa). </p>"
    },
    {
      "id": "43",
      "data": "05-05-2016",
      "contenuto": "<p>Algoritmi di instradamento. Algoritmi di instradamento LS. Algoritmi di instradamento DV. Confronto tra LS e DV. Instradamento gerarchico. Sistemi autonomi. Instradamento in Internet. Instradamento intra-sistema. RIP. OSPF.</p>"
    },
    {
      "id": "42",
      "data": "03-05-2016",
      "contenuto": "<p>UPnP (Universal Plug and Play). ICMP. IPv6. Formato del datagram IPv6. Passaggio da IPv4 a IPv6. Metodo dual-stack. Metodo del tunneling. ICMP. ICMP per IPv6.</p>"
    },
    {
      "id": "41",
      "data": "28-04-2016",
      "contenuto": "<p>Indirizzamento per classe. Indirizzamento CIDR. Assegnazione di indirizzi IP. Configurazione delle interfacce di rete di host e router. DHCP. Traduzione degli indirizzi di rete (NAT).</p>"
    },
    {
      "id": "40",
      "data": "26-04-2016",
      "contenuto": "<p>Reti datagram. Il protocollo IP. Formato dei datagram IPv4. Frammentazione del datagram IPv4. Indirizzamento IPv4.</p>"
    },
    {
      "id": "39",
      "data": "21-04-2016",
      "contenuto": "<p>Controllo della congestione TCP. AIMD. Partenza lenta. Reazione a eventi di timeout. Prevenzione della congestione. Descrizione macroscopica del throughput TCP. Strato di rete. Reti a circuito virtuale.</p>"
    },
    {
      "id": "38",
      "data": "19-04-2016",
      "contenuto": "<p>Alcuni tipici scenari. Raddoppio dell'intervallo di timeout. Ritrasmissione rapida. Instaurazione della connessione TCP. Controllo del flusso.</p>"
    },
    {
      "id": "37",
      "data": "14-04-2016",
      "contenuto": "<p>Esempio di numeri di sequenza e di riscontro. Stima del tempo di andata e ritorno (RTT) e timeout. Calcolo del timeout per le ritrasmissioni. Trasferimento affidabile dei dati.</p>"
    },
    {
      "id": "36",
      "data": "12-04-2016",
      "contenuto": "<p>Lo strato di trasporto. Multiplexing e demultiplexing nell'UDP e nel TCP. l protocollo UDP. Struttura del segmento UDP. Checksum di UDP. Trasporto orientato alla connessione: TCP. Struttura del segmento TCP. Numeri di sequenza e numeri di riscontro.   </p>"
    },
    {
      "id": "35",
      "data": "07-04-2016",
      "contenuto": "<p>Programmazione delle socket con UDP. Esempio di applicazione C/S con UDP.</p>"
    },
    {
      "id": "34",
      "data": "05-04-2016",
      "contenuto": "<p>Confronto tra le architetture C/S e P2P. Programmazione delle socket. Programmazione delle socket con TCP. Esempio di applicazione C/S in Java.</p>"
    },
    {
      "id": "33",
      "data": "29-03-2016",
      "contenuto": "<p>Distribuzione di contenuti. Server proxy. Esempio d'uso di server proxy. Reti per la distribuzione di contenuti (CDN). Applicazioni P2P. P2P con database centralizzato e distruito. Inondazione di richieste.</p>"
    },
    {
      "id": "32",
      "data": "24-03-2016",
      "contenuto": "<p>Protocolli di accesso alla posta. POP3. IMAP. Posta elettronica con HTTP. DNS. Servizi forniti dal DNS. Funzionamento del DNS. DNS: database distribuiti e gerarchici. Cache DNS. Record DNS. Messaggi DNS.</p>"
    },
    {
      "id": "31",
      "data": "22-03-2016",
      "contenuto": "<p>Il protocollo FTP. Modalità attiva e passiva. Comandi FTP. Posta elettronica. SMTP. Formati dei messaggi di posta e MIME. Estensioni MIME per dati non ascii. Esempi di messaggi con intestazioni MIMe. Esempi di messaggi multipart/mixed.</p>"
    },
    {
      "id": "30",
      "data": "17-03-2016",
      "contenuto": "<p>Formato del messaggio di risposta HTTP. Get condizionato. Interazione utente-server: autorizzazione e cookie. Connessione non persistente e persistente. Connessioni non persistenti in parallelismo  e in serie. Connessione persistente senza parallelismo e con parallelismo.</p>"
    },
    {
      "id": "29",
      "data": "15-03-2016",
      "contenuto": "<p>Livello di applicazione. Architetture e protocolli dello strato di applicazione Indirizzamento dei processi. Processi di comunicazione nella rete. Servizi formiti dai protocolli di trasporto alle applicazioni. Requisiti di servizio delle applicazioni. Applicazioni di rete. Web. Il protocollo HTTP. Formato del messaggio di richiesta HTTP.</p>"
    },
    {
      "id": "28",
      "data": "10-03-2016",
      "contenuto": "<p>Ritardi e perdite nelle reti a commutazione di pacchetto. Tipi di ritardo: trasmissione, propagazione, elaborazione, coda. Ritardo totale. Ritardo da host a host. Ritardi e percorsi in Internet. Traceroute e tracert. Perdita di pacchetti. Intensità del traffico. Lo stack protocollare di Internet e il modello ISO OSI. Gli strati di Internet  e i servizi che forniscono.</p>"
    },
    {
      "id": "27",
      "data": "08-03-2016",
      "contenuto": "<p>Mezzi trasmissivi. Doppini in rame. Cavi coassiali. Fibre ottiche. Canali radio terrestri. Canali radio satellitari. Accesso alla rete Internet. Accesso residenziale, aziendale e wireless. Gli ISP e le reti dorsali di Internet. </p>"
    },
    {
      "id": "26",
      "data": "03-03-2016",
      "contenuto": "<p>La sezione interna della rete (nucleo). Commutazione di circuito. Multiplazione (multiplexing) nelle reti a commutazione di circuito. FDM e TDM. Commutazione di pacchetto. Confronto tra commutazione di circuito e commutazione di pacchetto. Frammentazione del messaggio. Reti a commutazione di pacchetto datagram.</p>\n<p> </p>"
    },
    {
      "id": "25",
      "data": "01-03-2016",
      "contenuto": "<p>Internet. Descrizione dei servizi. Definizione di protocollo di rete. Applicazioni client/server. Servizi senza connessione e orientati alla connessione.</p>"
    },
    {
      "id": "24",
      "data": "12-01-2016",
      "contenuto": "<p>Organizzazione fisica del file system. Strutture dati del kernel per l’accesso ai file. System call per i file. Esempi. Protezione. Autenticazione degli utenti. I file /etc/passwd e /etc/group. Controllo di accesso alle risorse. ACL in Unix.</p>"
    },
    {
      "id": "23",
      "data": "07-01-2016",
      "contenuto": "<p>Esempio d'uso delle variabili condition nell'implementazione del modello produttore-consumatore. Gestione della memoria (Unix). Il file system (Unix). Stuttura logica del file system.  La variabile di ambiente PATH. </p>"
    },
    {
      "id": "22",
      "data": "22-12-2015",
      "contenuto": "<p>Esempio di sincronizzazione con i mutex. I semafori. Le variabili condition. Esempi di sincronizzazione con le variabili condition. </p>"
    },
    {
      "id": "21",
      "data": "17-12-2015",
      "contenuto": "<p>La funzione alarm. Esempio sd'uso di alarm. Comunicazione. Pipe. Esempio d'uso delle pipe. Chiamate di sistema per la sospensione di processi: pause, sleep e uspleep. I thread in Linux e Unix. I thread POSIX: la libreria pthread. Creazione e terminazione dei thread. Sincronizzazione tra thread. I mutex pthread. Esempi.</p>"
    },
    {
      "id": "20",
      "data": "15-12-2015",
      "contenuto": "<p>Sostituzione del codice. Scheduling in Unix. Interazione tra processi. Sincronizzazione. System call per l'uso di segnali. Invio di segnali tra processi.</p>"
    },
    {
      "id": "19",
      "data": "10-12-2015",
      "contenuto": "<p>Storia di Unix e Linux. Architettura di Unix. Interazione con l'utente. Shell. Processi e thread. Diagramma degli stati. Immagine di un processo Unix. System call per la gestione di processi. Creazione di processi. Terminazione di processi.  </p>"
    },
    {
      "id": "18",
      "data": "03-12-2015",
      "contenuto": "<p>Il livello organizzazione fisica. Tecniche di allocazione dei file. Allocazione contigua. Allocazione a lista concatenata, a lista con FAT, a indice. Protezione di file e directory. Matrice di protezione. ACL e C-list. </p>"
    },
    {
      "id": "17",
      "data": "01-12-2015",
      "contenuto": "<p>Dischi raid. Il file system. Struttura logica del file system. Gestione della stuttura logica del file system. Il livello di accesso. Strutture dati e operazioni di accesso ai file. memory mapping. Metodi di accesso: sequenziale, diretto e ad indice.</p>"
    },
    {
      "id": "16",
      "data": "26-11-2015",
      "contenuto": "<p>Driver di dispositivo. Flusso di controllo durante un trasferimento tra dispositivo e processo. Gestione del timer. Gestione dei dischi. Criteri di ordinamento dei dati su disco e politiche di scheduling. Esempio di memorizzazione su due tracce contigue e su tracce e settori sparsi. Algoritmi di scheduling FCFS, SSTF e SCAN.</p>"
    },
    {
      "id": "15",
      "data": "24-11-2015",
      "contenuto": "<p>Livello dipendente dai dispositivi. Controller di un dispositivo. Comunicazione tra processo e dispositivo. Gestione di un dispositivo mediante controllo di programma. Gestione di un dispositivo mediante interrupt. Descrittore di un dispositivo. Gestione di un dispositivo con DMA.</p>"
    },
    {
      "id": "14",
      "data": "19-11-2015",
      "contenuto": "<p>Memoria segmentata e paginata. Gestione degli spazi virtuali. Paginazione a più livelli. Gestione dell'I/O. Classificazione dei dispositivi. Struttura logica del sistema di I/O. Livello indipendente dai dispositivi. Bufferizzazione. Gestione degli errori e delle eccezioni. Allocazione dei dispositivi e tecniche di spooling.</p>"
    },
    {
      "id": "13",
      "data": "17-11-2015",
      "contenuto": "<p>Paginazione su richiesta. Gestione del page-fault. Rimpiazzamento delle pagine. Algoritmi di rimpiazzamento delle pagine. Algoritmo second chance.</p>"
    },
    {
      "id": "12",
      "data": "12-11-2015",
      "contenuto": "<p>Protezione e condivisione con spazio virtuale segmentato. Memoria paginata. Segmentazione su richiesta.</p>"
    },
    {
      "id": "11",
      "data": "10-11-2015",
      "contenuto": "<p>Tecniche di gestione della memoria. Memoria partizionata. Partizioni fisse e variabili. Tecniche di allocazione mediante free-list: best-fit, first-fit, worst-fit. Protezione e condivisione con spazio virtuale unico. </p>\n<p>Tecnica delle partizioni multiple. Segmentazione.</p>"
    },
    {
      "id": "10",
      "data": "05-11-2015",
      "contenuto": "<p>Metodi per il trattamento del blocco cristico. Prevenzione statica e dinamica. Algoritmo del banchiere. Rilevamento dei blocchi critici. Gestione della memoria. Creazione di un file eseguibile. Spazio virtuale unico. Rilocazione statica e dinamica. Spazio virtuale segmentato. </p>"
    },
    {
      "id": "9",
      "data": "03-11-2015",
      "contenuto": "<p>Blocco critico (stallo). Rappresentazioni dello stato di allocazione delle risorse. Modelli basati su grafo e modelli basati sulle matrici. Esempi di situazioni di stallo. Stallo con risorse consumabili. Condizioni necessarie per lo stallo.</p>"
    },
    {
      "id": "8",
      "data": "29-10-2015",
      "contenuto": "<p>Soluzione al problema della mutua esclusione con semafori. Problema della comunicazione. Soluzione al problema della comunicazione con semafori: produttore-consumatore con buffer di capacità 1. Produttore-consumatore con buffer di capacità N. Sincronizzazione dei processi con scambio di messaggi (message passing). Send e receive. Soluzione al problema della comunicazione tra processi. Comunicazione diretta e indiretta. Sincronizzazione tra processi comunicanti.</p>"
    },
    {
      "id": "7",
      "data": "27-10-2015",
      "contenuto": "<p>Algoritmi di scheduling real-time. Algoritmo Rate Monotonic (RM). Sincronizzazione tra processi/thread. Cooperazione e competizione. Modello ad ambiente globale. Modello ad ambiente locale. Problema della mutua esclusione. Soluzioni al problema della mutua esclusione con attesa attiva. Semafori.</p>"
    },
    {
      "id": "6",
      "data": "22-10-2015",
      "contenuto": "<p>Principali algoritmi di scheduling. FCFS. SJF. SRTF. Round robin. Algoritmi di scheduling basati sulle priorità. Algoritmi di scheduling a code multiple.</p>"
    },
    {
      "id": "5",
      "data": "20-10-2015",
      "contenuto": "<p>Thread. Thread a livello utente e a livello kernel. Scheduling. Scheduling a breve termine, a medio termine e lungo termine. Comportamento dei processi: cpu burst e i/o burst. Parametri di scheduling.</p>"
    },
    {
      "id": "4",
      "data": "15-10-2015",
      "contenuto": "<p>Descrittore del processo. Code di processi. Cambio di contesto. Creazione e terminazione dei processi. Esempio di creazione di processo in Unix. Interazione tra i processi. Esempio di processi cooperanti: modello produttore-consumatore. Esempio di processi in competizione. Il kernel di un sistema a processi. Trasferimento tra l'ambiente del kernel e l'ambiente dei processi. Chiamate di sistema bloccanti e non bloccanti.</p>"
    },
    {
      "id": "3",
      "data": "13-10-2015",
      "contenuto": "<p>Struttura ed organizzazione software dei sistemi operativi. Principali strutture: struttura monolitica, stratificata, a microkernel, modulare, client/server. Struttura dei sistemi operativi. Principali componenti dei sistemi operativi. Gestione dei processi. Definizione di processo. Immagine di un processo. Stati di un processo. Transizioni di stato. </p>"
    },
    {
      "id": "2",
      "data": "08-10-2015",
      "contenuto": "<p>Sistemi batch multiprogrammati. Sistemi a partizione di tempo (time-sharing). Sistemi in tempo reale. Sistemi paralleli e distribuiti. Sistemi operativi per PC. </p>"
    },
    {
      "id": "1",
      "data": "06-10-2015",
      "contenuto": "<p><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Introduzione al corso. Principali funzioni di un Sistema operativo. Classificazione dei sistemi operativi. Sistemi batch. </span></p>"
    }
  ],
  "materiale": [],
  "programma": "<table><tr><td><p><em>Parte I: Sistemi operativi </em>(I semestre)<strong> </strong></p>\n<ul>\n<li>Introduzione ai sistemi operativi.</li>\n<li>Storia e classificazione dei sistemi operativi.</li>\n<li>Principali modelli strutturali.</li>\n<li>Gestione dei processi.</li>\n<li>Threads.</li>\n<li>Sincronizzazione dei processi.</li>\n<li>Gestione della memoria.</li>\n<li>Gestione dell' I/O.</li>\n<li>Gestione del file system.</li>\n<li>I sistemi operativi Unix e Linux.</li>\n<li>Casi di studio: Unix e Linux</li>\n</ul>\n<p><br><em>Parte II: Reti di calcolatori (II semestre) </em></br></p>\n<ul>\n<li>Reti di calcolatori e Internet.</li>\n<li>Strato di applicazione.</li>\n<li>Strato di trasporto.</li>\n<li>Strato di rete e instradamento.</li>\n<li>Strato di collegamento e reti di area locale.</li>\n<li>Reti wireless</li>\n</ul></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p><em style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Testi di riferimento </em><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Sistemi operativi, II ed. - P. Ancilotti, M. Boari, A. Ciampolini, G. Lipari - McGraw-Hill </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Reti di Calcolatori e Internet, IV ed. - Un approccio top-down - J.F. Kurose, K.W. Ross - Pearson - Addison Wesley. </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><em style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Libri consigliati per approfondimenti </em><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Sistemi Operativi, IX ed., A. Silberschatz, P. Galvin, G. Gagne. Pearson. </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">I moderni Sistemi Operativi, III ed., A. S. Tanenbaum. Pearson - Prentice Hall. </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Sistemi operativi, D. M. Dhamdhere, McGraw-Hill. </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Reti di Calcolatori e Internet, B. A. Forouzan, McGraw-Hill.</span></br></br></br></br></br></br></br></br></p></td></tr></table>",
  "ricevimento": "<table><tr><td><p><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Stanza docente (0103) - Martedì ore 14.00 - 15.00. </span><br style=\"font-family: verdana, arial, helvetica; font-size: 11px;\"><span style=\"font-family: verdana, arial, helvetica; font-size: 11px;\">Per appuntamento via email.</span></br></p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>Gli studenti iscritti al nuovo ordinamento devono sostenere l'esame \"Sistemi operativi e reti\" di 12 crediti. Gli studenti iscritti al vecchio ordinamento devono sostenere separatamente gli esami \"Sistemi operativi\" di 6 crediti e \"Reti di calcolatori\" di 6 crediti. <br>L'esame consiste in una prova scritta e in una prova orale. Il testo della prova scritta è suddiviso in due parti. La prima parte è composta da un gruppo di 4-5 domande che riguardano argomenti di \"Sistemi operativi\". La seconda parte, è composta da un gruppo di 4-5 domande, relative ad argomenti di \"Reti di calcolatori\". Le domande sono del tipo a risposta aperta o sottoforma di problemi. Per la parte Sistemi operativi una delle domande consiste nello sviluppo di un breve programma in linguaggio C basato sulle system call POSIX studiate durante il corso. <br>La durata dell'esame di 12 crediti è di 3 ore, mentre la durata dell'esame di 6 crediti è di 1 ora e 30 minuti. Durante lo svolgimento della prova scritta è vietato l'uso di libri e/o appunti di qualsiasi genere. <br>Per sostenere la prova orale è necessario aver superato la prova scritta con una votazione di almeno 18/30. Inoltre, lo studente può svolgere una tesina facoltativa consistente nella realizzazione di un'applicazione in java basata sulla programmazione dei socket o di un'applicazione multi-thread scritta in c .<br>La tesina deve essere consegnata (personalmente o via e-mail) almeno una settimana prima della data della prova orale. La realizzazione della tesina consente di migliorare la votazione di 1,2 o 3 punti. <br>Per sostenere l'esame è obbligatorio prenotarsi mediante il servizio \"Servizi on Line\" all'indirizzo <a href=\"http://delphi.uniroma2.it\" target=\"_blank\">http://delphi.uniroma2.it</a><br>Una raccolta di testi di esame relativi agli a.a. passati e vari esempi di programmi sulle system call POSIX e sulla programmazione dei socket sono disponibili nell'area \"materiale didattico\".</br></br></br></br></br></br></p>\n<p> </p>\n<p><em>Esame parziale (esonero)</em></p>\n<p>Gli studenti del nuovo ordinamento possono sostenere,<span style=\"text-decoration: underline;\"> nel solo appello invernale</span>, l'esame parziale (esonero) di \"Sistemi operativi e reti\" che consiste in una prova scritta e in una prova orale basate sugli argomenti della prima parte del corso (Sistemi operativi).</p>\n<p>Lo studente che supera l'esame parziale deve sostenere la restante parte di SOR entro l'anno accademico corrente.</p>\n<p>Lo studente che intende sostenere l'esonero deve prenotarsi inviando una e-mail all'indirizzo del docente: frasca@mat.uniroma2.it, indicando come oggetto la frase \"esame parziale SOR A.A. 2015/2016\" e indicando nel messaggio il proprio cognome, nome e numero di matricola.<br>Il testo della prova scritta dell'esonero è composto da un gruppo di 4-5 domande. Le domande sono del tipo a risposta aperta o sottoforma di problemi. Una delle domande consiste nello sviluppo di un breve programma in linguaggio C basato sulle system call POSIX studiate durante il corso.</br></p>\n<p>La durata della prova scritta dell'esame parziale è di 1 ora e 30 minuti.</p>\n<p>Durante lo svolgimento della prova scritta è vietato l'uso di libri e/o appunti di qualsiasi genere. <br>Per sostenere la prova orale è necessario aver superato la prova scritta con una votazione di almeno 18/30.</br></p></td></tr></table>"
}