{
  "nomeCorso": "Fisica",
  "docente": [
    {
      "first_name": "Anna",
      "second_name": "Sgarlata"
    }
  ],
  "annoAccademico": "2011-2012",
  "crediti": "6",
  "settore": "",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Fisica 1\r<br/>1. Introduzione e vettori\r<br/>Unita' di misura e dimensioni. Ordini di grandezze e cifre significative.Fisica 1\r<br/>1. Introduzione e vettori\r<br/>Unita' di misura e dimensioni. Ordini di grandezze e cifre significative. Sistemi di riferimento e coordinate. Vettori e scalari. Somma e differenza di vettori, moltiplicazione per uno scalare. I vettori e le loro componenti. Versori. Prodotto scalare. Prodotto vettoriale. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 1)\r<br/> <br/>2. Moto rettilineo in una dimensione\r<br/>Posizione e spostamento. Velocità media e istantanea. Accelerazione. Un caso particolare: accelerazione costante. Le equazioni del moto uniformemente accelerato. Moto di un corpo in caduta libera. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 2)\r<br/> <br/>3. Moto in due e tre dimensioni.\r<br/>Posizione, spostamento, velocità e accelerazione. Equazioni del moto uniformemente accelerato. Moto di un proiettile pesante. Equazione della traiettoria. Gittata ed altezza massima raggiunta dal proiettile. Moto circolare uniforme. Accelerazione centripeta. Accelerazione tangenziale e radiale. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 3) \r<br/> <br/>4. Le forze ed il moto\r<br/>Il principio di inerzia o Prima Legge di Newton. La massa. Relazione tra massa ed accelerazione. La forza. Unità di misura: il newton. Seconda legge di Newton.  La terza legge di Newton. Alcune forze particolari: forza peso; forza normale ad un piano di appoggio; forza di attrito; tensione di una fune; forza centripeta, Forza Elastica, Forza viscosa. Composizione di forze. Forza risultante. Applicazioni delle leggi di Newton. Un caso particolare: Il Moto Armonico: Molla e Pendolo. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitoli 4, 5 e 12)\r<br/> <br/>5. Energia cinetica e lavoro\r<br/>Energia. Lavoro di una forza. Caso semplice: forza costante e spostamento in una dimensione. Lavoro svolto da una generica forza variabile lungo una curva nello spazio Unità di misura: il joule. Esempi: lavoro svolto dalla forza gravitazionale e da una forza elastica.Teorema dell'Impulso e Teorema dell'energia cinetica (o teorema delle forze vive). Potenza. Unità di misura: il watt. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 6)\r<br/> <br/>6. Energia potenziale e conservazione dell'energia.\r<br/>Forze conservative. Energia potenziale. Due casi; energia potenziale gravitazionale e energia potenziale elastica. Conservazione dell'energia meccanica. Bilancio dell' energia meccanica in presenza di forze non conservative. Come ricavare la forza qualora sia noto il potenziale. Le curve dell'energia potenziale: punti di equilibrio, punti di inversione del moto. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 7)\r<br/> <br/> <br/> <br/>Fisica 2\r<br/>7. Sistemi di punti materiali.  Quantità di moto.\r<br/>Il centro di massa.  Moto del centro di massa. Seconda equazione di Newton per un sistema di punti materiali. Quantità di moto. Quantità di moto di un sistema di punti materiali. Conservazione della quantità di moto. Risoluzione di esercizi.\r<br/>(Jewett-Serway, capitolo 8)\r<br/> <br/> <br/>8. Urti.\r<br/>Cosa è un urto. Caratteristiche delle forze agenti in un urto. Impulso. Quantità di moto ed energia cinetica in un urto.  Urti elastici ed anelastici in una dimensione: bersaglio fisso, bersaglio mobile. Urti in due dimensioni. Discussione di esercizi.\r<br/>(Jewett-Serway, capitolo 8)\r<br/> <br/>9. Moto rotazionale. Momento angolare.\r<br/>Variabili rotazionali:  angoli,  velocità angolare ed accelerazione angolare. Relazioni tra variabili lineari ed angolari.  Caso di un corpo rigido. Cinematica rotazionale di un corpo rigido: caso del moto con accelerazione angolare costante. Energia cinetica rotazionale. Momento d'inerzia. Calcolo del momento d'inerzia di un corpo rigido: barra rigida, cilindro pieno uniforme, sfera piena. Teorema di Huyghens-Steiner o degli assi paralleli. Momento di una forza.\r<br/>Seconda legge di Newton per il moto rotatorio. Il momento angolare per una particella puntiforme. La seconda legge di Newton e il momento angolare. Momento angolare di un sistema di particelle. Momento angolare di un corpo rigido che ruota intorno ad un asse fisso. Conservazione del momento angolare. Condizioni di equilibrio per un corpo rigido. Lavoro ed energia cinetica rotazionale. Rotolamento come combinazione di traslazione e rotazione. Moto di puro rotolamento. L'energia cinetica nel rotolamento. Le forze nel rotolamento. Il ruolo dell'attrito. Discussione di esercizi.\r<br/>(Jewett-Serway, capitolo 10 tranne paragrafo 10.10 sui giroscopi)\r<br/> <br/>10. La Gravita?, le Orbite Planetarie, l?Atomo di Idrogeno.\r<br/>Variabili rotazionali:  angoli,  velocità angolare ed accelerazione angolare. Relazioni tra La legge di Gravitazione Universale di Newton, Le Tre Leggi di Keplero. Considerazioni energetiche sul moto dei pianeti e dei satelliti: Energia Cinetica ed Energia Potenziale Gravitazionale. Velocita? di Fuga.  Spettri Atomici e teoria di Bohr dell?atomo dell?atomo di Idrogeno\r<br/>(Jewett-Serway, capitolo 11 tranne paragrafo 11.2 modelli strutturali)\r<br/> <br/>Roma, 25 maggio 2011\r<br/> <br/></td></tr></table>",
  "testiRiferimento": "<table><tr><td>Jewett &amp; Serway \"Principi di Fisica\" Volume I EdiSES</td></tr></table>",
  "ricevimento": "<table><tr><td>Gli studenti interessati ad essere ricevuti possono mandare un mail a sgarlata@roma2.infn.it e concordare un appuntamento</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}