{
  "nomeCorso": "Fisica",
  "docente": [
    {
      "first_name": "Paolo",
      "second_name": "Camarri"
    }
  ],
  "annoAccademico": "2014-2015",
  "crediti": "6",
  "settore": "FIS/01",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Analisi Matematica.",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><p> </p>\n<p>- Introduzione. Sistema Internazionale di misura. Grandezze fondamentali e derivate. Analisi dimensionale. Ordini di grandezza. Cifre significative. Vettori e somma di vettori in 2 e 3 dimensioni. - Componenti cartesiane di un vettore. Versori. Moto rettilineo. Velocità media e velocità istantanea. Legge oraria. Moto rettilineo uniforme. - Moto rettilineo uniformemente accelerato. Legge oraria del moto rettilineo uniformemente accelerato. Esempi e problemi risolti sul moto rettilineo. - Caduta libera di gravi lungo la verticale. Legge oraria per il moto rettilineo generico. Moto nel piano. Vettore posizione. Vettore spostamento. Vettore velocità. Vettore accelerazione. Proiezione di un moto piano su due assi cartesiani ortogonali. Moto piano con accelerazione costante. - Moto di un grave: equazione della traiettoria, tempo di volo e gittata. Moto circolare uniforme: accelerazione centripeta (direzione, verso e modulo), periodo, frequenza, velocità angolare. - Vettore accelerazione nel moto sul piano. Moto relativo: legge di composizione delle velocità in una e due dimensioni (solo moto relativo traslatorio). Dinamica del punto materiale: concetto di forza, prima legge della dinamica (principio di inerzia), sistemi di riferimento inerziali, massa inerziale, seconda legge della dinamica. Unità di misura della forza. - Riepilogo delle tre leggi della dinamica. Forza peso. Reazione vincolare. Equilibrio statico: esempi. Moto uniformemente accelerato su piano inclinato liscio. Macchina di Atwood. - Applicazioni delle leggi della dinamica a problemi semplici. Forze di contatto. Forza di attrito statico. Forza di attrito dinamico. Piano inclinato con attrito. Forze agenti nel moto circolare uniforme. Pendolo conico. - Ulteriori applicazioni delle leggi della dinamica. Auto in curva piana con attrito statico. Auto in curva sopraelevata senza attrito. “Giro della morte”. Introduzione al moto del pendolo semplice. Forza di attrito viscoso con modulo proporzionale alla velocità del corpo; velocità limite. Lavoro di una forza costante. Unità di misura del lavoro. Prodotto scalare di due vettori: definizione, proprietà e suo legame con le componenti cartesiane dei due vettori. - Interpretazione grafica del lavoro di una forza costante. Lavoro compiuto da una forza variabile e sua interpretazione grafica. Forza elastica: legge di Hooke, costante elastica, lavoro compiuto dalla forza elastica. Teorema delle forze vive. Energia cinetica. - Applicazioni del teorema delle forze vive. Potenza media e potenza istantanea. Unità di misura della potenza. - Calcolo della potenza sviluppata da una forza costante. Energia potenziale della forza peso. Conservazione dell’energia meccanica totale. Applicazioni. - Forze conservative e forze non conservative. Energia potenziale elastica. Legame tra una forza conservativa e la sua energia potenziale. Gradiente di una funzione scalare. Posizioni di equilibrio di un corpo sotto l'azione di una forza conservativa. Equilibrio stabile ed equilibrio instabile. Punti di inversione del moto sotto l'azione di una forza elastica. - Quantità di moto. Legge di conservazione della quantità di moto totale per un sistema isolato di due punti materiali interagenti. Impulso esercitato da una forza e sua interpretazione grafica. Urti elastici e anelastici. Calcolo delle velocità finali in urti totalmente anelastici e in urti elastici. - Dissipazione di energia cinetica in un urto unidimensionale. Urto con mutua interazione elastica. Urti in due dimensioni: concetti di base e caso particolare. Centro di massa di un sistema di N corpi. Prima equazione cardinale della dinamica dei sistemi. - Metodo pratico per la determinazione della posizione del centro di massa di un corpo solido. Calcolo della posizione del centro di massa di un sistema di punti materiali e di una figura piana omogenea. Moto del centro di massa. Moto rotazionale: parametri cinematici (posizione angolare, velocità angolare, accelerazione angolare). Spostamento angolare vettoriale infinitesimo. Vettori velocità angolare e accelerazione angolare. Moto rotazionale con accelerazione angolare costante. Legame tra velocità tangenziale e velocità angolare. Prodotto vettoriale e sue proprietà.</p>\n<p>- <span>Energia cinetica rotazionale. Sistemi rigidi e corpi rigidi. Momento d’inerzia di un corpo rigido rispetto a un asse fissato. Teorema di Huygens-Steiner. Esempi di calcolo del momento d’inerzia. Momento di una forza rispetto a un polo fissato. Equilibrio statico di un corpo rigido.</span></p>\n<p>- Dinamica del moto rotazionale. Lavoro di una forza nel moto rotazionale. Momento angolare rispetto a un polo fissato. Legame tra momento risultante delle forze esterne agenti su un sistema e momento angolare totale del sistema. Seconda equazione cardinale della dinamica dei sistemi. Teoremi di König. Requisiti per la conservazione del momento angolare totale di un sistema. Moto di puro rotolamento di un corpo rigido con simmetria di rotazione. [ - Moto rettilineo di un punto materiale sotto l'azione di una forza elastica (moto armonico). Posizione, velocità e accelerazione nel moto armonico. Parametri caratteristici del moto armonico: ampiezza, pulsazione, fase iniziale, periodo e frequenza. - Energia nel moto armonico. Pendolo semplice. Isocronismo delle piccole oscillazioni di un pendolo. Pendolo fisico. Moto rettilineo di un punto materiale sotto l'azione di una forza conservativa. Moto piano di un punto materiale sotto l'azione di una forza centrale. Forza gravitazionale e legge di gravitazione universale. Energia potenziale gravitazionale. Esperimento di Cavendish per la misura della costante universale G. Moto dei pianeti e leggi di Keplero. Energia potenziale efficace.] - Equilibrio termico. Temperatura e sua definizione operativa. Scala centigrada (Celsius) e scala Fahrenheit. Dilatazione lineare, superficiale e di volume di corpi solidi. Gas ideali o perfetti. Leggi di Boyle, Gay-Lussac, Charles. Equazione di stato dei gas perfetti. Costante universale R e costante di Boltzmann. - Forma ''puntuale'' dell'equazione di stato dei gas perfetti. Teoria cinetica dei gas. Interpretazione microscopica della pressione e della temperatura di un gas perfetto. Teorema di equipartizione dell'energia. Energia interna di un gas monoatomico. Velocità quadratica media delle molecole di un gas perfetto. - Distribuzione di Maxwell del modulo delle velocità molecolari di un gas. Energia interna di un sistema. Scambi energetici tra sistemi a temperatura diversa: il calore. Unità di misura del calore: la caloria. Esperienza di Joule ed equivalente meccanico della caloria. Capacità termica e calore specifico. Legge fondamentale della calorimetria. Convenzione dei segni del calore negli scambi energetici. Misura del calore specifico di un campione di una data sostanza. Calorimetro delle mescolanze. Transizioni di fase e calore latente. Lavoro nelle trasformazioni termodinamiche. Sorgenti termiche (termostati). Dipendenza del lavoro dalla trasformazione seguita tra due stati fissati. - Conservazione dell'energia e primo principio della termodinamica. Trasformazioni adiabatiche. Trasformazioni isobare. Trasformazioni isocore. Trasformazioni isoterme. Trasformazioni cicliche (cicli). Dipendenza della pressione atmosferica dalla quota. Calori specifici molari a volume costante e a pressione costante di un gas perfetto. Caso dei gas monoatomici. Legge di Mayer. Trasformazioni adiabatiche quasi statiche di un gas perfetto: legge di Poisson. - Calori specifici molari ed equipartizione dell'energia. Caso dei gas biatomici a temperature ''ordinarie''. Macchine termiche e loro cicli. Rendimento di una macchina termica. Secondo principio della termodinamica: enunciato di Kelvin-Planck. Trasformazioni reversibili e irreversibili. Ciclo di Carnot e suo rendimento. Pompe di calore e frigoriferi. Secondo principio della termodinamica: enunciato di Clausius. Equivalenza dei due enunciati. Idealità del ciclo di Carnot. Disuguaglianza di Clausius. Variazione di entropia lungo un cammino reversibile. Variazione dell'entropia totale di un sistema isolato (''freccia'' del tempo). Esempi di calcolo della variazione di entropia in trasformazioni irreversibili. </p></td></tr></table>",
  "testiRiferimento": "<table><tr><td>null</td></tr></table>",
  "ricevimento": "<table><tr><td>null</td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>Prova scritta finale e prova orale.</p>\n<p>La prova orale potrà essere sostenuta solo avendo ottenuto un voto non inferiore a 14/30 nella prova scritta finale.</p>\n<p>La prova scritta finale potrà essere sostenuta in uno degli appelli estivi, o in uno degli appelli autunnali o in uno degli appelli di febbraio.</p>\n<p>La prova scritta finale può essere sostituita dallo svolgimento di 3 prove scritte di esonero (ciascuna su una parte specifica del programma del corso) che verranno svolte durante il semestre (una nel mese di aprile, una nel mese di maggio, e l'ultima nel mese di giugno, circa 7 giorni dopo la fine delle lezioni.La media dei voti delle tre prove scritte di esonero dovrà essere non inferiore a 14/30, e il voto di una prova di esonero non potrà essere inferiore a 10/30. E' possibile recuperare una sola prova di esonero, quale che sia la motivazione (impossibilità a svolgere la prova nel giorno stabilito o voto della prova inferiore a 10/30). E' consentito recuperare una sola prova di esonero anche nel caso in cui si voglia cercare di migliorare la media dei voti degli esoneri: in questo caso la prova che potrà essere recuperata è quella con il voto più basso tra le tre. Non è consentito recuperare più di un esonero.</p>\n<p>La media ottenuta negli esoneri consente di svolgere la prova orale o in un appello appositamente predisposto nel mese di giugno o in uno degli appelli ordinari. <span style=\"text-decoration: underline;\">Chi ha superato gli esoneri si deve comunque prenotare per l'appello di esame in cui vuole sostenere la prova orale</span> (cioè entro il giorno precedente la prova scritta dell'appello), e poi è sufficiente che si presenti il giorno della prova orale.</p></td></tr></table>"
}