{
  "nomeCorso": "Intelligenza artificiale",
  "docente": [
    {
      "first_name": "Stefano",
      "second_name": "De Luca"
    }
  ],
  "annoAccademico": "2008-2009",
  "crediti": "6",
  "settore": "",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><ul>\n<li>Introduzione all'I.A.: definizione di intelligenza, adattività, agente.</li>\n<li>Introduzione al semantic web. RDF. OWL. Reasoning</li>\n<li>Tecniche di ricerca: ricerca su grafi, A*. Giochi: minimax, alfa-beta pruning.</li>\n<li>Rappresentazione della conoscenza: introduzione alla logica matematica, sistemi a frame, reti di conoscenza, RDF e OWL.</li>\n<li>Dimostrazione automatica di teoremi: completezza e decidibilità programmazione logica, risoluzione SLD, inferenze non monotoniche e logiche modali. Situation calculus. </li>\n<li>Introduzione ai sistemi esperti: forward e backward reasoning, l'algoritmo Rete, i motori a regole. SWRL - Semantic Web Rule Language</li>\n<li>Problematiche di pianificazione.</li>\n<li>Introduzione ai sistemi subsimbolici: algoritmi genetici, reti neuronali artificiali, a-life.</li>\n<li>Usi industriali dell'I.A.</li>\r\n\r\n\r\n\r\n\r\nIl corso utilizzerà il più possibile esempi presi dall'area del semantic web.\r\n\r\n\r\n\r\n<b>Obiettivi:</b> Avere una visione di insieme dell'intelligenza artificiale, conoscerne le problematiche e le aree principali, saper usare gli strumenti della logica matematica per rappresentare la conoscenza e derivarne inferenze, avere una competenza pratica basilare del semantic web, compresa la creazione di ontologie e semplici reasoning e dei sistemi a regole, nonché una introduzione alle reti neuronali e agli algoritmi genetici.\r\n\r\nComplessivamente lo studente sarà in grado di progettare e implementare semplici componenti intelligenti di un agente.\r\n\r\n<b>Esame:</b> L'esame avrà una parte scritta ed una orale facoltativa, con cui lo studente potrà migliorare la prestazione scritta.\r\n\r\nVi sarà un esonero intermedio che consentirà di qualificarsi per la prima parte dello scritto. Lo scritto finale sarà comunque completo, per gli studenti che non avranno fatto (o desiderano ripetere) l'esonero - chi avrà fatto l'esonero non risponderà alla prima parte delle domande.\r\n\r\nI temi dell'esame sono quelli indicati nel programma e riportati in modo più analitico nella storia del corso (sotto indicata).\r\n\r\nIn modo facoltativo, sarà possibile produrre una tesina scritta su un argomento concordato con il professore, che consentirà di aumentare il voto fino a 2 punti. Ad es. sulle logiche temporali, sulla tipologia delle reti neurali, sull'uso del modello biologico in AI etc.\r\n\r\nIn modo facoltativo, sarà possibile produrre un'esercitazione su un tema concordato con il professore, che consentirà di aumentare il voto fino a 3 punti. Ad es. apprendimento di un set di dati usando una rete neurale, applicazione di algoritmi genetici per risolvere un problema, creazione di un agente nel mondo del wumpus tramite il situation calculus.\r\n\r\nLo studio degli articoli discussi in aula sarà considerato positivamente nella valutazione. \r\n\r\n<table border=\"1\" class=\"tabel1\"><tbody><tr><th>N.</th><th>Lezione</th><th>Argomento</th><th>Materiale</th></tr><tr><td>1</td><td>7/10</td><td>Presentazione del corso; introduzione all'AI, sue applicazioni </td><td>R&amp;N, cap. 1, §1.1, §1.3, §1.4; slides 01</td></tr>\n<tr><td>2</td><td>10/10</td><td>Agenti intelligenti: interrelazione con l'ambiente, anatomia apprendimento</td><td>R&amp;N, cap. 2 da §2.1 a §2.4; slides 02</td></tr><tr><td>3</td><td>14/10</td><td>Introduzione al semantic web.</td><td>slides 03.</td></tr><tr><td>4</td><td>17/10</td><td>Creazione di un'ontologia. Le ontologie OWL spiegate tramite l'ontologia <a href=\"http://www.foaf-project.org/\">FOAF - Friend of a Friend</a>. Introduzione allo strumento per editing di ontologie <a href=\"http://protege.stanford.edu/\">Protégé</a>.</td><td>slides 04. I riferimenti  per FOAF e Protégé sono nella colonna a fianco.</td></tr><tr><td>5</td><td>21/10</td><td>Problem solving: formulazione dei problemi e degli obiettivi, soluzione di problemi tramite ricerca. Ricerche Depth First e Breadth First.</td><td>R&amp;N, cap. 3, da §3.1 a §3.5; slides 05.</td></tr><tr><td>6</td><td>24/10</td><td>Ricerca con informazioni: gready search, A*, sistemi di ricerca locale</td><td>R&amp;N, cap. 4, da §4.1 a §4.3; slides 06.</td></tr><tr><td>7</td><td>28/10</td><td>Giocare i giochi: minimax, alpha-beta pruning, giochi con informazioni imperfette, cut-off. </td><td>R&amp;N, cap. 6, da §6.1. a §6.6; slides 07.</td></tr><tr><td>8</td><td>31/10</td><td>Gli agenti basati su logica. Le basi di conoscenza. Il mondo del Wumpus. I modelli. </td><td>R&amp;N, cap. 7, da §7.1 a §7.4; slides 08</td></tr><tr><td>9</td><td>7/11</td><td>\tIl calcolo proposizionale, fondamenti</td><td>slides 09</td></tr><tr><td>10</td><td>11/11</td><td>Logica</td><td></td></tr><tr><td>11</td><td>18/11</td><td>Il calcolo proposizionale, derivazioni. I tableaux</td><td>slides 010, slides 11, cfr. URL <a href=\"http://www.umsu.de/logik/trees/\">http://www.umsu.de/logik/trees/</a>, dove è possibile calcolare automaticamente i tableaux a partire da una formula</td></tr><tr><td>12</td><td>21/12</td><td> L'approccio probabilistico. Le\r\nreti di Bayes e gli automi probabilistici</td><td>Slides 15 e 15a; R&amp;N cap. 14</td></tr><tr><td>13</td><td>25/11</td><td>Reti neuronali: introduzione, reti feed forward, apprendimento backpropagation</td><td>R&amp;N cap 20 (seconda parte). Slides 14 e 14a.</td></tr><tr><td>14</td><td>28/11</td><td>Reti neuronali. Lo strumento Joone; effetti dei parametri sulle reti neurali. </td><td>R&amp;N cap 20 (seconda parte). Slides 14 e 14a. Per Joone, URL: <a href=\"http://www.jooneworld.com/\">http://www.jooneworld.com/</a></td></tr><tr><td>15</td><td>2/12</td><td>I sistemi di clustering; le SOM - Self Organizing Map (o reti neurali di Kohonen) </td><td>Slides 16</td></tr><tr><td>16</td><td>5/12</td><td>I sistemi di clustering; le SOM - Self Organizing Map (o reti neurali di Kohonen) </td><td>Slides 16</td></tr><tr><td>17</td><td>16/12</td><td>Riepilogo ed esercitazione sugli algoritmi di ricerca, calcolo dei predicati, tableaux e situation calculus. </td><td> </td></tr><tr><td>18</td><td>19/12</td><td>Esonero </td><td> </td></tr>\n<tr><td>19</td><td>9/1</td><td>Classicazione e machine learning tramite Support Vector Machines (SVM)</td><td>Slides 17 ed esempi (file .zip), slides 17b </td></tr>\n<tr><td>20</td><td>13/1</td><td>Applicazioni delle tecniche di IA</td><td>n/a</td></tr>\n<tr><td>21</td><td>17/1</td><td>Applicazioni delle tecniche di IA</td><td>n/a</td></tr>\n<tr><td>22</td><td>20/1</td><td>Esempi industriali dell'IA; tesi</td><td>n/a</td></tr>\n</tbody></table></ul></td></tr></table>",
  "testiRiferimento": "<table><tr><td>Russell, Norvig: <b>Artificial Intelligence: A Modern Approach (2nd edition)</b>, Prentice Hall\r\n\r\nNe esiste una traduzione italiana in due volumi edita da Pearson Education Italia. La materia del corso è coperta quasi integralmente dal primo volume e dalle slides ed appunti che verranno forniti.\r\n\r\nIl testo di R&amp;N è molto ampio, non tutti i capitoli saranno coperti; Nella storia del corso (vedi sopra) saranno di volta in volta indicati i capitoli e i §paragrafi da studiare.\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Dopo le lezioni o su appuntamento. In ogni caso, inviare una mail a <a href=\"mailto:deluca@mat.uniroma2.it\">deluca@mat.uniroma2.it</a> e/o <a href=\"mailto:s.deluca@evodevo.it\">s.deluca@evodevo.it</a>. </td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}