{
  "nomeCorso": "Automi e linguaggi formali",
  "docente": [
    {
      "first_name": "Stefano",
      "second_name": "Varricchio"
    }
  ],
  "annoAccademico": "2006-2007",
  "crediti": "9",
  "settore": "",
  "anno": "2",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Di seguito vengo riportati gli argomenti trattati nelle singole lezioni. \r\nL'aggiornamento sara' effettuato al termine di ogni lezione. \r\n\r\nLezione del 9 Ottobre 2006  Monoide libero su un alfabeto e sue proprieta fondamentali. Nozione di linguaggio formale. Operatori di Kleene: unione, concatenazione , star. \r\n\r\nLezione del 11 Ottobre 2006. Automi a stati finiti deterministici. Diagrammi di transizione di automi finiti. Linguaggi regolari.  Pumping lemma.\r\n\r\nLezione del 13 Ottobre 2006. Automi non deterministici. Equivalenza fra automi deterministici e non deterministici. Proprieta' di chiusura dei linguaggi regolari rispetto a unione, intersezione e complemento.\r\n\r\nLezione del 16 Ottobre 2006. Espressioni regolari. Famiglia dei linguaggi razionali.  Automi normalizzati. Chiusura della famiglia dei linguaggi regolari rispetto a concatenazione e star.\r\n\r\n\r\nLezione del 18 Ottobre 2006.  Teorema di Kleene: equivalenza tra espressioni regolari e automi a stati finiti.\r\n \r\nLezione del 20 Ottobre 2006. Semigruppi, monoidi, morfismi, congruenze. Sottoinsiemi riconoscibili di un monoide. \r\n\r\nLezione del 23 Ottobre 2006. Equivalenza di Nerode di un linguaggio. Proprieta' dell'equivalenza di Nerode. Teorema di Nerode. Automa di Nerode e sua minimalita'. \r\n\r\nLezione del 25 Ottobre 2006.  Congruenza sintattica di un linguaggio e sue proprieta'. Teorema di Myhill.\r\n\r\nLezione del 27 Ottobre 2006. Chiusura dei linguaggi regolari rispetto a morfismi, morfismi inversi e immagine riflessa. Gap esponenziale tra automi deterministici e non deterministici.\r\n\r\nLezione del 30 Ottobre 2006.  Automi connessi. Congruenze di automi.  Automi ridotti.\r\n\r\nLezione del 3 Novembre 2006.  Caratterizzazione degli automi minimali. Morfismi tra automi. Unicita' dell'automa minimale.\r\n\r\nLezione del 6 Novembre 2006.  Algoritmo per la minimizzazione\r\n di un automa a stati finiti deterministico.\r\n\r\nLezione dl 8 Novembre 2006. Problemi decisionali su linguaggi regolari.\r\n\r\nLezione del 10 Novembre 2006. Automi di Mealy e di Moore. Equivalenza dei due modelli\r\n\r\nLezione del 13 Novembre 2006. Automi two-way deterministici e non deterministici. Crossing sequences.\r\n\r\nLezione del 17 Novembre 2006.  Equivalenza tra automi two-way e NFA.\r\n\r\nLezione del 20 Novembre 2006.  Insiemi riconoscibili e razionali in un monoide. Proprieta' di chiusura. Teorema di McKnight.\r\n\r\nLezione del 22 Novembre 2006. Insiemi riconoscibili nel prodotto diretto di due monoidi. Teorema di Mezei.  Intersezione di un insieme razionale con un riconoscibile. Non chiusura degli insiemi razionali rispetto a intersezione.\r\n\r\nLezione del 27 Novembre 2006. Caratterizzazione delle relazioni razionali: Teorema di Nivat.  Trasduzioni razionali e loro caratterizzazione.\r\n\r\nLezione del 29 Novembre 2006.  Trasduttori razionali. Caratterizzazione delle relazioni razionali in termini di insiemi accettati da trasduttori razionali.\r\n\r\nLezione del 4 Dicembre 2006. Parole come modelli per formule logiche.  Formule logiche del primo ordine. Esempi.\r\n\r\nLezione del 6 Dicembre 2006.  Linguaggi FO-definibili.\r\nFormule logiche monadiche del secondo ordine.  Linguaggi MSO definibili. \r\n\r\nLezione del 11 Dicembre 2006.  Teoremi di Buchi: equivalenza tra formule MSO e automi a stati finiti.\r\n\r\nLezione del 13 Dicembre 2006.  Linguaggi star-free.  Teorema sull'equivaleza tra linguaggi star-free e formule FO[&lt;].\r\n\r\nLezione  del 18 Dicembre 2006.  Applicazioni degli automi a problemi di string matching.  dictionary matching problem. Dictionary matching automaton.\r\n\r\nLezione del 20 Dicembre 2006. Rappresentazione degli automi e loro complessita'.   Realizzazione del dictionary matching automaton e problemi di complessita' connessi.\r\n\r\nLezione del 8 Gennaio 2007.  String matching automaton e sue proprieta'.\r\n\r\nLezione del 12 Gennaio 2007. Costruzione dello string matching automaton e sua complessita'.\r\n\r\nLezione del 15 Gennaio 2007. Suffix automaton di una stringa: proprieta' della congruenza di Nerode associata all'insieme dei prefissi di una stringa.\r\n\r\nLezione del 17 Gennaio 2007. Complessita' del suffix automaton di una stringa. Applicazioni del suffix automaton a problemi di string-matching(cenni).\r\n\r\n\r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>*) </td></tr></table>",
  "ricevimento": "<table><tr><td>null</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}