{
  "nomeCorso": "Metodologie di programmazione",
  "docente": [
    {
      "first_name": "Miriam",
      "second_name": "Di Ianni"
    }
  ],
  "annoAccademico": "2005-2006",
  "crediti": "6",
  "settore": "",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><b>Prima parte: metodologie di programmazione </b>\r\nAstrazione e decomposizione come metodologia di programmazione. Astrazione per parametrizazione e per specifica. Tipi di astrazione. \r\nAstrazione procedurale. Specifiche. Specifiche per l'astrazione procedurale. Progetto di astrazioni procedurali. \r\nEccezioni. Il meccanismo delle eccezioni in Java. Utilizzo delle eccezioni: riflessione e mascheramento, quando usare le eccezioni, eccezioni checked e unchecked. \r\nAstrazione sui dati. Specifiche, implementazione ed utilizzo delle astrazioni sui dati. La funzione di astrazione. L'invariante di rappresentazione. Effetti collaterali benefici. Progetto di astrazioni sui dati: mutabilità, adeguatezza, categorie di operazioni. \r\nAstrazione sull'iterazione. Iterazione in Java, Specifica, implementazione ed utilizzo. Invarianti e funzione di astrazione. Progetto di astrazioni sull'iterazione. \r\nGerarchie di tipi. Assegnazione e dispatching. Definizione di una gerarchia di tipi. Tipi eccezione. Classi astratte ed interfacce. Implementazioni multiple. Significato dei sottotipi. \r\nAstrazioni polimorfiche. Astrazioni sui dati di tipo polimorfico e suo utilizzo. Flessibilità. Procedure polimorfiche. \r\n\r\n<b>Seconda parte: linguaggio Java </b>\r\nEreditarietà, classi astratte, interface. \r\nClassi interne. \r\nEccezioni. \r\nIteratori. \r\nIl sistema I/O di Java (cenni). \r\nFinestre ed applet (cenni). \r\nRTTI e riflessione. \r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>B. Liskov, J. Guttag, \"Program Development in Java\", Addison Wesley. \r\n\r\nB. Eckel, \"Thinking in Java\" , Apogeo. <a href=\"http://www.ibiblio.org/pub/docs/books/eckel/\">Versione inglese. </a>\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Valido durante il periodo del corso: \r\nGiovedì 14:00-15:00\r\n</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}