{
  "nomeCorso": "Algoritmi distribuiti e reti complesse",
  "docente": "Andrea Clementi, Luciano Guala'",
  "annoAccademico": "2020-2021",
  "crediti": "9",
  "settore": "INF/01",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "ADRC: VERBALIZZAZIONE ET AL",
      "data": "25-02-2021 09:45",
      "contenuto": "GLI STUDENTI DEL CORSO DI ADRC INTERESSATI ALLA VERBALIZZAZIONE DEGLI ESAMI ED AL  RICONOSCIMENTO DI CFU EXTRA, SONO PREGATI DI SEGUIRE LE INFORMAZIONI DATE NEL CANALE GENERALE DI ADRC DELLA PIATTAFORMA TEAMS"
    },
    {
      "titolo": "ADRC ON LINE",
      "data": "28-09-2020 12:13",
      "contenuto": "A causa della nota pandemia COVID-19, le lezioni del corso avranno luogo in modalità on line, secondo l'orario ufficiale disponibile sul sito del corso di laurea:\n\nLUNEDI et GIOVEDI  dalle 14:30 alle 16:30.\n\nIL corso si svolgera' sulla piattaforma TEAM. Nel Team\n\nCLEMENTI-8065531-ALGORITMI_DISTRIBUITI_E_RETI_COMPLESSE\n\ntroverete tutte le informazioni e gli appuntamenti relativi al corso. E' fortemente consigliato partecipare attivamente a tutti gli eventi on-line del corso.\n\n\nPer iscriversi al suddetto TEAM specifico, *dopo* aver verificato l'attivazione ed il funzionamento delle proprie credenziali sulla suddetta piattaforma (rivolgendosi eventualmente ed esclusivamente ai contatti utili per  questa procedura), in caso di problemi specifici con il team di ADRC, lo studente interessato è pregato di inviare una email ai docenti del corso ADRC specificando nel soggetto \"ADRC Team\"."
    },
    {
      "titolo": "ADRC ON LINE",
      "data": "28-09-2020 12:02",
      "contenuto": ""
    }
  ],
  "lezioni": [
    {
      "id": "0",
      "data": "28-09-2020",
      "contenuto": "Quest'anno le lezioni avverranno ONLINE sulla piattaforma teams e saranno li memorizzate nel materiali didattico"
    }
  ],
  "materiale": [],
  "programma": "Il corso ADRC per l'a.a. 2020-21 sarà costituito da due moduli:\n\na) Calcolo Distribuito  (Prof. Clementi)\nb) Teoria Algoritmica dei Giochi (Dr. Gualà)\n\n\n\n\nIl modulo (a)\npresenta i principi fondamentali del calcolo distribuito sia da un punto di vista dei modelli di comunicazione/computazione più importanti che per quanto riguarda i metodi algoritmici fondamentali per tali modelli.\nL'obiettivo formativo e' quello di fornire degli strumenti efficienti e rigorosi per il Problem Solving in cui, rispetto ai corsi algoritmici della triennale, per la prima volta le entità computazionali (agenti)  sono molteplici ed interagenti.Questo nuovo paradigma offre ottime  basi per progettare  protocolli efficienti per problemi fondamentali ed estremamente attuali nel mondo dei moderni sistemi distribuiti.Questa parte sarà tenuta del Prof. Clementi e sarà di 6 cfu.Nel modulo (b), il Dr. Gualà tratterà un altro aspetto fondamentaledei sistemi distribuiti moderni: la presenza di comportamenti egoistici degli agenti di un sistema distribuito. Tale presenza ha portato negli ultimi decenni a sviluppare un'importante teoria:l'Algorithmic Game Theory. Profondamente ispirata dalla famosa Game Theory (Nash Equilbria), questa teoria viene trattata nel corso per affrontare importanti problematiche nel campo dell'ottimizzazione di reti di comunicazione e di altre applicazioni.\n\n\nQui sotto vengono riportati i  programmi generali e preliminari per i 2 moduli. Modulo (a): Algoritmi Distribuiti- Modelli di computazione distribuiti: paradigmi, algoritmi, misure di complessità, comunicazione- Un processo epidemico: Il  Broadcast e l'Information Spreading- Il problema del Wake-Up- Il problema dello Spanning Tree- Il problema del Leader Election- Il Modello Wireless: il fenomeno delle collisioni- Il Broadcast su Wireless Networks: protcolli  deterministici e randomizzati- Modelli e Processi  Distribuiti avanzati in    Network Science   Modulo (b)  Teoria Algoritmica dei Gioghi **** - da inserire *****",
  "testiRiferimento": "N. Santoro:\nDesign and analysis of Distributed Algorithms +  Slides e Note del Docente disponibili sulla piattaforma Teams",
  "ricevimento": "per appuntamento, concordato via email con i docenti. Il ricevimento avra' luogo\nattraverso la piattaforma Team. In casi eccezionali e per motivazioni specifiche valutate\ndai docenti, sara' possibile effettuare ricevimenti on-line su altri sistemi (skype, etc etc).",
  "modalitàEsame": "Gli esami si svolgeranno mediante un colloquio orale sulla piattaforma TEAM"
}