{
  "nomeCorso": "Matematica discreta",
  "docente": [
    {
      "first_name": "Giulia Maria Piacentini",
      "second_name": "Cattaneo"
    },
    {
      "first_name": "Paolo",
      "second_name": "Lipparini"
    }
  ],
  "annoAccademico": "2006-2007",
  "crediti": "6",
  "settore": "",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td> Relazioni di equivalenza. Definizioni ed esempi. Partizioni di un\r\ninsieme. Equivalenza della nozione di partizione di un insieme e di\r\nrelazione di equivalenza definita su quell'insieme.  Congruenze modulo un \r\nintero n. Costruzione delle classi di equivalenza. Insieme quoziente\r\nmodulo una relazione di equivalenza. Relazione di equivalenza su un\r\ninsieme A  associata ad\r\nuna funzione da A a B (Testo G.M.P.C. pagg. 12-16 e pag. 21 )\r\nRelazioni d'ordine. Ordinamento totale e parziale. Esempi. (G.M.P.C. pagg.\r\n16-17)\r\nDefinizione assiomatica dei numeri naturali (assiomi di Peano).\r\nFormulazioni equivalenti del principio di induzione matematica (senza\r\ndimostrazione). Divisione ocn resto in N. (G.M.P.C.\r\npagg. 22-27)\r\nI numeri interi come insieme quoziente. Definizione delle  operazioni di\r\naddizione e\r\nmoltiplicazione. Le operazioni date sono indipendenti dai\r\nrappresentanti.(G.M.P.C. pagg.41-44)\r\nElementi di analisi combinatoria. permutazioni. L'insieme di tutte le\r\npermutazioni di un insieme con n elementi. Cardinalita' di tale insieme.\r\nComposizione di permutazioni.  L'insieme di tutte le permutazioni di un\r\ninsieme con n elementi costituisce un gruppo non commutativo se n e'\r\nmaggiore di 2, con n! elementi. Calcoli nel caso dei primi valori di n.\r\nDisposizioni semplici di n oggetti di classe k. Combinazioni semplici di n\r\noggetti di classe k. Disposizioni con ripetizione di n oggetti di classe\r\nk. Combinazioni con ripetizione di n oggetti di classe k.\r\nIl principio di inclusione-esclusione. \r\nDivisione tra interi.  Il MCD di due interi. Calcolo del MCD mediante\r\nl'algoritmo\r\neuclideo delle divisioni successive. L'identita' di Bezout.\r\nDimostrazione teorica dell'esistenza del MCD.\r\nEquazioni diofantee lineari. Condizione di esistenza di una soluzione.\r\n(testo G.M.P.C. pagg. 46-51)\r\nElementi invertibili in Z. Elementi irriducibili. Il teorema fondamentale\r\ndell'aritmetica.  Conseguenze del teorema fondamentale dell'aritmetica:\r\ninfinita' dei numeri primi. (testo G.M.P.C. pagg. 51-55)\r\nI numeri razionali come insieme quoziente. (testo G.M.P.C. pagg. 56-59)\r\nRelazioni ricorsive. Esempi. Relazioni ricorsive lineari  di grado k.\r\nRisoluzione di equazioni ricorsive lineari omogenee di grado k:\r\nl'equazione caratteristica.  Il caso in cui le radici dell'equazione\r\ncaratteristica sono tutte distinte e il caso in cui alcune radici\r\ncompaiono con molteplicita' maggiore di 1.  I numeri di Fibonacci.\r\nRelazioni ricorsive lineari non omogenee: la torre di Hanoi.\r\nCongruenze e loro proprieta'. Le classi resto modulo n. Addizione e\r\nmoltiplicazione tra classi. L'anello Z_n delle classi resto modulo n:\r\nesame della sua struttura: Z_n e' un dominio di integrita' se e solo se\r\nn=p e' un numero primo.(G.M.P.C. pagg. 67-70)\r\nProposizione 2.6.8. e conseguenza (il piccolo teorema di Fermat) (G.M.P.C.\r\npagg. 70-71)\r\nLa prova del nove: suo signficato. Criteri di divisibilita'. (GMPC pagg.\r\n71-74\r\nRisoluzione di congruenze lineari e il teorema cinese dei resti.\r\nApplicazioni: Z_rs isomorfo a Z_r x Z_s se MCD(r,s)=1. (GMPC\r\npagg. 75-84)\r\nLa funzione di Eulero. Calcolo della funzione di Eulero per interi dei \r\nquali si conosce la fattorizzazione. Il teorema di Eulero. Applicazioni.\r\nDeterminazione delle classi invertibili in Z_n. Z_n e' un campo se s solo\r\nse n e' un numero primo.\r\n(GMPC pagg. 84-88)\r\nTest di primalita' e di non primalita'. Il crivello di Eratostene per la\r\ndeterminazione di tutti i primi minori di un dato numero.\r\nIl metodo di fattorizzazione di Fermat. (GMPC pagg. 90-92)\r\nCrittografia. La crittografia a chiave pubblica. Il sistema RSA. Il\r\nproblema dell'autenticazione delle firme.\r\n(GMPC pagg. 93-99)\r\nPolinomi. Operazioni di addizione e moltiplicazione tra polinomi. Il\r\ngrado di un polinomio. I polinomi a coefficienti in un campo. Divisione   \r\ncon resto. Il massimo comun divisore tra polinomi. L'algoritmo euclideo\r\ndelle divisioni successive per la ricerca del Massimo comun\r\ndivisore. Polinomi invertibili in K[x] (K campo). Polinomi riducibili e \r\nirriducibili su K. Polinomi associati. Un polinomio non nullo a\r\ncoefficienti in un campo  non puo' avere piu' radici del suo grado. Caratterizzazione di tutti i polinomi irriducibili su C e su R.\r\nPolinomi a coefficienti razionali. Polinomi in Z[x] primitivi. Studio\r\ndella irriducibilita' di polinomi su Q. Test per controllare l'esistenza\r\ndi radici razionali di polinomi a coefficienti interi.\r\nIl criterio di irriducibilita' di Eisenstein. (GMPC pagg. 109-127)\r\nPassaggio da polinomi a coefficienti in Z a polinomi a coeficienti in Z_p\r\nper verificare la irriducibilita' di un polinomio su Q. (GMPC pagg.\r\n128-130) \r\nLe principali strutture algebriche: gruppi, anelli, campi.  Esempi. Il\r\ngruppo delle permutazioni di n oggetti. Composizione di permutazioni.\r\nLa permutazione inversa di una data permutazione. (GMPC pagg. 217-219)\r\n Campi finiti. Costruzione di campi finiti con p^n elementi. Quozienti di anelli di polinomi. Determinazione delle classi invertibili nel quoziente.\r\n\r\n\r\n\r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>G.M.Piacentini Cattaneo Algebra, un approccio algoritmico, Decibel Zanichelli</td></tr></table>",
  "ricevimento": "<table><tr><td> Lunedi' ore 14.30-16.30 aula 29\r\nMercoledi' ore 14.30-16.30 nel mio studio</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}