{
  "nomeCorso": "Fisica",
  "docente": [
    {
      "first_name": "Paolo",
      "second_name": "Camarri"
    }
  ],
  "annoAccademico": "2016-2017",
  "crediti": "6",
  "settore": "FIS/01",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Analisi Matematica.",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><p>- Introduzione. Sistema Internazionale di misura. Grandezze fondamentali e derivate. Analisi dimensionale. Ordini di grandezza. Cifre significative. Vettori e somma di vettori in 2 e 3 dimensioni.</p>\n<p>- Componenti cartesiane di un vettore. Versori. Moto rettilineo. Velocità media e velocità istantanea. Legge oraria. Moto rettilineo uniforme.</p>\n<p>- Moto rettilineo uniformemente accelerato. Legge oraria del moto rettilineo uniformemente accelerato. Esempi e problemi risolti sul moto rettilineo.</p>\n<p>- Caduta libera di gravi lungo la verticale. Legge oraria per il moto rettilineo generico. Moto nel piano. Vettore posizione. Vettore spostamento. Vettore velocità. Vettore accelerazione. Proiezione di un moto piano su due assi cartesiani ortogonali. Moto piano con accelerazione costante.</p>\n<p>- Moto di un grave: equazione della traiettoria, tempo di volo e gittata. Moto circolare uniforme: accelerazione centripeta (direzione, verso e modulo), periodo, frequenza, velocità angolare.</p>\n<p>- Vettore accelerazione nel moto sul piano. Moto relativo: legge di composizione delle velocità in una e due dimensioni (solo moto relativo traslatorio). Dinamica del punto materiale: concetto di forza, prima legge della dinamica (principio di inerzia), sistemi di riferimento inerziali, massa inerziale, seconda legge della dinamica. Unità di misura della forza.</p>\n<p>- Riepilogo delle tre leggi della dinamica. Forza peso. Reazione vincolare. Equilibrio statico: esempi. Moto uniformemente accelerato su piano inclinato liscio. Macchina di Atwood.</p>\n<p>- Applicazioni delle leggi della dinamica a problemi semplici. Forze di contatto. Forza di attrito statico. Forza di attrito dinamico. Piano inclinato con attrito. Forze agenti nel moto circolare uniforme. Pendolo conico.</p>\n<p>- Ulteriori applicazioni delle leggi della dinamica. Auto in curva piana con attrito statico. Auto in curva sopraelevata senza attrito. “Giro della morte”. Introduzione al moto del pendolo semplice. Forza di attrito viscoso con modulo proporzionale alla velocità del corpo; velocità limite. Lavoro di una forza costante. Unità di misura del lavoro. Prodotto scalare di due vettori: definizione, proprietà e suo legame con le componenti cartesiane dei due vettori.</p>\n<p>- Interpretazione grafica del lavoro di una forza costante. Lavoro compiuto da una forza variabile e sua interpretazione grafica. Forza elastica: legge di Hooke, costante elastica, lavoro compiuto dalla forza elastica. Teorema delle forze vive. Energia cinetica.</p>\n<p>- Applicazioni del teorema delle forze vive. Potenza media e potenza istantanea. Unità di misura della potenza.</p>\n<p>- Calcolo della potenza sviluppata da una forza costante. Energia potenziale della forza peso. Conservazione dell’energia meccanica totale. Applicazioni.</p>\n<p>- Forze conservative e forze non conservative. Energia potenziale elastica. Legame tra una forza conservativa e la sua energia potenziale. Gradiente di una funzione scalare. Posizioni di equilibrio di un corpo sotto l'azione di una forza conservativa. Equilibrio stabile ed equilibrio instabile. Punti di inversione del moto sotto l'azione di una forza elastica.</p>\n<p>- Quantità di moto. Legge di conservazione della quantità di moto totale per un sistema isolato di due punti materiali interagenti. Impulso esercitato da una forza e sua interpretazione grafica. Urti elastici e anelastici. Calcolo delle velocità finali in urti totalmente anelastici e in urti elastici.</p>\n<p>- Dissipazione di energia cinetica in un urto unidimensionale. Urto con mutua interazione elastica. Urti in due dimensioni: concetti di base e caso particolare. Centro di massa di un sistema di N corpi. Prima equazione<br>cardinale della dinamica dei sistemi.</br></p>\n<p>- Metodo pratico per la determinazione della posizione del centro di massa di un corpo solido. Calcolo della posizione del centro di massa di un sistema di punti materiali e di una figura piana omogenea. Moto del centro di massa. Moto rotazionale: parametri cinematici (posizione angolare, velocità angolare, accelerazione angolare). Spostamento angolare vettoriale infinitesimo. Vettori velocità angolare e accelerazione angolare. Moto rotazionale con accelerazione angolare costante. Legame tra velocità tangenziale e velocità angolare. Prodotto vettoriale e sue proprietà.<br>- Energia cinetica rotazionale. Sistemi rigidi e corpi rigidi. Momento d’inerzia di un corpo rigido rispetto a un asse fissato. Teorema di Huygens-Steiner. Esempi di calcolo del momento d’inerzia. Momento di una forza rispetto a un polo fissato. Equilibrio statico di un corpo rigido.<br>- Dinamica del moto rotazionale. Lavoro di una forza nel moto rotazionale. Momento angolare rispetto a un polo fissato. Legame tra momento risultante delle forze esterne agenti su un sistema e momento angolare totale del sistema. Seconda equazione cardinale della dinamica dei sistemi. Teoremi di König. Requisiti per la conservazione del momento angolare totale di un sistema. Moto di puro rotolamento di un corpo rigido con simmetria di rotazione.</br></br></p>\n<p>- Moto rettilineo di un punto materiale sotto l'azione di una forza elastica (moto armonico). Posizione, velocità e accelerazione nel moto armonico. Parametri caratteristici del moto armonico: ampiezza, pulsazione, fase iniziale, periodo e frequenza.</p>\n<p>- Energia nel moto armonico. Pendolo semplice. Isocronismo delle piccole oscillazioni di un pendolo. Pendolo fisico. Moto rettilineo di un punto materiale sotto l'azione di una forza conservativa. Moto piano di un punto materiale sotto l'azione di una forza centrale. Forza gravitazionale e legge di gravitazione universale. Energia potenziale gravitazionale. Esperimento di Cavendish per la misura della costante universale G. Moto dei pianeti e leggi di Keplero. Energia potenziale efficace.</p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p>R. A. Serway - J. W. Jewett</p>\n<p>\"Fisica per Scienze ed Ingegneria - Volume 1\"</p>\n<p>V Edizione</p>\n<p>EdiSES</p></td></tr></table>",
  "ricevimento": "<table><tr><td><p>Lunedì dalle 14.30 alle 15.30</p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>Prova scritta finale e colloquio orale</p>\n<p>La prova scritta finale può essere sostituita dal superamento di due esoneri scritti durante il corso</p></td></tr></table>"
}