{
  "nomeCorso": "Sistemi operativi",
  "docente": [
    {
      "first_name": "Pietro",
      "second_name": "Frasca"
    }
  ],
  "annoAccademico": "2006-2007",
  "crediti": "6",
  "settore": "",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Obiettivo del corso e' quello di fornire i concetti fondamentali dei sistemi operativi moderni. \r\n\r\n<b>Prerequisiti</b> \r\nConoscenza di base di programmazione e del linguaggio C. \r\nConoscenza di base di Architetture dei calcolatori \r\n\r\n<b>Programma</b> \r\nIntroduzione ai sistemi operativi. \r\nStoria e classificazione dei sistemi operativi. \r\nRichiami di architetture dei sistemi di elaborazione \r\nPrincipali modelli strutturali. \r\nGestione dei processi. \r\nThreads. \r\nSincronizzazione dei processi. \r\nGestione della memoria. \r\nGestione dell' I/O. \r\nGestione del file system. \r\nI sistemi operativi Unix e Linux \r\n\r\nCasi di studio: \r\nUnix e Linux \r\n\r\n<b>Programma dettagliato</b> \r\n(riferito al libro di testo di riferimento <i>Sistemi operativi - P. Ancilotti, M. Boari, A. Ciampolini, G. Lipari - McGraw-Hill</i>) \r\n<b>1. CONCETTI DI BASE. </b>Principali funzioni di un SO. Portabilità dei programmi. Gestione delle risorse. Protezione e sicurezza. Astrazione di macchina virtuale. \r\nCenni storici dei SO. Sistemi batch. Sistemi time-sharing. SO in tempo reale. SO per PC. SO paralleli e distribuiti. Richiami di architetture del calcolatore. Struttura dei SO. Componenti di un SO. Modelli strutturali. \r\n<b>2. GESTIONE DEI PROCESSI. </b>Definizione di processo. Stati dei processi. Descrittore di un processo. Code di processi. Cambio di contesto. Creazione e terminazione dei processi. Interazione tra i processi. Nucleo di un sistema a processi. Scheduling. Thread. \r\n<b>3. SINCRONIZZAZIONE DEI PROCESSI.</b> Interazione tra i processi. Mutua esclusione. Modello produttore-consumatore. Semafori. Primitive send e receive. Comunicazione e sincronizzazione tra processi. Blocco critico. Condizioni per il blocco critico. Trattamento del blocco critico. \r\n<b>4. GESTIONE DELLA MEMORIA.</b> Memoria virtuale. Rilocazione statica e dinamica. Organizzazione della memoria virtuale. Allocazione della memoria fisica. Dimensionamento della memoria virtuale. \r\nTecniche di gestione della memoria. Memoria partizionata. Memoria segmentata. Memoria paginata. Memoria segmentata e paginata. Gestione degli spazi virtuali. \r\n<b>5. GESTIONE DELL' I/O.</b> Organizzazione logica del sottosistema di I/O. Livello indipendente dai dispositivi. Livello dipendente dai dispositivi. Gestore di un dispositivo. Gestione di un dispositivo a controllo di programma, mediante interruzione e in DMA. Descrittore di dispositivo. Driver di dispositivo. Flusso di controllo durante un trasferimento di dati. Gestione del timer. \r\nGestione e organizzazione dei dischi. organizzazione fisica dei dischi. Ordinamento dei dati e scheduling. Criteri FCFS, SSFT, SCAN. Dischi RAID \r\n<b>6. FILE SYSTEM. </b>Organizzazione. struttura logica. Accesso. Metodi di accesso. Protezione. Organizzazione fisica. Tecniche di allocazione dei file. Allocazione contigua. Allocazione a lista concatenata ed a indice. \r\n<b>7. I SISTEMI OPERATIVI UNIX E LINUX.</b> Storia di Unix e di Linux. Architettura di Unix. Organizzazione. Interazione con l'utente. Lo Shell. Sintassi di comandi dello Shell. I processi in Unix. Diagramma degli stati. Immagine di un processo Unix. \r\nSystem Call per la gestione dei processi. Creazione dei processi. Terminazione dei processi. Sostituzione di codice. \r\nLo scheduling in Unix. La gestione della memoria in Unix. Il file system. Organizzazione logica del file system di Unix. Protezione in Unix. Organizzazione fisica del file System di Unix. \r\nSystem Call per l'accesso ai file. \r\nInterazione tra processi. Sincronizzazione: i segnali. System call per l'uso del segnali. Comunicazione: pipe. \r\nI Thread in Linux e Unix. Thread POSIX: la libreria pthread. Creazione/terminazione di thread. Sincronizzazione tra thread: i mutex della libreria pthread e variabili condition.\r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td><b>Testo di riferimento:</b> \r\nSistemi operativi - P. Ancilotti, M. Boari, A. Ciampolini, G. Lipari - McGraw-Hill \r\n\r\n<b>In alternativa e per approfondimenti</b>\r\n- Sistemi Operativi, VII ed., A. Silberschatz, P. Galvin, G. Gagne. Pearson. \r\n\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Stanza docente (0103) - Venerdì 15.00 - 16.00</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}