{
  "nomeCorso": "Fisica 1",
  "docente": [
    {
      "first_name": "Roberto",
      "second_name": "Francini"
    }
  ],
  "annoAccademico": "2005-2006",
  "crediti": "3",
  "settore": "",
  "anno": "2",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Il programma sarà aggiornato dopo ogni lezione.\r\nOltre gli argomenti via via indicati, fanno parte integrante del programma anche esercizi (discussi durante le lezioni).\r\n\r\n\r\n\r\nFISICA 1\r\n\r\n1. Grandezze scalari e vettoriali. \r\nOperazioni con le grandezze scalari. Somma e differenza di vettori. Prodotto di un vettore per uno scalare. Componenti di un vettore. Versori. Prodotto scalare e prodotto vettoriale: definizione e proprietà.\r\n(riferimento: cap. 3 di Halliday-Resnick-Walker, tutto)\r\n\r\n2. Cinematica di un punto materiale in una sola dimensione.\r\nPosizione e spostamento. Loro carattere vettoriale. Velocità media ed istantanea. Accelerazione media ed istantanea. Carattere vettoriale della velocità e della accelerazione. velocità ed accelerazione come derivata prima e seconda della posizione rispetto al tempo. Integrazione delle equazioni della cinematica nel caso di accelerazione costante. Caduta di un grave.\r\n(riferimento: cap. 2 di Halliday-Resnick-Walker, tutto)\r\n\r\n3. Cinematica di un punto in due e tre dimensioni.\r\nPosizione e spostamento, velocità e accelerazione in due o tre dimensioni. Moto di un proiettile: analisi del moto sui diversi assi, equazione della traiettoria. Moto circolare uniforme. Accelerazione centripeta.\r\n(riferimento: cap. 4 di Halliday-Resnick-Walker, tranne gli ultimi due paragrafi sui moti relativi)\r\n\r\n4. Le forze ed il moto.\r\nCosa è una forza. Carattere vettoriale della forza. Unità di misura.\r\nForza ed accelerazione. Il principio di inerzia. La seconda legge di Newton: F=ma. La massa di un corpo. Sistemi di riferimento inerziali e non inerziali. Trasformazioni galileiane. Relazione tra le accelerazioni misurate in due sistemi in moto. Forze di inerzia. La forza centrifuga. Descrizione qualitativa della caduta di un corpo da una torre. \r\nLa terza legge di Newton. Alcune forze particolari: la forza peso, la rezione vincolare, la tensione di una fune, la forza di attrito, la forza centripeta. Ancora sulla forza di attrito: caratterisctihe e proprietà. Attrito statico e dinamico. \r\n( su Halliday-Resnick-Walker: cap. 5, tutto; cap. 6, tutto tranne il paragrafo sulla resistenza del mezzo e la velocità limite)\r\n\r\n5. Energia cinetica e lavoro.\r\nIl concetto di energia. Il lavoro meccanico di una forza. Il lavoro come integrale curvilineo. Teorema dell'energia cinetica. Due casi importanti: il lavoro svolto dalla forza di gravità e dalla forza elastica. Potenza. Unità di misura di lavoro e potenza: joule e watt.\r\n(su Halliday-Resnick-Walker: cap. 7, tutto)\r\n\r\n6. Energia potenziale e conservazione dell'energia.\r\nForze conservative. Condizioni necessarie e sufficienti perchè una forza sia conservativa. Energia potenziale. Ruolo della costante additiva. Calcolo dell'energia potenziale in alcuni casi particolari: forza gravitazionale e forza elastica. Conservazione dell'energia meccanica. Analisi del moto di un punto in una dimensione utilizzando le curve dell'energia potenziale. Relazione tra potenziale e forza. Punti di equilibrio.  Lavoro svolto da una forza esterna su un sistema. Conservazione dell'energia totale di un sistema.\r\n(su Halliday-Resnick-Walker: cap. 8, tutto)\r\n\r\n7. Sistemi di punti materiali.\r\nIl centro di massa  per un sistema di punti materiali e per un corpo rigido. Seconda legge di Newton per un sistema di punti materiali. Quantità di moto. Quantità di moto di un sistema di punti materiali. Conservazione della quantità di moto.\r\n(su Halliday-Resnick-Walker: cap. 9, tutto tranne il paragrafo sui sistemi a massa variabile)\r\n\r\n8. Urti.\r\nCosa è un urto. Teorema dell'impulso. Urti elastici ed anelastici. Caso in una sola dimensione: bersaglio fisso e bersaglio mobile. Urti in due dimensioni.  Sistema del centro di massa.\r\n(su Halliday-Resnick-Walker: cap. 10, tutto)\r\n\r\n\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>D. Halliday, R. Resnick, J. Walker\r\nFondamenti di Fisica \r\nEditrice Ambrosiana \r\n\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>venerdì   13.30-14.30\r\nstudio del docente, corridoio C1 del Dipartimento di Fisica, tel. 06/72594288  goletti@roma2.infn.it\r\n</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}