{
  "nomeCorso": "Algoritmi e strutture dati 2",
  "docente": [
    {
      "first_name": "Francesco",
      "second_name": "Pasquale"
    }
  ],
  "annoAccademico": "2021-2022",
  "crediti": "6",
  "settore": "INF/01",
  "anno": "3",
  "semestre": "1",
  "propedeuticità": "Algoritmi e strutture dati.",
  "comunicazioni": [
    {
      "titolo": "Informazioni",
      "data": "04-10-2021 22:41",
      "contenuto": "<p>Gli studenti interessati a partecipare alle lezioni sono invitati a iscriversi al corso tramite il <a href=\"https://delphi.uniroma2.it/\" target=\"_blank\">Delphi</a>. Questo non è né obbligatorio né vincolante (potete seguire il corso anche senza registrarvi e potete abbandonarlo in ogni momento anche se vi siete registrati), ma è utile a me per avere l'elenco degli indirizzi email degli studenti interessati, nel caso avessi necessità di inviare comunicazioni urgenti relative al corso.</p>\n<p> </p>\n<p>Le lezioni si svolgono, di norma, in Aula <em>16</em> al SoGeNe. Per venire in aula è necessario prenotare un posto tramite il <a href=\"https://delphi.uniroma2.it/\" target=\"_blank\">Delphi</a>. Si ricorda inoltre che chi entra nei locali dell'Ateneo è tenuto a rispettare il protocollo di sicurezza, reperibile qui: <a href=\"https://web.uniroma2.it/it/percorso/infostudenticovid\" target=\"_blank\">infostudenticovid.uniroma2.it</a>.</p>\n<p> </p>\n<p>Io non uso Microsoft Teams per la gestione dei corsi e personalmente disapprovo l'utilizzo in ambito accademico di qualunque piattaforma basata su software proprietario. Tutto il materiale didattico relativo a questo corso sarà reso disponibile sulla pagina web del corso: <br> <a href=\"https://www.mat.uniroma2.it/~pasquale/dida/aa2122/asd2/\" target=\"_blank\">https://www.mat.uniroma2.it/~pasquale/dida/aa2122/asd2/</a></br></p>\n<p> </p>\n<p>Gli studenti che non possono partecipare alle lezioni in presenza, potranno partecipare da remoto collegandosi a questo link: <a href=\"https://tvalgoteam.site/asd2\" target=\"_blank\">https://tvalgoteam.site/asd2</a> (si tratta di un'istanza di <a href=\"https://jitsi.org/\" target=\"_blank\">Jitsi</a> installata su un pc che si trova nel mio ufficio). Chi volesse fare delle prove indipendenti con questo sistema di videoconferenza può usare il server messo a disposizione dagli sviluppatori di jitsi <a href=\"https://meet.jit.si/\" target=\"_blank\">qui</a>, oppure uno dei numerosi server italiani messi a disposizione da volontari in questo periodo di emergenza, di cui trovate un elenco <a href=\"https://iorestoacasa.work/server.html\" target=\"_blank\">qui</a> (o, volendo, può anche installarsi un proprio server: istruzioni dettagliate si trovano <a href=\"https://jitsi.github.io/handbook/docs/devops-guide/devops-guide-start\" target=\"_blank\">qui</a>). Cercherò inoltre di registrare tutte le lezioni e renderle disponibili.</p>\n<p> </p>\n<p>Per qualunque altra informazione non esitate a contattarmi per email.</p>\n<p> </p>\n<p><em>F.P.</em></p>"
    }
  ],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><p style=\"text-align: center;\"><strong>Programma provvisorio</strong></p>\n<ol>\n<li><span style=\"text-decoration: underline;\">Progettare algoritmi efficienti.</span> Riepilogo delle tecniche più efficaci per progettare algoritmi efficienti: <em>Greedy</em>, <em>Divide-et-Impera</em>, Programmazione Dinamica, Riduzioni. Il problema <em>Max-Flow</em> e l'algoritmo di Ford e Fulkerson.</li>\n<li><span style=\"text-decoration: underline;\">Problemi computazionalmente difficili.</span> Richiami di <em>NP</em>-completezza da un punto di vista algoritmico. Le tecniche per affrontare i problemi computazionalmente difficili: ricerca esaustiva intelligente, algoritmi approssimanti, euristiche. I problemi computazionalmente difficili come risorsa: il protocollo di Diffie-Hellman, il sistema <em>RSA</em> e i fondamenti della crittografia a chiave pubblica. La matematica dietro le scene: Teoria dei numeri.</li>\n<li><span style=\"text-decoration: underline;\">Algoritmi probabilistici.</span> Il ruolo della <em>randomness</em> negli algoritmi. Quando scegliere a caso semplifica l'implementazione: Test di primalità di Miller-Rabin. Quando scegliere a caso rende gli algoritmi più efficienti: <em>Packet Routing</em>. Quando poter scegliere a caso è indispensabile: Protocolli interattivi e <em>zero-knowledge proofs</em>. Le tecniche per analizzare gli algoritmi probabilistici, la concentrazione della misura. Metodi Monte Carlo. Cenni alla classe #P. Campionamento e conteggio approssimato. Catene di Markov a stati finiti e tempo discreto. Cenni a <em>FPRAS</em> (<em>Fully Polynomial-time Radomized Approximation Scheme</em>) e ai metodi <em>MCMC</em> (<em>Markov Chain Monte Carlo</em>).</li>\n<li><span style=\"text-decoration: underline;\"><em>Cryptocurrencies</em></span>.Le idee algoritmiche che hanno dato vita a <em>Bitcoin</em>. Gli ingredienti: reti <em>Peer-to-Peer</em>, funzioni <em>hash</em> crittografiche e firme digitali. La <em>Blockchain</em> e il problema del consenso distribuito. Transazioni, blocchi, alberi di Merkle.</li>\n</ol></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p><strong>Testi di riferimento</strong></p>\n<p> </p>\n<p>[1] S. Dasgupta, C. Papadimitriou, and U. Vazirani. <em>Algorithms</em>. McGraw-Hill, 2006. <br> [2] M. Mitzenmacher and E. Upfal. <em>Probability and Computing</em> (2nd edition). Cambridge University Press, 2017.<br> [3] A. Narayanan, J. Bonneau, E. Felten, A. Miller, and S. Goldfeder. <em>Bitcoin and Cryptocurrency Technologies</em>. Princeton University Press, 2016.</br></br></p>\n<p> </p>\n<p> </p>\n<p><strong>Testi di supporto</strong></p>\n<p>[4] J. Kleinberg and E. Tardos. <em>Algorithm Design</em>. Addison-Wesley, 2005.<br> [5] T.H. Cormen, C.E. Leiserson, R.L. Rivest, C. Stein. <em>Introduction to Algorithms</em>. The MIT press, 2001.<br> [6] T. Roughgarden. <em>Algorithms Illuminated: Part 4: Algorithms for NP-Hard Problems</em>. Soundlikeyourself Publishing LLC, 2020.</br></br></p></td></tr></table>",
  "ricevimento": "<table><tr><td><p>Durante il periodo delle lezioni (Ottobre 2021 - Gennaio 2022):<br>Giovedì 16:00 - 18:00 oppure su appuntamento.<br><br>Al di fuori del periodo delle lezioni:<br/>Su appuntamento.</br></br></br></p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>L'esame consiste in una prova scritta e in un colloquio orale. <br><br/> Durante il corso gli studenti potranno svolgere due test intermedi sotto forma di <em>homework</em>. Chi ottiene una valutazione positiva a entrambi gli <em>homework</em> è esonerato dalla prova scritta.</br></p></td></tr></table>"
}