{
  "nomeCorso": "Matematica discreta",
  "docente": [
    {
      "first_name": "Fabio",
      "second_name": "Gavarini"
    }
  ],
  "annoAccademico": "2015-2016",
  "crediti": "9",
  "settore": "MAT/02",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "APPELLI d'ESAME di Settembre 2016: scritto il 14, orale il 27",
      "data": "13-07-2016 18:51",
      "contenuto": "<p>Salve a Tutti,</p>\n<p> </p>\n<p>  ho messo in rete le date (e le modalità) per gli <strong><span style=\"text-decoration: underline;\">esami</span> della sessione autunnale</strong> (Settembre 2016), le trovate alla pagina</p>\n<p> </p>\n<p>    http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html#inizio_pagina</p>\n<p> </p>\n<p>  In breve, lo scritto sarà Mercoledì 14 alle 10:00, in aula T5, l'orale invece Martedì 27, alle 9:00, in aula 17.</p>\n<p> </p>\n<p>  <strong>NOTATE</strong> che questi saranno gli <strong>ultimi</strong> appelli - scritto e orale - dell'a.a. 2015-16.  Nell'a.a. 2016-17 il corso e gli esami li farà un altro docente, con le regole che stabilirà; in particolare, se avrete superato lo scritto nel 2015-16 ma non l'orale, nel 2016-17 il voto ottenuto allo scritto non varrà più nulla - \"decade\", per così dire, e si azzera tutto...</p>\n<p> </p>\n<p>  Vi ricordo che per partecipare a qualunque prova d'esame dovete preventivamente <strong>PRENOTARVI</strong> su Delphi, come indicato nella suddetta pagina.</p>\n<p> </p>\n<p>  Saluti,</p>\n<p> </p>\n<p>          Fabio Gavarini</p>\n<p> </p>\n<p> </p><hr/>"
    },
    {
      "titolo": "APPELLI d'ESAME di Giugno-Luglio 2016  (inclusi appelli *straordinari*)",
      "data": "20-04-2016 13:29",
      "contenuto": "<p>Salve a Tutti,</p>\n<p> </p>\n<p>  ho messo in rete le date (e le modalità) per gli <strong><span style=\"text-decoration: underline;\">esami</span> della sessione estiva</strong> (Giugno-Luglio 2016), le trovate alla pagina</p>\n<p> </p>\n<p>    http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html#inizio_pagina</p>\n<p> </p>\n<p>  <strong>NOTATE</strong> che oltre ad UN appello (ordinario) - che è quanto previsto dal regolamento - ho <em>aggiunto anche <strong>UN appello <span style=\"text-decoration: underline;\">straordinario</span></strong></em>, a vostro esclusivo beneficio...</p>\n<p> </p>\n<p>  Vi ricordo che per partecipare a qualunque prova d'esame dovete preventivamente <strong>PRENOTARVI</strong> su Delphi, come indicato nella suddetta pagina.</p>\n<p> </p>\n<p>  Saluti,</p>\n<p> </p>\n<p>          Fabio Gavarini</p>\n<p> </p>\n<p> </p><hr/>"
    },
    {
      "titolo": "scaricamento videolezioni di Gavarini",
      "data": "07-10-2015 14:24",
      "contenuto": "<p> </p>\n<p>  Salve a tutti.</p>\n<p> </p>\n<p>  Come ho già detto a lezione - e ripetuto a qualcun altro - ci sono molto spesso dei problemi nello scaricare le mie videolezioni.  Evidentemente c'è un problema col server, il quale NON gestisce correttamente le richieste di download dall'esterno.</p>\n<p>  Però sappiate che le videolezioni CI SONO davvero, non sono files vuoti o corrotti, ho riprovato anche recentemente, e - magari dopo vari tentativi... - i files li riesco a recuperare, e sono sani e funzionanti.</p>\n<p> </p>\n<p>  Tenete conto che:<br>     -1- a volte il file viene scaricato *correttamente*, anche se il PC afferma che è \"corrotto\": a me è capitato, la prima volta il PC non voleva aprirlo, ma la seconda volta l'ha aperto senza far storie (lo stesso file, *senza* nemmeno riscaricarlo...).  Quindi se siete riusciti a scaricare qualcosa ma sembra problematico, non rinunciate subito.</br></p>\n<p>    -2- a volte invece si tratta di un problema di connessione: se provate a scaricare da una qualche rete *interna all'ateneo* dovrebbe (?) funzionare tutto; anche lì poi non tutte vanno bene, qualcuno una volta mi disse che usando una certa rete (locale) non era riuscito a scaricare nulla mentre invece ci era riuscito connettendosi a \"Eduroam\".<br>     -3- altre volte ancora basta cambiare browser...  Qualcuno NON riusciva con Chrome - e io ho problemi con Firefox - poi alla fine invece ha risolto senza difficoltà usando Internet Explorer.  È possibile che il sito su cui sono postati i files sia ottimizzato soltanto per Internet Explorer...  (purtroppo succede, c'è più d'un sistemista che NON si preoccupa di preparare un sito che funzioni sempre - basterebbe che fosse scritto BENE...).  Magari provate anche voi a cambiare browser.<br>     -4- *alle brutte*, posso passarvi tutto io direttamente: se una volta vi portate un PC vi copiate tutto dalla mia pennetta, oppure vi portate una pennetta e vi faccio copiare tutto dal mio PC; magari basta che lo faccia qualcuno e poi fate girare su qualche sito di condivisione (che so, Google+, DropBox, What'sApp, Va'Zapp, K-Pizz o qualunque altro...).  Si tratta di 28 files per complessivi 3, 67 Gb di memoria.<br><br>  A parte questo, provate a guardarvi le istruzioni *qui sotto* (a seguire), e vedete se risolvono le vostre (eventuali) difficoltà; me le girò uno studente che (tre anni fa) incontrava gli stessi problemi ed era riuscito a venirne a capo.  Il metodo è un po' contorto, sicuramente si può fare di meglio; in ogni caso, anche pochi mesi fa qualche altro studente con lo stesso problema l'ha risolto seguendo quelle indicazioni.</br></br></br></br></p>\n<p> </p>\n<p>  Eccovi *qui di seguito* le istruzioni preannunciate.<br/>  Saluti,</p>\n<p> </p>\n<p>                 Fabio Gavarini</p>\n<p> </p>\n<p>&gt;---</p>\n<p> </p>\n<p>&gt; From  [...]  Wed Oct 10 16:23:44 2012<br/>&gt; Date: Wed, 10 Oct 2012 16:23:00 +0200<br/>&gt; From:  [...]<br/>&gt; To: gavarini@axp.mat.uniroma2.it<br/>&gt; Subject: RE: Videolezioni<br/><br/>  Si` guardi se vuole informazioni piu dettagliate le dico che (anche se non so se vale per tutti i casi) nel mio caso ho risolto cosi`:<br/>(browser utilizzato: google chrome, faccio l'esempio con il file insiemi_avi3.zip)<br/><br/>1) dal suo profilo di didattica nell'ultima pagina in cui c'e` il file insiemi.zip e \" (click destro ? salva con nome) \" (qui),  ho copiato<br/>il link cliccando con il tasto destro e selezionando la voce \"copia indirizzo link\";<br/><br/>2)con un download manager chiamato jdownloader che si scarica gratuitamente dal sito ho iniziato il download,  non appena si copia<br/>il link del file da scaricare, si attiva il prograramma e tenta di iniziare il download (ovviamente prima deve essere installato e<br/>aperto) , se no se non si attiva subito basta andare su links--&gt;add links--&gt;add url e si incolla il link li`;<br/><br/>3)[QUESTA FASE ORA SI SVOLGE SOLO ALL'INTERNO DEL PROGRAMMA JDOWNLOADER TUTTI I COMANDI CHE SCRIVO SONO RIFERITI A QUEL PROGRAMMA] una volta iniziato il download premendo il tasto play da jdownloader<br/>purtroppo il download si interrompe di continuo quindi sara` necessario per alcune volte (quando il download si ferma) cliccare<br/>con il tasto destro sul file che si sta scaricando e selezionare la voce \"resume\". Il download cosi` ripartira per qualche altro minuto<br/>per poi rifermarsi, io ho ripetuto questa procedura fin quando il download non e` terminato e funziona infatti ho gia` fatto partire i<br/>suoi file da vlc media player stamattina.<br/><br/>  Purtroppo non e` molto ingegnoso ma alla fine sono poco piu di 100 mb quindi diciamo che all'incirca se si ripete questa procedura del<br/>\"resume\" si riesce a scaricare il file.<br/>  Per ora e` l'unico modo che ho trovato per scaricare le sue videolezioni.<br/>  Spero di essermi spiegato bene.<br/><br/>  A presto,<br/><br/>        [...]<br/><br/>P.S.<br/>  Per far partire un download da jdownloader il file in questione deve essere riconosciuto dal programma come \"online\".<br/>Se le capita di provare e vede che quando il programma si attiva il file da scaricare risulta offline a me e` gia` successo e non so perche'<br/>ma ad esempio stamattina il file funzioni.zip non riuscivo a scaricarlo perche me lo dichiarava offline e un'ora dopo l'ho potuto<br/>scaricare tranquillamente perche lo dichiarava online.  Forse e` il server che e` impazzito non so.  [...]<br/><br/>===========================================================================<br/><br/></p>"
    }
  ],
  "lezioni": [
    {
      "id": "0",
      "data": "null",
      "contenuto": "<p>  Il diario delle lezioni - dettagliato, e con riferimenti puntuali alla bibliografia - è disponibile alla pagina web</p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: center;\"><a href=\"http://www.mat.uniroma2.it/%7Egavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_2015-16_diario.html\" target=\"ext\">http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_2015-16_diario.html</a></p>\n<p style=\"text-align: center;\"> </p>\n<p> </p>"
    }
  ],
  "materiale": [],
  "programma": "<table><tr><td><p>  Il programma del corso è disponibile alla pagina web</p>\n<p> </p>\n<p style=\"text-align: center;\"><a href=\"http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html\" target=\"ext\">http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html</a></p>\n<p style=\"text-align: left;\"> </p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p>  I testi di riferimento e molto altro materiale didattico liberamente scaricabile) si trovano alla pagina web</p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: center;\"><a href=\"http://www.mat.uniroma2.it/%7Egavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html\" target=\"ext\">http://www.mat.uniroma2.it/~gavarini/page-web_files/mat-didat_data/Matematica_Discreta_%28INF%29/Mat-Dis_mat-didat.html</a></p>\n<p style=\"text-align: center;\"> </p></td></tr></table>",
  "ricevimento": "<table><tr><td><p>Giovedì - ore 16:00  OPPURE  per appuntamento</p></td></tr></table>",
  "modalitàEsame": "<table><tr><td><p>  L'esame consiste in una prova scritta <span style=\"text-decoration: underline;\">e</span> una prova orale, etrambe obbligatorie; <em>condizione preliminare</em> per essere ammessi alla prova orale è aver già superato una prova scritta (con un voto sufficiente, cioè almeno 18/30).</p>\n<p>  Si può sostenere la prova orale in un <em>qualsiasi appello</em> (di qualsiasi sessione) <em>successivo</em> al superamento della prova scritta dell'a.a. 2015-16.</p>\n<p>  Si può sostenere la prova orale <em>anche in un appello successivo o in una sessione successiva</em> a quella in cui si sia superata la prova scritta.</p>\n<p> </p>\n<p style=\"text-align: center;\"><span style=\"font-size: large;\">☆       ☆     ☆   ☆ ☆ ☆   ☆     ☆       ☆ <br> </br></span></p>\n<p style=\"text-align: center;\"> </p>\n<p>  È possibile sostenere la prova scritta anche più di una volta: in tal caso, sarà considerato come rilevante <span style=\"text-decoration: underline;\">il voto più alto</span> ottenuto.</p>\n<p>  Se si sostiene una prova orale <em>senza successo</em> - perché respinti o ritirati - il voto con cui sia stata precedentemente superata la prova scritta <em>resta valido</em> per presentarsi di nuovo alla prova orale; in altre parole, <em>si deve rifare <span style=\"text-decoration: underline;\">soltanto</span> la prova orale, e <span style=\"text-decoration: underline;\">non anche</span> la prova scritta</em>.</p>\n<p>  È possibile sostenere nuovamente la prova orale anche nella stessa sessione di esami.</p>\n<p> </p>\n<p style=\"text-align: center;\"><span style=\"font-size: large;\">☆       ☆     ☆   ☆ ☆ ☆   ☆     ☆       ☆ <br> </br></span></p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: justify;\">  Per partecipare a ciascuna prova (scritta o orale), *<span style=\"text-decoration: underline;\">è necessario prenotarsi</span>*, nei giorni precedenti, attraverso il sito <span style=\"font-size: large;\"><a href=\"http://delphi.uniroma2.it\" target=\"ext\">Delphi</a></span>.  In occasione di ciascuna prova d'esame (scritta e/o orale) <strong>è necessario presentarsi muniti di un documento di riconoscimento</strong> personale <strong><span style=\"text-decoration: underline;\">e</span></strong> (se vi è stato rilasciato) <strong>del libretto universitario</strong>.</p>\n<p style=\"text-align: justify;\"> </p>\n<p style=\"text-align: center;\"><span style=\"font-size: large;\">☆       ☆     ☆   ☆ ☆ ☆   ☆     ☆       ☆ <br> </br></span></p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: justify;\">  Così come il corso è tenuto in italiano, le prove d'esame (scritte e orali) devono essere ugualmente compilate in italiano. In casi particolari - precisamente, per studenti Erasmus o comunque non di madre lingua italiana - lo studente sotto esame può chiedere al docente (prof. Gavarini) di accettare che le prove siano svolte, in alternativa, in <em>inglese</em>, in <em>francese</em> o in <em>spagnolo</em>.</p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: center;\"><span style=\"font-size: large;\">☆       ☆     ☆   ☆ ☆ ☆   ☆     ☆       ☆ <br> </br></span></p>\n<p style=\"text-align: center;\"> </p>\n<p style=\"text-align: justify;\">  Durante le prove d'esame (scritte e/o orali) è vietato l'uso di libri, dispense, appunti, calcolatrici, telefoni cellulari, tavolette (=tablets), scaltrofoni (=smartphones) e quant'altro: in breve, è vietato l'uso di qualsiasi strumento di archiviazione/ricezione/trasmissione/elaborazione di dati che non sia la propria testa.  Saranno valutate possibili eccezioni a questa regola in caso di comprovate esigenze mediche.</p>\n<p style=\"text-align: justify;\">  Durante una prova scritta non è consentito uscire dall'aula in cui si svolge prima di aver consegnato definitivamente il proprio elaborato <em>(salvo emergenze)</em>.</p></td></tr></table>"
}