{
  "nomeCorso": "Analisi Matematica",
  "docente": [
    {
      "first_name": "Florin",
      "second_name": "Radulescu"
    }
  ],
  "annoAccademico": "2011-2012",
  "crediti": "9",
  "settore": "MAT/05",
  "anno": "1",
  "semestre": "1",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td>Il testo consigliato e: \r<br/>Matematica, Bramanti, Pagani, Salsa  ed. Zanichelli \r<br/>programma del corso e; \r<br/>INSIEMI NUMERICI \r<br/>Insiemi, numeri naturali, interi, razionali, principio di induzione, progressione geometrica, binomio di Newton, \r<br/>gli \r<br/>assiomi dei numeri reali, massimo e minimo, estremo inferiore ed estremo superiore. Funzioni e \r<br/>rappresentazione \r<br/>cartesiana, funzioni iniettive, suriettive, biettive, funzioni composte, funzioni invertibili, monotone, lineari, \r<br/>simmetriche, periodiche, limitate. Estremo superiore, estremo inferiore, massimo e minimo di una funzione. \r<br/>Funzione \r<br/>valore assoluto, potenze, radicali, esponenziali, logaritmi, funzioni iperboliche, funzioni trigonometriche. \r<br/>Operazioni \r<br/>sui graﬁci. \r<br/>SUCCESSIONI \r<br/>Introduzione al calcolo inﬁnitesimale, successioni, limiti di successioni, teorema di unicità del limite, \r<br/>successioni \r<br/>limitate, operazioni con i limiti, teorema della permanenza del segno e conseguenze, teorema dei carabinieri, \r<br/>successioni inﬁnitesime, teorema sul limite del prodotto di successioni limitate per successioni convergenti. \r<br/>Forme \r<br/>indeterminate. Successioni monotone, teorema sul limite di successioni monotone, limiti notevoli, confronti e \r<br/>stime \r<br/>asintotiche, inﬁniti di ordine crescente, criterio del rapporto per successioni(s.d.). \r<br/>Serie Criteri: Raporto, Radice \r<br/>FUNZIONI DI UNA VARIABILE: LIMITI E CONTINUITA' \r<br/>Deﬁnizione di limite nei diversi casi, teorema sul legame tra limiti di successioni e limiti di funzioni, limiti \r<br/>notevoli, \r<br/>operazioni con i limiti di funzioni. Funzioni continue, discontinuità, teorema sulla permanenza del segno, \r<br/>teorema degli \r<br/>zeri, teorema di valori intermedi, \r<br/>CALCOLO DIFFERENZIALE PER FUNZIONI DI UNA VARIABILE \r<br/>Derivata di una funzione, signiﬁcato geometrico, equazione della retta tangente, derivate di funzioni \r<br/>elementari, punti \r<br/>di non derivabilità, operazioni con le derivate, teorema di derivazione delle funzioni composte e delle funzioni \r<br/>inverse. \r<br/>Differenziale e approssimazione lineare. Punti stazionari, massimi e minimi locali, teorema di Fermat, teoremi \r<br/>di Rolle \r<br/>e di Lagrange, criterio di monotonia, teorema di caratterizzazione delle funzioni costanti su un intervallo. \r<br/>Ricerca dei \r<br/>massimi e minimi. funzioni concave e funzioni convesse, criterio di convessità per funzioni derivabili (s.d.). \r<br/>Teorema di \r<br/>De L'Hospital (s.d.). Studio del graﬁco di una funzione.  Sviluppo Taylor \r<br/>CALCOLO INTEGRALE PER FUNZIONI  DI UNA VARIABILE \r<br/>Il metodo di esaustione, introduzione all'integrazione secondo Riemann: deﬁnizioni e notazioni, proprietà \r<br/>delle somme \r<br/>integrali,  deﬁnizione di integrale deﬁnito, criterio di integrabilità(s.d.), proprietà dell'integrale deﬁnito, \r<br/>integrabilità \r<br/>delle funzioni continue e delle funzioni monotone(s.d.), teorema della media integrale. Integrale indeﬁnito, \r<br/>deﬁnizione \r<br/>di primitiva, caratterizzazione delle primitive di una funzione in un intervallo, la funzione integrale,  primo e \r<br/>secondo \r<br/>teorema fondamentale del calcolo integrale, metodi elementari per la ricerca di una primitiva,  calcolo di \r<br/>integrali \r<br/>deﬁniti e indeﬁniti,  integrazione per parti e per sostituzione, integrazione di funzioni razionali fratte, \r<br/>integrazione di \r<br/>funzioni irrazionali. Applicazioni geometriche dell'integrale deﬁnito.  Integrali impropri \r<br/>CURVE \r<br/> Lunghezza di una curva \r<br/>Equazioni Differenziale \r<br/>_Primo e secondo grado con coefﬁcienti constanti</td></tr></table>",
  "testiRiferimento": "<table><tr><td>Il testo consigliato e: \r<br/>Matematica, Bramanti, Pagani, Salsa  ed. Zanichelli \r<br/></td></tr></table>",
  "ricevimento": "<table><tr><td>martedi 14-16, stanza 0207</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}