{
  "nomeCorso": "Logica e reti logiche",
  "docente": [
    {
      "first_name": "Benedetto",
      "second_name": "Intrigila"
    }
  ],
  "annoAccademico": "2014-2015",
  "crediti": "6",
  "settore": "INF/01",
  "anno": "1",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [
    {
      "titolo": "Risultati prova 8 febbraio 2016",
      "data": "14-02-2016 23:41",
      "contenuto": "<p>I risultati della prova sono allegati alla pagina del corso</p><hr/>"
    },
    {
      "titolo": "Risultati prova 8 settembre 2015",
      "data": "15-09-2015 22:32",
      "contenuto": "<p>I risultati della prova sono allegati alla pagina del corso</p><hr/>"
    },
    {
      "titolo": "Risultati prova 10/7/15",
      "data": "21-07-2015 18:16",
      "contenuto": "<p>I risultati della prova sono allegati alla pagina del corso</p><hr/>"
    },
    {
      "titolo": "Risultati Prova 19/6/15",
      "data": "24-06-2015 00:26",
      "contenuto": "<p>I risultati della prova sono allegati alla pagina del corso</p><hr/>"
    },
    {
      "titolo": "Algebre di Boole",
      "data": "10-03-2015 00:19",
      "contenuto": "<p>Per questo argomento si può consultare:</p>\n<p>http://www.mat.uniroma2.it/~gealbis/EALalgebre_di_Boole.pdf</p><hr/>"
    },
    {
      "titolo": "GRUPPI",
      "data": "07-03-2015 00:02",
      "contenuto": "<p>TUTTI coloro che seguono il corso, INDIPENDENTEMENTE DALLA FREQUENZA, devono formare dei gruppi e darne comunicazione per email all'indirizzo: intrigil@mat.uniroma2.it.</p>\n<p>I gruppi devono essere formati da almeno tre persone e non più di cinque persone. Coloro che trovano difficoltà a formare i gruppi ne devono dare comunicazione per email all'indirizzo precedente.</p>"
    }
  ],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><p>PRIMA PARTE (LOGICA)<br><br><br><br>1) Aspetti generali della sintassi: <br>- alfabeti<br>- stringhe<br>- operazione di concatenazione<br>- definizioni ricorsive sulle stringhe<br><br>2) Algebre di Boole <br>Assiomi dell'algebra di Boole<br/>Derivazione di uguaglianze booleane dagli assiomi mediante le regole dell'uguaglianza (Dispensa: Calcolo uguaglianza)<br/><br/><br/>3) Calcolo Proposizionale (Dispensa Logica Proposizionale)<br/>(vedi anche http://it.wikipedia.org/wiki/Logica_proposizionale)<br/>3.1) Sintassi della logica proposizionale: <br/>- simboli proposizionali (chiamati anche: variabili proposizionali)<br/>- costanti true/false<br/>- connettivi<br/>- parentesi<br/>- formule ben formate <br/>- precedenza degli operatori<br/>- albero sintattico (vedi dispensa Albero Sintattico)<br/>- definizioni ricorsive su alberi sintattici<br/>3) Semantica della logica proposizionale <br/>- semantica delle costant true/false<br/>- semantica dei connettivi <br/>- assegnazione<br/>- valutazione<br/>- soddifacibilità<br/>- tautologie<br/>-conseguenza logica<br/>- equivalenza logica<br/>- tavola di verità di una formula proposizionale<br/>- completezza dei connettivi logici (vedi dispensa)<br/><br/>4) Sistema assiomatico hilbertiano per la logica proposizionale (Dispensa Sistema Assiomatico Hilbertiano)<br/>- regole di inferenza: sostituzione su assiomi e modus ponens<br/>- dimostrazione<br/>- derivazione da un insieme di premesse<br/>- teorema di deduzione<br/>- correttezza e completezza del sistema assiomatico <br/><br/>5) Calcolo dei Predicati:<br/> - Limiti del Calcolo Preposizionale<br/> - Sintassi del Calcolo dei Predicati<br/>   - Costanti, Termini e Funzioni<br/>   - Predicati e Proprietà<br/>   - Quantificatori<br/>   - Rappresentazione ad albero delle formule<br/> - Semantica del Calcolo dei Predicati<br/>   - Interpretazione: Dominio<br/>   - Interpretazione dei termini<br/>   - Interpretazione degli operatori logici<br/>   - Interpretazione dei quantificatori <br/> - La nozione di Modello<br/>   - Consistenza, Inconsistenza, Validità delle formule<br/>   - Dimostrazione<br/>   - Dimostrazione: il metodo dei Tableau<br/> - Cenni alla assiomatizzazione del Calcolo dei Predicati<br/>   - Teorema di deduzione<br/>   - Consistenza del Calcolo dei Predicati<br/>   - Cenni alla completezza del Calcolo dei Predicati<br/>   <br/>Riferimenti Bibliografici Calcolo Predicati<br/><br/>- Slide presentate a lezione<br/>- Carlucci Aiello Luigia, Pirri Fiora, Strutture, logica, linguaggi, 2005, 336 p., <br/>  Editore Pearson  (collana Accademica).<br/><br/> <br/><br/><br/>SECONDA PARTE RETI LOGICHE<br/><br/>(Riferimenti al libro:<br/><br/>M. Morris Mano - Charles R. Kime<br/><br/>Reti logiche)<br/><br/><br/><br/>1) Segnali logici e segnali analogici<br/>- Elaborazione digitale e analogica, sistemi ibridi<br/>- Digitalizzazione di un segnale analogico: quantizzazione<br/>dell'intervallo dei valori, tempo di campionamento<br/>(Capitolo 1 del libro)<br/>2) Sistemi numerici digitali<br/>- Conversione di numeri interi e decimali in binario<br/>- operazioni aritmetiche in rappresentazione binaria<br/>(Capitolo 1 del libro)<br/>- operazione di somma di numeri positivi con limitazione del numero di bit, overflow<br/>- operazione di differenza fra numeri positivi con comparazione<br/>- operazione di differenza fra numeri positivi con correzione<br/>- operazione di somma (e sottrazione) di numeri interi rappresentati con valore assoluto e segno<br/>- operazione di somma (e sottrazione) di numeri interi rappresentati in complemento a due, condizioni di overflow<br/>(Capitolo 4 del libro)<br/>3) la rappresentazione dei numeri interi decimali in virgola mobile<br/>- segno, mantissa, esponente<br/>- normalizzazione<br/>- operazioni di somma e prodotto<br/>- lo standard IEEE 754 (32 bit)<br/>- problemi nella gestione dei numeri in virgola mobile<br/><br/>(NOTA BENE: questa parte non si trova sul libro, Link su questo punto:<br/>-http://floating-point-gui.de/<br/>- Wikipedia Numero in virgola mobile<br/>- Wikipedia IEEE 754)<br/><br/>4) Circuiti logici combinatori<br/>- algebra di boole {0,1}<br/>- operatori booleani e porte logiche<br/>- funzioni booleane a n argomenti e m valori<br/>- rappresentazione delle funzioni booleane:<br/>tavole di verità, circuiti logici<br/>- qualche esempio di circuito:<br/>half adder, full adder, half subtractor, full subtractor,  bit di parità<br/>- definizione generale di circuito combinatorio<br/>- cenni all'ingegneria dei circuiti: progettazione, sintesi, ottimizzazione<br/>- qualche esempio di uso delle equazioni dell'algebra di boole per la semplificazione dei circuiti<br/>- forme canoniche: forma normale congiuntiva (prodotto di somme)<br/>- forme canoniche: forma normale disgiuntiva (somma di  prodotti)<br/>- il teorema di Shannon<br/>(Capitolo 2 del libro, per il teorema di Shannon:<br/>http://it.wikipedia.org/wiki/Teorema_di_Shannon_%28elettronica%29)<br/>- usi del teorema di Shannon per la sintesi dei circuiti<br/>5) Circuiti logici sequenziali:<br/>- aspetti generali: stato interno, dipendenza dagli ingressi e dallo<br/>stato interno (Punto 5.1 del libro)<br/>- il circuito latch (punto 5.2)<br/><br/> </br></br></br></br></br></br></br></br></br></br></br></p></td></tr></table>",
  "testiRiferimento": "<table><tr><td><p>Per la parte di logica:</p>\n<p>verranno forniti dal docente appunti e/o testi per i vari argomenti</p>\n<p> </p>\n<p>Per la parte di reti logiche:</p>\n<p>M. Morris Mano - Charles R. Kime</p>\n<p>Reti logiche</p></td></tr></table>",
  "ricevimento": "<table><tr><td><p>Per contattare il docente e fissare un appuntamento scrivere a :</p>\n<p>intrigil@mat.uniroma2.it</p></td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}