{
  "nomeCorso": "Laboratorio di sistemi software",
  "docente": [
    {
      "first_name": "Marco",
      "second_name": "Bianchi"
    },
    {
      "first_name": "Marco",
      "second_name": "Bianchi"
    }
  ],
  "annoAccademico": "2005-2006",
  "crediti": "6",
  "settore": "",
  "anno": "3",
  "semestre": "2",
  "propedeuticità": "Nessuna",
  "comunicazioni": [],
  "lezioni": [],
  "materiale": [],
  "programma": "<table><tr><td><b>Test Driven Development (TDD)</b>\r\nIntroduzione al TDD, esempio di sviluppo TDD [1].\r\nSviluppo di un'applicazione Web utilizzando l'approccio TDD: test sul Client tier.\r\n\r\n<b>Tecniche di testing</b>\r\nIntroduzione alle tecniche per il testing di applicazioni Web: test di unità, test di integrazione, test funzionali e test di performance.\r\nTest di unità con mock object: introduzione ai mock object, ciclo di vita di un mock, esempio di utilizzo di mock per il test di DAO.\r\n\r\n<b>Aspect Oriented Programming</b>\r\n(seminari tenuti dal Dott. Antonello Romaniello) \r\nIl principio della separazione dei concern. Problemi di decomposizione. Tangling e scattering. Introduzione alla programmazione orientata agli aspetti. Tecnologie AOP a compile-time e run-time. Introduzione al tool AspectJ. Elementi di cross-cutting: join point, pointcut, advice, introduction, dichiarazioni compile-time, aspetti. Esempi di utilizzo. Il plug-in di Eclipse. Integrazione di AspectJ in Ant.\r\n\r\n<b>JUnit</b>\r\nAssert, testCase, testSuite e testRunner. \r\nEsempi di utilizzo di JUnit.\r\n\r\n<b>CVS</b>\r\nIntroduzione al CVS, panoramica delle operazioni di base (init, import, checkout, update, commit, status e log). Tag e branch. Cenni alla gestione dei conflitti di versione. \r\n\r\n<b>Refactoring</b>\r\nIntroduzione alle tecniche di refactoring, esempio di applicazione delle tecniche di refactoring extract methods, move methods, replace temps with query, replace conditional with polymorphism [2].\r\n\r\n<b>Ant</b>\r\nIntroduzione ad Ant, struttura di un generico file build.xml (project, targer, task), installazione di Ant, analisi e test di un file build.xml di base. Sintassi della linea di comando di Ant, aggiunta di informazioni di aiuto nel build file, controllo dell'output a video in Ant, utilizzo delle variabili di ambiente nel build file, utilizzo di proprieta' da linea di comando e da file di proprietà, definire il CLASSPATH nel build.xml. Introduzione ai directory-based tasks, patterns, fileset, patternset, selectors, selectors containers. Conditional target, esempio di backup con task tar, esempi di backup con task ftp [3]. Utilizzo di ant per il buid e il deploy di un'applicazione web.\r\n\r\n<b>HttpUnit</b>\r\nIntroduzione a HttpUnit, check di una pagina html, navigazione attraverso links, check di una tabella html, test di una form html. Cenni di: esecuzione di test \"da dietro\" un firewall, testare cookies, test di pagine sicure [3].\r\n\r\n<b>JUnitPerf</b>\r\nIntroduzione a JUnitPerf, architettura del tool (pattern decorator), regole per la creazione di un TimedTest e di un LoadTest, test del throughput con condizioni di carico variabile, test del tempo di risposta per un singolo utente in funzione delle condizioni di carico di lavoro del test target [3]. \r\n\r\n<b>Cactus</b>\r\nIntroduzione a Cactus, architettura e principi di funzionamento del framework, oggetti impliciti, regole per la scrittura di un test Cactus, file di configurazione di Cactus. Esempi: testare la corretta gestione dei dati inviati da una form a una servlet di autenticazione, testare la sessione di un carrello virtuale [3].\r\n\r\n<b>JCoverage</b>\r\nIntroduzione al code coverage. Tipi di code coverage. Classificazione dei tool di instrumentazione. Presentazione del tool JCoverage.\r\nStatement e Branch coverage con JCoverage. Report. Impostazione dei \"valori di soglia\". Integrazione di JCoverage con Ant.\r\n\r\n<b>JMeter</b>\r\nIntroduzione a JMeter, esempi di utilizzo e utilizzo combinato JMeter-JUnitPerf.\r\n\r\n<b>Varie</b>\r\nIntroduzione al pattern DAO .\r\nTecniche di implementazione di un DAO: accesso diretto al db, utilizzo di JNDI per indirezione a un livello e a due livelli (cfr. materiale on line).\r\n</td></tr></table>",
  "testiRiferimento": "<table><tr><td>[1] K. Benck, Test-Driven Development by Example - Addison Wesley - ISBN: 0321146530\r\n[2] M. Fowler,Refactoring - Improving the Design of Existing Code, Addison Wesley - ISBN: 0201485672\r\n[3] Eric M. Burke, Brian M. Coyner - Java Extreme Programming Cookbook - O'REILLY - ISBN: 0-596-00387-0 \r\n\r\nMateriale disponibile on line:\r\n\r\n<b>TDD</b>\r\nDraft del testo \"Test-Driven Development by Example\" di  K. Benck.\r\nPer scaricarlo e' necessario iscriversi al gruppo Yahoo chiamato \"testdrivendevelopment\"\r\nhttp://groups.yahoo.com/group/testdrivendevelopment/files/TDD17Jul2002.pdf\r\nIn alternativa:\r\nhttp://www.mif.vu.lt/~alga/xp/TDD17Jul2002.pdf\r\n\r\n<b>JUnit</b>\r\nLa maggior parte del materiale (documentazione e articoli) disponibile on-line e' raggiungibile a partire dal sito di JUnit:\r\nhttp://www.junit.org/\r\nAttenzione alla versione di JUnit a cui si fa riferimento (4.0 vs. 3.8 e precedenti).\r\n\r\n<b>CVS</b>\r\nOpen Source Development with CVS, 3rd Edition (eBook)\r\nhttp://cvsbook.red-bean.com/\r\n \r\n<b>Refactoring</b>\r\nIl capitolo contenente l'esempio di refactoring delle classi movie, rental e customer è disponibile on-line alla URL:\r\nhttp://www.awprofessional.com/content/images/0201485672/samplechapter%5Cchap4.html\r\n\r\n<b>Mock objects</b>\r\nUn punto di partenza per lo studio dei mock objects è il sito:\r\nhttp://www.mockobjects.com/\r\n\r\n<b>Varie</b>\r\nAccesso ai database in J2EE di Giovanni Puliti \t(Mockabyte n.94):\r\nhttp://www.mokabyte.it/2005/03/j2ee-datasources.htm\r\n\r\n<b>Codice</b>\r\nE' possibile scaricare i sorgenti allegati ai testi consigliati agli indirizzi:\r\nCodice di Java Extreme Programming Cookbook:\r\nhttp://examples.oreilly.com/jextprockbk/\r\n</td></tr></table>",
  "ricevimento": "<table><tr><td>Da concordare con il docente al termine della lezione.</td></tr></table>",
  "modalitàEsame": "<table><tr><td>null</td></tr></table>"
}